{
  "products" : [
    {
      "id" : "1",
      "name" : "HDMI-Wall-Face-Plate-Single-Panel",
      "description" : "The cable wall plate with HDMI Jack insert is a great solution for a customized installation.Wire your house cleanly and efficiently for audio / video with this dual port HDMI wall plate. You no longer have to resort to messy cables hanging out of an ugly hole in the wall. This wall plate is the perfect means for HDMI ports to remotely access HD displays or media sources.",
      "price" : "2,500.00 ",
      "instock" : "12",
      "category" : "Audio Accessories",
      "photo" : "0001.png"
    },
    {
      "id" : "2",
      "name" : "Waterproof GPS Car Tracker - ST-901 with ACC detect igintion",
      "description" : "This is a mini Waterproof Builtin Battery GSM GPS tracker for Car motorcycle vehicle tracking device with online tracking system software.",
      "price" : "14,600.00",
      "instock" : "10",
      "category" : "Car Alarm System & Security",
      "photo" : "0002.png"
    },
    {
      "id" : "3",
      "name" : "GPS Car Tracker - GT02A",
      "description" : "GT02A is a Mini intelligent GPS Vehicle positioning terminal. It combines the GSM wireless communication technology and GPS positioning system technology,terminals using industrial-grade highly integrated design,intelligent power-saving and passive drift suppression,installation is simple,connect the power supply to start work immediately,wide inpute voltage range,wide applicable to all types of cars,motor cycles,electric cars,ships,etc., can provide all-weather,real-time vehicle positioning function,with global positioning service platform,you can achieve remote vehicle management",
      "price" : "13,000.00",
      "instock" : "10",
      "category" : "Car Alarm System & Security",
      "photo" : "0003.png"
    },
    {
      "id" : "4",
      "name" : "GPS Car Tracker - TK102B ",
      "description" : "Simply insert a GSM sim card into the GPS unit. Whenever you call the unit it will respond with the coordinates of its location thru a SMS message. You can then use these coordinates on any mapping software (for example Google Earth) which will show where exactly the unit is located.",
      "price" : "13,500.00",
      "instock" : "23",
      "category" : "Car Alarm System & Security",
      "photo" : "0004.png"
    },
    {
      "id" : "5",
      "name" : "1000M Telescopic 8X Monocular Golf Sport Hunting Laser Rangefinder ",
      "description" : "1, Measuring Distance/Speed/ Angle/ Height all in one device. 2, Built-in 3.7V 750MAH Li-ion polymer battery, Single Measuring 30000 times after one time full charging. 3, Battery life: Charger-discharger 800 times. 4,Original double injection molding shell, so that the product is more solid",
      "price" : "71,000.00",
      "instock" : "23",
      "category" : "Measuring & Layout Tools",
      "photo" : "0005.png"
    },
    {
      "id" : "6",
      "name" : "Wireless Presenter with Laser Pointer ",
      "description" : "This high quality 2.4 GHz Wireless Remote Red Laser Pointer Presentation Black is small and exquisite, portable and with rich applications. It is an essential assistant for demonstrations and presentations; you can easily point to the PPT (PowerPoint) or whiteboard in any corner of the classroom/hall with ease and convenience. It helps in making your demonstrations and presentation more dynamic and interactive. This laser pointer is also the best gift for friends and families.",
      "price" : "4,400.00",
      "instock" : "21",
      "category" : "Remote Control",
      "photo" : "0006.png"
    },
    {
      "id" : "7",
      "name" : "Afootol Automatic Fire Extinguisher Ball ",
      "description" : "The Revolutionary Fire Extinguisher and Alarm System. Fire Extinguisher ball is a kind of shaped ball extinguisher. When simply thrown into the fire, it would activate within 3 seconds and effectively disperse extinguishing chemicals. When a fire occurs and no one is present, fire extinguisher ball will self-activate when it comes into contact with fire and give loud noise to warn the people nearby. Due to this feature, it can be placed in many fire prone areas, such as electrical circuit breakers, or kitchen, cars, hotels, etc. There is no special training or skill required to operate the ball and no need to face any dangers. No inspection and maintenance are required for the product life span for 5 years.Fire Extinguisher ball is a kind of shaped ball extinguisher. When simply thrown into the fire, it would activate within 3 seconds and effectively disperse extinguishing chemicals. When a fire occurs and no one is present, fire extinguisher ball will self-activate when it comes into contact with fire and give loud noise to warn the people nearby. Due to this feature, it can be placed in many fire prone areas, such as electrical circuit breakers, or kitchen, cars, hotels, etc. There is no special training or skill required to operate the ball and no need to face any dangers. No inspection and maintenance are required for the product life span for 5 years.",
      "price" : "9,950.00",
      "instock" : "12",
      "category" : "Fire Extinguishers",
      "photo" : "0007.png"
    },
    {
      "id" : "8",
      "name" : "Memoscan U480 Can-bus Obd2 Engine Scanner Code Reader ",
      "description" : "With U480 code reader, you may quickly find out trouble causes (troubleshooter) of electronically controlled systems on your car, by simply connecting U480 with the 16 PIN diagnostic socket, via reading the trouble code (DTC) shown on U480, identifying, locating and checking out trouble causes with attached user's manual. U480 Function 1.Works on all 1996 and newer cars & trucks that are OBD II /EOBD compliant including CAN, VPW, PWM, ISO and KWP2000 protocol 2.Reads and clears generic and manufacturer specific Diagnostic Trouble Codes (DTCs) and turns off check engine light.",
      "price" : "9,900.00",
      "instock" : "12",
      "category" : "Automotive Tools & Accessories",
      "photo" : "0008.png"
    },
    {
      "id" : "9",
      "name" : "2017 Version D900 OBD2 Universal Diagnostic Car Scanner With Kit Bag ",
      "description" : "Universal 2017 D900 OBD2 Code Reader Scanner Automotive OBDII EOBD JOBD Diagnostic Scann Tool  Better. Fast scan and clear trouble codes, even a beginner can use this unit to read the error code, find out what the problem is and perhaps fix it. Save money and time.",
      "price" : "12,670.00",
      "instock" : "12",
      "category" : "Automotive Tools & Accessories",
      "photo" : "0009.png"
    },
    {
      "id" : "10",
      "name" : "ELM Bluetooth OBD II 2 Car Diagnostic Scanner Tool ",
      "description" : "With Super Mini size. The newly developed wireless scan tool. It supports all OBD-II protocols. It adopts the latest version 2.1",
      "price" : "6,999.00",
      "instock" : "21",
      "category" : "Automotive Tools & Accessories",
      "photo" : "00010.png"
    },
    {
      "id" : "11",
      "name" : "Digital LCD Portable Indoor Outdoor Thermometer Hygrometer- DC103",
      "description" : "Digital LCD Portable Indoor Outdoor Thermometer. Indoor Hygrometer.With a wired external sensor that can be strung to the outside of your house to sense external temperature as well as a built-in sensor to simultaneously measure the indoor temperature. Indoor temperature: -10 Celsius?+50 Celsius (+14 Fahrenheit ? +122 Fahrenheit). Outdoor temperature: -50 Celsius?+70 Celsius (-58 Fahrenheit ? +194 Fahrenheit)Indoor Humidity: 20%RH?90%RH \r\nUse battery: 1 * 1.5V (AAA) battery(Not included) \r\nSensor cable length: Approx. 90cm / 35.4in \r\nProduct size: 70 * 81 * 20mm / 2.8 * 3.2 * 0.8in\r\n Product weight: 66g / 2.32oz",
      "price" : "4,000.00",
      "instock" : "22",
      "category" : "Measuring & Layout Tools",
      "photo" : "00011.png"
    },
    {
      "id" : "12",
      "name" : "AmazonBasics 9 Volt Everyday Alkaline Batteries -8-Pack",
      "description" : "AmazonBasics brings you everyday items at a great value An Amazon Brand, A 9V Alkaline batteries which are often used in applications like fire alarms, where the battery must sit for year or more. Pack of eight 9 Volt Alkaline Batterie 3-year shelf life so you can store for emergencies or use immediately Works with a variety of devices including digital cameras, game controllers, toys, and clocks; do not attempt to recharge",
      "price" : "8,500.00",
      "instock" : "22",
      "category" : "Sealed Maintenance Free Batteries",
      "photo" : "00012.png"
    },
    {
      "id" : "13",
      "name" : "3200 Lumen Edumate Projector with Desktop PC Core i3 3.4GHz- 4GB RAM -1TB HDD -Ceiling Mount",
      "description" : "Edumate Projector with Intel(R) core i3(3.4Ghz) Processor, 4GB RAM and 1TB HDD. \r\nProjection system with 3200 lumens and High resolution, Supports both Microsoft Windows & Open Source (Linux ) platforms \r\nThe on-board 10/100/1000-Mbps Ethernet LAN connectivity offers internet connectivity \r\nEdumate is designed for high-end performance and facilitates use of both 2D and 3D multi-media content and other applications. Edumate-large Memory capacity of 4GB RAM backed by Intel(R) Extreme Graphics controller Edumate facilitates use of Wireless Keyboard, Mouse and Remote Controller for TV. Projection system integrates High Lumens (3200 Lumens minimum) Lamp with DLP technology and remote control for increased throw and ultra-bright focus. \r\nInbuilt TV tuner facilities and can work as a TV. USB Ports for connecting external devices like Scanner, Printer, webcam etc. Internet Ready Systems with Wifi Adapter \r\nInbuilt Stereo Speakers on Integrated High Definition audio to support hi-end audio output. \r\nEasy to operate \r\nComes with user Manual and Instructions. A Free Ceiling Mount is Added to easily Mount and Use",
      "price" : "120,000 ",
      "instock" : "2",
      "category" : "Video Projectors",
      "photo" : "00013.png"
    },
    {
      "id" : "14",
      "name" : "Wireless Weather Station with Alarm Clock- Temp, Humidity, Alarm Clock & Weather Forecast ",
      "description" : "Measure indoor and outdoor temperature and humidity.With wireless technology, it can show outdoor temperature in indoor receiver.Remote transmission of outdoor temperature by 433MHz signals. Multiple functions: calendar, alarm, snooze and weather forecast.Can set indoor/outdoor temperature and humidity alert.2 temperature units for choice: Celsius(°C) or Fahrenheit(°F).The LCD screen with color display, enjoyable to read.It can be wall mounted or placed on the table. \r\nSpecifications \r\nTemperature Measurement: 0~50°C / 32~122°F(indoor) -20~70°C / -4~158°F(outdoor \r\nTemperature Resolution: 0.1° \r\nHumidity Measurement: 20%-95%R \r\nTransmitter Battery: 2 x 1.5V AAA Battery(not included \r\nReceiver Battery: 2 x 1.5V AAA Battery(not included) \r\nTransmitter Size: 9.5 x 6 x 2.5cm / 3.7 x 2.4 x 1in \r\nTransmitter Weight: 67g / 2.4oz \r\nReceiver Size: 20 x 12 x 2.5cm / 7.9 x 4.7 x 1in \r\nReceiver Weight: 236g / 8.4oz \r\nPackage Size: 26.5 x 13 x 3.5cm / 10.4 x 5.1 x 1.4in \r\n\r\nPackage Weight: 378g / 13.3oz ",
      "price" : "18,500",
      "instock" : "2",
      "category" : "Measuring & Layout Tools",
      "photo" : "00014.png"
    },
    {
      "id" : "15",
      "name" : "80M Laser Distance Rangefinder Meter with Camera and Point Finder for Outdoor Operation",
      "description" : "This is a very well built, versatile, accurate and labor intensive digital laser distance meter. It greatly improves speed and accuracy, makes field work easy, mindless and more accuracy. The measuring origin can be set to the front, back or middle. Simple measuring is very easy: just press the MEAS key once to turn on the laser; point it to where you want to measure and press the MEAS key again. The distance can be displayed in inches/feet (both decimal and fractional) or meters. You can cycle through the various units by pressing the UNIT key.Other options include area, cubic volume, indirect measurement, the ability to add/subtract measurements...etc.The meter has Large TFT LCD 4 lines Display, digital Level, Camera, USB Connection, Self Calibration function, Area & Volume Addition/Subtraction, Straking-out.Hightlights: Easy targeting with bright laser pointer, a labor intensive distance measurer makes field work easy, mindless & accurate. Ideal for home, construction and industries, especially in large areas such as rooms, apartments, buildings, real estates, factories, warehouses, etc.Double injection enables durable and well build, non-slip rubber-like material around the edge enables a solid grip and the buttons respond nicely.Wide measuring range from 0.05 to 120m, High accurate measuring +/-2mm,Multi unit selection of meter, inch and feet; Digital level, Large TFT LCD Display, Digital Level, USB Connection.Multi Measurement Modes: Single-distance Measurement, Continuous Measurement, Area & Volume Measurement, Area & Volume Addition/Subtraction, Indirect Pythagoras Measurement 2 year warranty, supports data hold and data clear function, Supports data store/recall function, IP54 protection Auto/Manual power off",
      "price" : "62,000.00",
      "instock" : "23",
      "category" : "Measuring & Layout Tools",
      "photo" : "00015.png"
    },
    {
      "id" : "16",
      "name" : "3 In 1 Multi-parameter Water Quality Tester Monitor ",
      "description" : "The water quality monitor is professional and useful tool for testing PH/TDS/TEMP of solution level. Suitable for aquarium pool and environmental water.Portable Pen Type PH Temperature TDS Features: Use to measure the PH & TDS & TEMP of solution.Electrode probe can be replaced, ATC function.Easy calibration of pH and TDS with just a mini-screwdriver.Large and clear LCD with backlight, easy to read and accurately measuring functions.Apply in water sources, aquarium, hydroponics, spas, swimming pools and other water systems.Automatic temperature compensation.Specifications:Range: pH: 0.00 ~ 14.00pHTDS: 0.00 ~ 19990ppmTemperature: -50°C~ 70°C (-58°F~ 158°F)Resolution: pH: 0.01pHTDS: 10ppmTemperature: 0.1°C (0.2°F)Accuracy: pH: ±0.1pHTDS:±2%F.S Temperature: ±1°C (±2°F)Temperature Compensation: 0°C ~ 50°C (32°F ~ 122°F)Working temperature: 0°C ~ 50°C (32°F ~ 122°F)Power Supply: DC 6V (Power Adapter Usable) Battery: 4×1.5V AG-13 Button Cell Batteries (NOT Included)Item Size: Approx. 188 * 35 * 35mm / 7.4 * 1.6 * 1.6inItem Weight: Approx. 80g",
      "price" : "19,500.00",
      "instock" : "12",
      "category" : "Measuring & Layout Tools",
      "photo" : "00016.png"
    },
    {
      "id" : "17",
      "name" : "Digital Grain Moisture Meter ",
      "description" : "The grain moisture meter is used for fast and accurate measurement of moisture in the process of allotment, acquisition, storage, machining of packed grains, feedstuff, powder.It is able to measure grains up to 22 species.The cup type measurement causes small error and it has wide measuring range.With storage and statistical functions it can store 240 groups of measurements.Two presentations, digital display and color coded LED indication.It uses the exclusive Micro-computer LSI circuit and crystal time base to offer high accuracy measurement. It can obtain automatically the temperature corrected moisture value.Technology parameter: Grains - 22 SpeciesMeasuring Range 0~50 %Accuracy ±(0.5n%+0.5)Resolution 0.1Display 4 Digits, 10 mm LCD, With Color Coded LED IndicatorLED Indicator Green LED represents a safe, air-dry stateYellow LED represents a borderline stateRed LED represents a damp stateCalibration AutomaticBattery Indicator Low Battery IndicatorOperating Conditions Temperature: 0~50 %°C, Humidity: < 90 %RHPower Supply 4 x 1.5V AAA Size (UM-4) BatteryDimensions Uint: 150 x 65 x 30 mmSensor: 175 x 76 x 76 mm Grain Types: Japonica Rice, Soya Beans, Wheat, Rapeseed, Corn, Barley, Indica Rice, Rice, Bean Pulp, Peanut, Rapeseed Meal, Granulated Feed, Sunflower seed, Watermelon Seed, White Wheat, Sorghum, Black Sesame, Northeast Corn, Cotton seed, Cottonseed Meal, Coffee Beans, Cocoa Beans",
      "price" : "137,500.00",
      "instock" : "2",
      "category" : "Measuring & Layout Tools",
      "photo" : "00017.png"
    },
    {
      "id" : "18",
      "name" : "Universal  Night Driving Glasses - Anti Glare Vision Driver Safety Sunglasses",
      "description" : "chili oil, garlic, celery",
      "price" : "4,850.00",
      "instock" : "2",
      "category" : "Glasses & Sunglasses",
      "photo" : "00018.png"
    },
    {
      "id" : "19",
      "name" : "360° Panoramic Hidden Fish Eye Camera LED Light Bulb 1080P HD ",
      "description" : "360 degrees panoramic view.Support Motion detection.Advanced e-PTZ on split video.Simultaneous multi H.264 streams support.iPhone and Android apps available for remote viewing.Free client software.Plug & Play smart access without IP setting via routers.Support paging browsing, automatic round tour.Support digital zoom on preview & playback.Very easy for operation & installation.It can be used on many occasions, Baby Monitor, Elderly Care, Small Store Management and Room Surveillance.Specifications:Lens: 1/2.5 Fish Eye Lens 2.8mmResolution: 2.0MP, 1920 x 1080PMin. Illumination: 0.001LuxVideo Image Compression: H.264Frame rate: 25 fpsImage adjustment: The brightness, contrast, saturation, chromaticity, can be adjustableWhite balance: AutomaticInfrared mode: Automatic, manual (on/off)Night-vision Supported, IR-Cut, Night visibility up to 10m.Input: Built-in microphone Output: Build-in speaker.Network: Ethernet Interface Built-in 10/100Mbps, Auto MDI/MDIX, RJ-45Wireless Standard: WIFI (IEEE802.11b/g/n)Protocol: HTTP, FTP, TCP/IP, UDP, SMTP, DHCP, PPPoE, DDNS, UPnP, GPRSIP mode: Dynamic IP address, static IP addressWireless Security: WEP & WPA WPA2 EncryptionHardware Interface: Memory Micro SD Card (Support 64G) (NOT included)Audio Input/Output: Built in audio inputReset Buttons: One ResetMobile Phone: Support iPhone, Android, iPadWorking Environment: IndoorsVoltage: 110V-240VPower supply: DC12V/1.6APower consumption: 2WColor: WhiteMaterial: ABS (Acrylonitrile Butadiene Styrene)Size: Approx. 14.5 x 8.7cm/5.71 x 3.43''Note:1. No Support Mac computer/ No support IE, Chrome other browser view Not Support 5G Network/ Router. Only support 2.4G router/ 4G phone network.2. The camera power supply comes from the power switch, to use the camera, you need to keep the power switch on. Turn off the power switch, the camera will turn off. If possible, please let the camera connect to independence power switch.Package Included:1 x Light Bulb IP Camera1 x Fitting Base1 x Fitting Screw Kit1 x User Manual",
      "price" : "27,500.00",
      "instock" : "12",
      "category" : "Safety and Security",
      "photo" : "00019.jpg"
    },
    {
      "id" : "20",
      "name" : "Water Quality Tester for PH, EC, Temperature - 3 in 1 ",
      "description" : "Features:Test temperature in degrees / Fahrenheit(switchable unit)Use to measure the pH & EC & TEMP of solutionElectrode probe can be replaced, ATC functionEasy to carry and simple to operateEasy calibration of pH and EC with just a mini-screwdriverAutomatic temperature compensationLarge and clear LCD with backlight, easy to read and accurately measuring functionsApply in water sources, aquarium, hydroponics, spas, swimming pools and other water systems.The water quality monitor is professional and useful tool for testing PH/EC/TEMP of solution level. Perfect for wide applications, such as beverage, fish hatcheries, food processing, aquarium, photography, laboratory, quality control, school & colleges, swimming pools, water conditions.Specifications:Range: pH: 0.00 ~ 14.00p EC: 0.00 ~ 19990us/cmTemperature: -50 degrees~ 70 degrees (-58 Fahrenheit~ 158Fahrenheit )Resolution: pH: 0.01pEC: 10us/cmTemperature: 0.1 degrees (0.2 Fahrenheit)Accuracy: pH: ±0.1pHEC:±2%F.STemperature: ±1 degrees (±2 Fahrenheit)Temperature Compensation: 0 degrees ~ 50 degrees (32 Fahrenheit~ 122Fahrenheit)Working temperature: 0 degrees ~ 50 degrees (32 Fahrenheit ~ 122 Fahrenheit)Power Supply: DC 6VBattery: 4×1.5V AG-13 Button Cell BatteriesColor: GreMaterial: ABItem Size: Approx. 188 * 40 * 40mItem Weight: Approx. 75.7g / 2.7oPackage Size: Approx. 21 * 10.4 * 5cmPackage Weight: Approx. 158g",
      "price" : "19,600.00",
      "instock" : "12",
      "category" : "Measuring & Layout Tools",
      "photo" : "00020.png"
    },
    {
      "id" : "21",
      "name" : "Full HD 1080p Hidden WiFi Light Bulb Camera ",
      "description" : "Monitor your home and office with this bulb from your phone New hot:  bulb p2p wifi camera, motion activated security hidden camcorder dvr,real-time audio & video recording, ir night vision with invisible infrared light Motion detection & infrared: to save on memory space and electricity, the santa spy bulb's hidden camera can be set to record only when motion is detected. It is also equipped with infrared capabilities, which helps it capture the scene even when there is no light in the room, keeping you informed of any happenings in the dark of night.Wifi wireless: wifi ip network function. Disguised as a family bulb, this wi-fi ip camera transmits secure, interference free, video signal directly to your wireless router for remote viewing and recording.Most practical: support smartphone tablet app remote view and control; support pc computer view and control; email alert;7/24 hours non-stop recording; support 32gb tf card in max(not included); circle storage;High definition: spy mirror bulb produces 1280x960p full HD video so recorded events are always crystal-clear",
      "price" : "32,000.00",
      "instock" : "2",
      "category" : "Safety and Security",
      "photo" : "00021.png"
    },
    {
      "id" : "22",
      "name" : " Uniclass Android Smart TV Box",
      "description" : "Make your TV smart and turn it to Computer to ease teaching and learning for school, home, office, churches among othersUniclass pre-loaded with Android os version 4.2 osProcessor-rk3066 cortex-a9 dual core 1.5ghzInternal Memory- 2gb  r.a.m- 512mbYou can connect your keyboard, mouse to run as a computer, to run office activitiesRuAndroidid applications such as satelitte tv and many othersComes with wi-fi and lan capabilities for connecting to the internetHas three (3) usb ports for connecting your hard drive, flash drive, and other devices.The product can be connected to a projector or even a television, making it an ideal digital teaching device for homes and school e.t.cHas an inbuilt card reader, comes with an hdmi cable and av cablesEquipped with an air mouse for easy navigation",
      "price" : "6,500.00",
      "instock" : "20",
      "category" : "Smart Home Automation Devices",
      "photo" : "00022.png"
    },
    {
      "id" : "23",
      "name" : "Portable PH & Chlorine Meter for Swimming Pool, Spa, Water Quality Monitor and Checker ",
      "description" : "Description:This water quality tester is designed to test pH and chlorine level for swimming pool and spa. It is easy to operate, no more chemicals need. Large screen quickly shows the test result with high precision. Light weight and compact, easy to carry.Features:1. Made of premium plastic shell, durable and sturdy.2. Easy to operate, no more chemicals need.3. A convenient tool to test water pH and chlorine level for swimming pool and spa.4. Large screen displays the test result on pH and chlorine level for easy and accurate reading.5. Light weight and compact, easy to carry. With a hole for convenient hanging.Specifications:Condition: 100%Material: Plastic + MetalColor: Gray WhiteSize: approx. 18 x 11.6 x 3.1cm / 7.1 x 4.6",
      "price" : "14,250 ",
      "instock" : "8",
      "category" : "Measuring & Layout Tools",
      "photo" : "00023.png"
    },
    {
      "id" : "24",
      "name" : " Indoor Outdoor Thermometer Hygrometer - Analog",
      "description" : "Features:100% brand new and high qualityModern type thermometer&hygrometerEasy to readHooking hole available with adjustable portWidely used for measurement of the temperature and humidity in house, school, office, hotel, factory, storeroom etcSpecifications:Humidity measurement range: 0 to 100% RHTemperature measuring accuracy: -5 to 55 CelsiusDiameter: approx 100mmNet weight: 135g",
      "price" : "4,300.00",
      "instock" : "2",
      "category" : "Measuring & Layout Tools",
      "photo" : "00024.png"
    },
    {
      "id" : "25",
      "name" : "Stage Wireless Lavalier Lapel Headset Microphone System Mic FM Transmitter- VHF ",
      "description" : "Communication:WiredConnectors:AUXFrequency Response Range:8-22000HzFunction:Microphone,Sport,Supports musicLine Length:1.3mModel Number:32303920372gPackage:YesPlug Type:L BendingResistance:98OSensitivity:122±3dBStyle:Headset MicrophoneSupport APP:NoSupport Apt-x:NoSupport Memory Card:NoVocalism Principle:ElectrostaticWaterproof:No",
      "price" : "7,500.00",
      "instock" : "5",
      "category" : "Stage, Studio & Recording Equipment",
      "photo" : "00025.png"
    },
    {
      "id" : "26",
      "name" : "Digital Indoor and Outdoor LCD Thermometer & Hygrometer Weather Station with Alarm Clock ",
      "description" : "This Digital Thermometer is characterized by the large LCD screen which is designed for easy readouts of the humidity and temperature measurements.The cable with probe is for measurement of the outdoor temperature and humidity and the internal sensor inside the thermometer is for indoor measurement. For convenient installation, the hole and the stand back of the thermometer makes it can be used on the wall and desk or the table.\r\n\r\n\r\nFeatures:\r\nModern type outdoor indoor desk thermometer with hygrometer.\r\nOne cable with probe for feeling the outdoor temperature and humidity.\r\nIndoor and outdoor temperature (min. or max.) and humidity (max. or min.) display.\r\nOne hole and one stand back of the thermometer that you can use on the home wall or desk table.\r\nRectangle white plastic appearance and wide LCD screen.\r\nOne switch back of the thermometer that you can adjust Centigrade or Fahrenheit.\r\nThree buttons which is in the front of the thermometer (Max, Min, Reset).\r\nClear and correct display with easy to read Arabic number.\r\nOutdoor Temperature range: -50 to 70 Centigrade (-58 to 158 Fahrenheit).\r\nIndoor temperature range: 0 to 50 Centigrade (32 to 122 Fahrenheit).\r\nThe outdoor humidity can display on the screen when you are out; the indoor humidity can display on the screen when you are in, but they are not display at the same time.\r\nIt is widely used for the measurement of the temperature and humidity in houses, offices, workshops, schools, markets, warehouses, etc.\r\n\r\n\r\nSpecifications:\r\nDevice Type: Thermometer Hygrometer Temperature Humidity Meter\r\nMaterial: Plastic\r\nTemperature Precise: 0.1 Centigrade\r\nHygrometer Range:    25% RH to 98% RH\r\nPower Source:    One AAA Battery (NOT INCLUDED)\r\nSize: 12.5cm * 7.0cm * 1.92cm\r\nCable Length: 1.5 m\r\nWeight: 110g\r\nColor: White\r\nPowered by one AAA battery (NOT INCLUDED).\r\nOutdoor Temperature Range: -50 to 70 Centigrade (-58 to 158 Fahrenheit)",
      "price" : "5,890.00",
      "instock" : "22",
      "category" : "Measuring & Layout Tools",
      "photo" : "00026.png"
    },
    {
      "id" : "27",
      "name" : "Digital Grain And Powder Moisture Meter - TK100S ",
      "description" : "If you are or know someone who is dealing with a lot of grains and powders, you most likely use one of these on a regular basis. If you have a bag of rice or flour, how will you know it’s not going to mold? Well, we wouldn’t know until we measure the content with a moisture meter. This is why we try our best to provide quality meters to improve your lives without having to spend a fortune.\r\n\r\nWhether it is for industrial use or households, we guarantee this meter will get the job done. Accurate meters like these will definitely benefit households and our goal is to provide these meters for not only industrial use, but also regular households.\r\n\r\nIf your family is into baking and culinary activities, this meter will come in great use. Most households, including our own office, have a lot of products which can potentially absorb too much moisture.This digital moisture meter is also ideal for measuring for example sand, soil, grains, flour, rice or anything powdered. You can simply just take it out of the box and start using it, no calibration or settings needed. It is so easy we sometimes question the reviews and technical questions online.\r\n\r\nThe digital moisture meter does not allow savings of data but instead there is a simple hold function that gives you time to see the reading, even if you remove the sensors away from the sample. We recommend this meter to anyone who cares and want to have a fresh and safe household.",
      "price" : "27,500.00",
      "instock" : "2",
      "category" : "Measuring & Layout Tools",
      "photo" : "00027.png"
    },
    {
      "id" : "28",
      "name" : "LCD Digital Grain Moisture Meter & Humidity Tester - MD7822",
      "description" : "Portable Digital Grain Moisture meter for: Rice, Paddy, Maize and Wheat Moisture tester.\r\n\r\n1. Manual off at any time\r\n\r\n2. High precision moisture meter\r\n\r\n3.Grain Moisture Meter is used for fast and accurate measurement of moisture in the process of allotment, acquisition, storage, machining of packed grains,  Corn,  Rough Rice, , Paddy and Wheat.\r\n\r\nSpecification:\r\n\r\n    Moisture measuring range: 2% to 30%\r\n    Maximum error : ± (1%Rh +0.5)\r\n    Resolution: 0.5%\r\n    Temperature measuring range: - 10°C to 60°C\r\n    Maximum error: ±2°C(±4°F)\r\n    Resolution: 1°C /2°F\r\n    Environment: Ambient temperature: - 10°C to 40°C\r\n    Ambient humidity: 0~70%RH\r\n    Weight:460g\r\n    Dimension: 170*170*50mm (main unit)\r\n    440*60*60mm (measurement probe)\r\n    Accessories: portable box, operation manual, measurement probe\r\n",
      "price" : "18,500.00",
      "instock" : "12",
      "category" : "Measuring & Layout Tools",
      "photo" : "00028.png"
    },
    {
      "id" : "29",
      "name" : "High Quality 5/8 \" 120cm Aluminum Tripod for Laser Level Meter ",
      "description" : "1. Easily to put on and off. works most of Laser level\r\n2. The weight is very light it's about 1kg And packed with a carry bag convenient to carry for carry\r\n3. Dual spirit level Design includes two (2) adjustment knobs to dampen panhead effect when applicable with abilities to any angle with precision and efficiency\r\n4. 3-section column leg with quick release locks provides a more convenient stance satisfying your desired height\r\n5. Leg angle adjustment lock ensures single adjustment of each leg.\r\n6. The center axis inverted function ensures you lowest shooting.\r\n7. Non-slip rubber feet.",
      "price" : "8,000.00",
      "instock" : "6",
      "category" : "Measuring & Layout Tools",
      "photo" : "00029.png"
    },
    {
      "id" : "30",
      "name" : "Outdoor Receiver for Laser Level & Precision Detector up to 50M ",
      "description" : "The Outdoor receiver is designed to pick up the laser signal from a rotary laser. This receiver has a front and back LCD display for easy readoutQuickly and accurately locates any laser signal emitted from rotary or \"pulsed beam \"line-generatingDual sided on grade LED indicator lights with high low on grade and audible signalsCan detect the laser signal up to 50 meters (164 feet) and can be put on anywhere with the clampUniversal detector,for any red and green laser with a frequency within 10000Hz9V batteries required and includedNote: - If you buy a laser level with no outdoor's function, then you will not be able to use laser level and laser level detector together.- When you use outdoor detector combined with laser level, First, you must open laser level's \"OUT\" or \"Outdoor\" button if not, the outdoor detector can not work correctly.",
      "price" : "18,000.00",
      "instock" : "5",
      "category" : "Measuring & Layout Tools",
      "photo" : "00030.png"
    },
    {
      "id" : "31",
      "name" : "Multifunctional Pocket Prismatic Luminous Compass - Army Green",
      "description" : "Prismatic Water Resistant Luminous Compass with Pouch Military Army Travel Geology Equipment   Features:\r\n- Made of zinc alloy, fully sealed design, lightweight and water resistant\r\n- Specially designed with fluorescent light, be able to use in dark environment\r\n- With bubble level, improve accuracy of the position\r\n- With cm and inch ruler on each side, can measure the length of items\r\n- Can be used for positioning, orienting on a map, plotting and so on\r\n- Equipped with carrying bag and hang rope, convenient to carry and use\r\n- Equipped with clinometer   Dial Display: Pointer\r\nOutdoor Activity: Bicycle Cross-country,Camp,Hike,Tourism\r\nShockproof or Not: Yes\r\nUse: Level,Pointing Guide\r\nWaterproof / Water-Resistant: Yes\r\nWith Noctilucent Display or Not: Yes   Package weight: 0.383 kg\r\nProduct Size(L x W x H): 9.50 x 6.50 x 3.00 cm / 3.74 x 2.56 x 1.18 inches\r\nPackage Size(L x W x H): 11.00 x 8.00 x 4.50 cm / 4.33 x 3.15 x 1.77 inches Package Contents: 1 x Compass, 1 x Pouch",
      "price" : "5,800.00",
      "instock" : "2",
      "category" : "Measuring & Layout Tools",
      "photo" : "00031.png"
    },
    {
      "id" : "32",
      "name" : "XEAST XE-901 5 Lines 3D Red Laser Level ",
      "description" : "Xeast XE-901 Laser is great for various leveling and layout applications. This unit is used for projecting bright crossing horizontal(4) and vertical(1) lines. It features red beam laser technology which is more visible and allow for a greater visible range in interior applications along with better exterior visibility. This unit offers (3) 360 degree line lasers to aid in full room layout. A full-time pulse mode allows use with a detector. It also has an integrated magnetic bracket, an over-molded housing and IP54 water/debris resistance, along with a locking Pendulum that helps t prevent damage to internal components. It uses 4 AA batteries\r\n\r\n \r\n\r\nThis product It is widely used in the field of construction, decoration and equipment installation. It emits a laser line and precise work projected on the object, making the construction process more convenient, more time and more effort, while ensuring construction quality.\r\n\r\npacking details?\r\n1.3D Line Laser level x1\r\n2. Bag x1\r\n3. L-type bracket x1\r\n4. Manual x1\r\n \r\nModel No. XE-901  \r\n   Red Laser  \r\nType 1H(360)/1V  \r\nExpanded Angle H360° /  V130°  \r\nLaser class Class 2  \r\nLight source 40MW&10MW  \r\nLaser wavelength 510nm  \r\nH/V accuracy ±3mm/10m  \r\nSelf-leveling range 4°±1°  \r\nSelf-leveling time =3s  \r\nWorking distance(Line) 35m?=50m \r\nwith detector  \r\nOperating time >4.5h(all lasers on)  \r\nPower source 4 * AA(LR6)  \r\nIP rating IP54  \r\nOperating Temperature range -10°C to 50°C  \r\nStorage temperature range -20°C to 70°C  \r\nMount size 1/4''-20  \r\nWeight 1.5gk  \r\n",
      "price" : "65,000.00",
      "instock" : "7",
      "category" : "Measuring & Layout Tools",
      "photo" : "00032.png"
    },
    {
      "id" : "33",
      "name" : "Rotary Dual-Scale Angle Meter with Magnetic Base- Analog Inclinometer- Protractor",
      "description" : "Angle meter. -Quickly measure, verify or replicate an angle or rise. -Simple 1 hand operation with large thumb screw positioned on the handle. -  Big easy to read scales rotate and align using large bubble vial.Product Type: -Levels/Meters.Generic Dimensions: -1.13 H x 6.13 W x 12.63 D, Dimensions: Overall Length - Side to Side: -6.13 Inches.Overall Height - Top to Bottom: -1.13 Inches.Overall Depth - Front to Back: -12.63 Inches.Quickly measure, verify or replicate an angle or riseSimple, one-hand operation with a large thumb-screw positioned on the handleBig, easy-to-read scales rotate and align using a large bubble vialIdeal for civil engineering, construction, plumbing, telecommunication and more",
      "price" : "12,200.00",
      "instock" : "9",
      "category" : "Measuring & Layout Tools",
      "photo" : "00033.png"
    },
    {
      "id" : "34",
      "name" : "Compass Round NatureHike Copper NH80A003-E ",
      "description" : "This Digital Thermometer is characterized by the large LCD screen which is designed for easy readouts of the humidity and temperature measurements.The cable with probe is for measurement of the outdoor temperature and humidity and the internal sensor inside the thermometer is for indoor measurement. For convenient installation, the hole and the stand back of the thermometer makes it can be used on the wall and desk or the table.\r\n\r\n\r\nFeatures:\r\nModern type outdoor indoor desk thermometer with hygrometer.\r\nOne cable with probe for feeling the outdoor temperature and humidity.\r\nIndoor and outdoor temperature (min. or max.) and humidity (max. or min.) display.\r\nOne hole and one stand back of the thermometer that you can use on the home wall or desk table.\r\nRectangle white plastic appearance and wide LCD screen.\r\nOne switch back of the thermometer that you can adjust Centigrade or Fahrenheit.\r\nThree buttons which is in the front of the thermometer (Max, Min, Reset).\r\nClear and correct display with easy to read Arabic number.\r\nOutdoor Temperature range: -50 to 70 Centigrade (-58 to 158 Fahrenheit).\r\nIndoor temperature range: 0 to 50 Centigrade (32 to 122 Fahrenheit).\r\nThe outdoor humidity can display on the screen when you are out; the indoor humidity can display on the screen when you are in, but they are not display at the same time.\r\nIt is widely used for the measurement of the temperature and humidity in houses, offices, workshops, schools, markets, warehouses, etc.\r\n\r\n\r\nSpecifications:\r\nDevice Type: Thermometer Hygrometer Temperature Humidity Meter\r\nMaterial: Plastic\r\nTemperature Precise: 0.1 Centigrade\r\nHygrometer Range:    25% RH to 98% RH\r\nPower Source:    One AAA Battery (NOT INCLUDED)\r\nSize: 12.5cm * 7.0cm * 1.92cm\r\nCable Length: 1.5 m\r\nWeight: 110g\r\nColor: White\r\nPowered by one AAA battery (NOT INCLUDED).\r\nOutdoor Temperature Range: -50 to 70 Centigrade (-58 to 158 Fahrenheit)",
      "price" : "3,500.00",
      "instock" : "12",
      "category" : "Measuring & Layout Tools",
      "photo" : "00034.png"
    },
    {
      "id" : "35",
      "name" : "0-360 Degrees Hiking Gear GPS High Precision Magnetic Pocket Transit Geological Compass ",
      "description" : "spiced butter, toasted bread herb salad",
      "price" : "9,500.00",
      "instock" : "22",
      "category" : "Measuring & Layout Tools",
      "photo" : "00035.png"
    },
    {
      "id" : "36",
      "name" : " Garmin Nüvi 55 GPS Navigators With Spoken Turn-By-Turn Directions",
      "description" : "Garmin nüvi 55 West Africa Essential Navigator.  The nüvi 55 offers features that were previously only available in the Garmin Advanced Series lineup. With a crisp 5” manual dual-­?orientation display, this easy-­to-­use, dedicated GPS navigator provides affordable guidance with spoken turn-­by-­turn directions. The nüvi 55LM comes preloaded with maps for West Africa and includes FREE Lifetime Map Updates.FREE LIFETIME MAP UPDATES: Businesses open and close. New roads are built. Be confident your routes reflect the latest map data availablePOINTS OF INTEREST: Look up addresses and search for over 190 000 points of interest.GARMIN REAL VOICETM: Hear spoken turn-by-turn directions from speech technology that sounds more like a natural, friendly human voiceUP AHEAD: Easily find places Up Ahead, like food and fuel stations, without leaving the mapKey FeaturesEasy-to-use dedicated GPS navigator with 5.0” dual-orientation displayDoes not rely on cellular signals; unaffected by cellular dead zonesPreloaded with detailed west Africa mapsNavigate complex interchanges with easeEasily search addresses and millions of points of interestPRODUCT CONFIGURATIONnüvi 55Package contains: nüvi 55, 12V Cigarette Lighter Adapter, Suction Cup Mount, Quick Start Manual and Mini USB CableUnit Dimensions: 16.8 x 9.4 x 2cmDisplay Size: 5 Display Resolution: 480 x 272 pixelsDisplay Type: WQVGA colour TFT with white backlightWeight: 180gBattery: Rechargeable Lithium-­?IonBattery Life: Up to 2 hoursMaps: West Africa pre-­?loaded with FREE Lifetime Map UpdatesTrip Planner: YesWaypoints/Favourites/Locations: 1000",
      "price" : "50,500.00",
      "instock" : "2",
      "category" : "GPS & Navigation",
      "photo" : "00036.png"
    },
    {
      "id" : "37",
      "name" : "Launch Car Scanner/ Creader Vi Obd2 Code Reader",
      "description" : "Launch Creader VI is the next generation of vehicle fault diagnosis tool developed by Launch, especially for the DIY users and the servicemen of small service workshop. This product applies the color LCD display and personalized function menu. It can diagnose the OBD & EOBD vehicles in whole functions with multi-language selection and LED diagnostic status indicators, which improves the user-friendliness. Meanwhile, the adoption of a whole new operation system makes the Creader VI run faster and help the user diagnose the vehicle more efficient. Launch Creader VI Function: Read dynamic datastream MIL indicator Readiness status test Search freeze frame data Read current DTCs Clear DTCs O2 sensor detection test Specified monitoring system on-board monitor test Read pending DTCs Read on-board systems or components control Read vehicle information Read permanent DTCs DTCs search Tested data playback Launch Creader VI Specification: Screen: 2.8'' TFT 262K true color, 320*240 Pixels LCD display Input voltage range: 8 ~ 32V Operating current: <100mA12V(Typical) Power consumption: <1.2W(Typical) Link connection: Standard OBD 16-pin DLC Operating temperature: 0 ~ 50 Storage temperature: -20 ~ 70 RH 60%t Launch Creader VI Package list: 1 x Creader vi 1 x USB Cable 1 x User manual",
      "price" : "28,000.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00037.png"
    },
    {
      "id" : "38",
      "name" : "Autel Maxidiag MD801 4 In 1 Auto Diagnostic Scanner",
      "description" : "MD801= JP701+EU702+US703+FR704 Autel maxiscan MD801 code reader MaxiDiag PRO MD801 MaxiDiagPRO MD801, an innovative multi-functional scan tool powered by Autel Uni-SCAN? technology, is designed for technicians to troubleshoot engine, transmission, ABS and airbag systems for most of the vehicles on the road today. This scan tool not only is affordable, reliable and easy to use, but it is also a time saver and a money maker. Features · One tool can do it all-troubleshoot and clear engine, transmission, airbag, and ABS failures · Global OBD I & OBD II coverage (US, Asian & European) · Turn off engine, transmission, ABS and airbag warning lights for most USA Domestic, Asian and European vehicles · Support all nine test modes of the latest J1979 OBD II test specs, including Read Codes, Erase Codes, Live Data, Freeze Frame, I/M Readiness, O2 Mon.Test, On-Board Mon.Test, Component Test and Vehicle Information · Read/clear codes for Tire Pressure Monitor Systems · Enhanced OBD II Mode 6 · OBD II repair information · Display DTC definitions on unit screen · Retrieve ECU information(VIN, CIN and CVN) · Data graphing · Read, store & playback live data · CAN enabled with no adapters to buy · Memory/battery backup for off-vehicle data review and analysis · Extremely easy to use and highly reliable · Print data via PC-link Vehicle coverage Toyota 1994-2008 Renault 1996-2008 Honda 1994-2008 Citroen 1996-2008 Nissan 1994-2008 Peugeot 1996-2008 Mazda 1996-2008 VW/ AUDI 1990-2008 Mitsubishi 1994-2008 BMW & Mini 1993-2008 GM 1984 -2008 Mercedes 1995-2008 Ford 1984-2008 Volvo 1996-2008 Chrysler 1988-2008 Opel 1997-2008 Global OBDII compliant US, European and Asian vehicles Contents: · MaxiDiagPRO MD801 tool · OBD II cable and adapter · USB cable · CD software · User's manual · Nylon carry case · 1.5V battery x 4",
      "instock" : "8",
      "price" : "53,050.00",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00038.png"
    },
    {
      "id" : "39",
      "name" : "SBB Key Programmer V33.02",
      "description" : "SUPPORTS ALL BRANDS OF CARS Like Toyota, Audi, Honda, Nissan, Volkswagen etc. SBB Key Programmer V33 is a new device used as a portable unit for programming keys in immobilizer units on vehicles. Due to its integrated hardware, SBB needs no more than the OBDII cable provided to carry out a wide range of functions:programming new keys SBB key programmer Function: 1.reading keys from immobilizer's memory 2.deactivating keys no longer in the car owner's possession 3.operation by means of a menu guided programming 4.programming new remote controls 5.software with full database containing all the most important vehicle makes SBB key programmer Package list: 1pc x SBB Main Unit 1pc x OBD II cable 1pc x AC adapter 1pc x CD with user manuals",
      "price" : "52,500.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00039.png"
    },
    {
      "id" : "40",
      "name" : "All Data Vehicles Repair Software 10.53 - 1TB For Cars & Trucks",
      "description" : "Product Description List of Softwares (1) 2014 alldata 10.53 (2) 2013 mitchell (3) NYO V4.0 (4) Vivid Workshop Software (5) ESI tronic. (6) Mitchell On Demand Heavy Truck (7) Airbag Universal Repair (8) ECM Chiptuning 2001 V6.3 (9) WinOLS (10) ECU Flash Reprogramming Precautions (11) Mitchell OnDemand 5 (12) Caterpillar SIS (13) IMMO TOOL (14) Immo Killer (15)DATA EXPLORER MANAGER TOOLS (16) Tachosoft Mileage Calculator (17) OTOCHECKER 2.0 IMMO CLEANER (18) For Cummins InPower ONAN (19) for Nissan SuperCode Software (20) for Audi-VW-SKODA-SEAT ELSAWIN 4.0 Alldata contains a full description of repair and maintenance for cars of American manufacture, as well as Asian and European vehicle production produced for the American market. Alldata 10.53 will help to repair not only American cars, but it will renovate and European and Asian foreign cars, since many nodes in the cars are identical, despite the assembly for different markets. The program provides detailed information on repair, which describes the features of the device separate mechanisms, norms of various parameters (volumes of refueling capacities, wheel alignment, etc.), the diagnostic and repair equipment and special tools, the description of works on assembly, disassembly, adjustment, repair and diagnostics, information about the location of components and tools, etc. The program Alldata 10.53, you can not only repair but also to engage in troubleshooting electronic components car. To do this, you have the following information: location of the diagnostic connector, detailed tables decoding fault codes indicating the possible causes, symptoms, and the consistency checks to fix the problem, description of the read blocks of current parameters with an indication of normative values, work with channel adaptation, etc . This version is the portable version and can be run from an external hard drive, unlike the previous version of this Alldata 10.52 added more drives. ALLDATA also includes factory-correct maintenance schedules that itemize additionally needed services. These softwares are compatible with systerm XP and WINDOW 7(32bit,not 64bit) and plz turn off the anti-virus software when using!!! We have vedio and documents for installation if you are not familiar with this software and the video for installtion will be included ALLDATA 10.53 Contents List: Daignosis and Repair All Diagnostic Trouble Codes(DTC) Relays and Modules Sensors and Switches Maintenance Engine, Cooling and Exhaust Powertrain Management Transmission and Drivetrain Brakes and Traction Control Starting and Charging Power and Ground Distribution Steering and Suspension Heating and Air Conditioning Restraint Systems Accessories and Optional Equipment Body and Frame Cruise Control Instrument Panel, Gauses and Warning Indicators Lighting and Horns Windows and Glass Wiper and Washer Systems Parts and Labour Popular Information Diagnostic Trouble Codes DTC Technical Service Bulletins Specifications Locations Diagrams Service Precautions Technician Safety Information Vehicle Damage Warnings Vehicle Identification Tools and Equipment System Diagnosis Five-Step Troubleshooting Troubleshooting Precautions Troubleshooting Tests General Troubleshooting Power Relay Test Mitchell 1 OnDemand5 is the end product of repair information that has been collected across the past eight decades and presented to our customers in a consistent, easy-to-use format.OnDemand5.com includes Diagnostics, Repair Information,TSBs, Recalls, Maintenance Requirements, Parts Prices, Labor Times, Vintage Information, and Fluid Types and Volumes that have been reproduced directly from the Original Equipment Manufacturers (O E M) published works. All this information is then combined to create the aftermarket industry’s best Wiring Diagrams, Users Tips, and Shortcuts that make up Mitchell 1’s OnDemand5. Powerful yet simple to navigate, Mitchell 1's OnDemand Repair has been completely redesigned to deliver sophisticated search capability with increased speed. You'll save valuable time using brand new shortcuts to TSBs, wiring diagrams, and more! 1.1983-current year Domestic & Import Model Coverage 2.Clear, Concise Illustrations & Diagrams 3.Time-saving TSBs, Recalls, & Technical Tips 4.Detailed, Accurate Repair Articles 5.Model-Specific Maintenance Schedules 6.Electronic Component Locator for all Models 7.Detailed, Accurate Repair Articles 8.Model-Specific Maintenance Schedules",
      "price" : "44,000.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00040.png"
    },
    {
      "id" : "41",
      "name" : "Launch X431 Creader VIII Cars Scanner",
      "description" : "Launch creader VIII Automobile diagnostic tools Launch Creader VIII, features OEM enhanced functionality one might expect from a bigger scan tool. Functions include electronic parking brake release, steering angle reset and service reminder reset, not to mention the ability to display and graph live PID data for A/T, SRS, and ABS, along with complete generic OBDII. The tool includes quick boot up, manufacturer-specific code definitions, DTC-specific troubleshooter tips, free internet updates, and the ability to print via PC. Item Type: Code Readers & Scan Tools Car Maker: Audi, Benz, BMW, Chevrolet, Chevy, Chrysler, Ford, GM, Honda, Hyundai, Kia, Land Rover, Mazda, Nissan, Opel, Peugeot, Porsche, Renault, Saab, Seat, Suzuki, Toyota, Volvo, VW Software Update: Yes Language: English, French, Spanish Item Type: Code Readers & Scan Tools Warranty: One year Display: 3.5'' , 320*480 TFT LCD true color display Operating Temperature: 0 to 50°C Storage Temperature: -20 to 70°C Brand Name: Launch Model Name: Creader VIII Link connection: standard 16 PIN OBD diagnostic interface SPECIFICATION Screen: 3.5\", 320*480 TFT LCD true color display Input voltage: 9-15V Connection: Standard 16 PIN OBD diagnostic interface Working temperature: 0-50°C Storage ambient temperature: -20 to 70°C DESCRIPTION Launch Creader VIII is the newest released code reader by Launch. It combines the functions of Launch CRP123 and CResetter II oil lamp reset tool. LAUNCH CREADER VIII APPLICATIONS Launch CRP 129 will help the technician diagnose issues with engine, transmission, SRS and ABS. It will reset DTCs within these systems. Code definitions and most likely causes for the codes will also be available from within the tool itself. FEATURES Extensive vehicle system coverage Engine Coverage (OBDII / EOBD) ABS Coverage Airbag (SRS) Coverage Transmission (Auto Trans) Coverage Oil Service (OLS) Reset Electronic Parking Brake (EPB) Coverage Steering Angle (SAS) Coverage • Read and Clear Diagnostic Trouble Codes (DTC's) • Retrieves Generic and Manufacturer Codes - both Permanent and Pending • Auto Module Search • Display DTC Definitions - Help, Information and Service Information • View Freeze Frame Data & I/M Readiness Monitor Status • Display Live PCM Data Stream & O2 Sensor / Carbon Canister Data • Graph, Record and Replay Data in Full Colour • Retrieves Vehicle Information (VIN,CIN and CVN) • Multilingual (English, Spanish and French) • Software updateable via the Internet • Print data via PC.",
      "price" : "85,000.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00041.png"
    },
    {
      "id" : "42",
      "name" : "Car Bluetooth Handsfree Phone FM Transmitter MP3 Card Dual USB Charger",
      "description" : "This product is a special Bluetooth car charger that can switch the call to the hands-free state via the professional Bluetooth modules as long as the mobile phone is provided with the Bluetooth function. It can also send the music in your phone to your car sound wirelessly. You can enjoy the music and answer the call in hand-free mode without refitting your car, which ensure the driving safety while enjoying music. Features Support Bluetooth hands-free phone calling via its built-in microphone. Support A2DP function. Music will be played directly while the mobile phone is connected. Built-in dual USB 5V / 4.1A output, 3.1A USB port support smart charging, it is available for charging most kinds of devices in car. LCD display of frequency and voltage. English voice number prompt. Support SD/TF memory card and USB flash drive (1A USB port) reading, can play music files on MP3/WMA/APE/FLAV/WAV format. With a support of FM channels, this car MP3 wireless FM transmitter lets you take a break from your regular music. Plug the MP3 player into cigarette lighter of your car directly, easy to use and carry. Specification Type : Car MP3 player Material : ABS Quantity : 1pcs Iteem Color : Black Display Color : Blue Bluetooth Version : Bluetooth 4.0 (support A2DP/SBC/AAC/HSP/AVRCP) Files Supported : MP3/WMA/APE/FLAV/WAV FM Frequency : Range 87.5-108.0MHz SNR 85dB (FM: 65dB) Effective Distance : 5m / 16.4ft Working Voltage : DC 12V-24V USB Output : 5V / 3.1A (Smart IC), 5V / 1A Port 2*USB 2.0; 1*TF card input, up to 32GB max Item Size 3.8*4.6*7.8cm / 1.5*1.8*3.1\" (L*W*H) Net Weight 0.035kg / 1.2oz",
      "price" : "8,500.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00042.png"
    },
    {
      "id" : "43",
      "name" : "Neo Socket Car Fuel Saver",
      "description" : "This revolutionary technology provides consumers with an inexpensive way to save money at the gas pump and help our environment at the same time. Better yet, there are no installation charges. Just plug the Fuelshark into your car’s lighter adapter and the blue light will let you know that the Fuelshark is working, and reminds you that you are saving money. Increase your car's mileage just by plugging it into your cigarette lighter socket. Start saving gas consumption by 10% to 30% immediately. Designed for any car or truck with a 12V cigarette lighter socket Lower emission, low power consumption and longer battery life. Pays for itself quickly as it saves you money and improves your vehicles mpg averages No Installation required. Just plug it in the cigarette lighter socket. With LED Indicator.",
      "price" : "1,200.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00043.png"
    },
    {
      "id" : "44",
      "name" : "Vehicle Communication Scanner (VCS) V1.5 Diagnostic Tool",
      "description" : "Feature *With full-feature OEM- based software, experience the difference with VCS Vehicle Communication scanner *Support comprehensive diagnosis and reading of control modules. *Successful diagnostics means proper detection of all ECMs. *With dealer level capability and the widest vehicle range, the Vehicle Communication Scanner VCS interface will put your team in the driver's seat and your business on the road to success. Specification Power Supply: 8-12VDC, 110-250VAC, 50HzConnection: Wireless or USB Minimum PC System Requirement (Not included): Windows XP or Vista CPU 300MHz 256MB RAM memory 1GB Hard Disk Memory CD Drive Working Temperature: 10 - 176oF (-10 - 80oC Humidity: < 90% Dimensions: 20\" X 14\" X 6\" Weight: 17.6 lbs Highlights Works with Over 40 makes, 1,000 vehicle system, --including CANBUS systems Access to Power train, Chassis and Body systems One click \"Quick Test\" button to scan all ECUs Live data display with waveform displays Component-level and System-level activations Reset and clear adaptations, calibrations and service functions Hyundai and VW/ Audi immobilizer special functions ECU initialization and coding SAE J2534 \"Pass-thru\" ECU reprogramming Nissan/ Infiniti idle speed self learning function Frequent Internet software updates Multi-language for international market demand \"PC-link\" functions for PC operations VCS Advantage Free to test cars within 50-100m (Distance depends on environment; the above distance is for reference only.) VCS functions *Read & Clear Diagnostics Fault Codes VCS easily read & clear vehicle specific information - manufacturer specific codes, factory codes, and generic fault codes on a particular electrical circuit. Our advice: don't forget to print it out in real time. *Quick Test & Quick Delete (select software) The Quick Test feature allows you to quickly scan all systems in the vehicle, identify controllers with faults and provides immediate access to those systems without having to navigate through multiple menus. Our advice: Don't forget to print it out in real time. *Read Live Data Fault codes & live data is the basics of electronic diagnostics. Experience high-speed response rate of 8-10 frames per second w/ real-time troubleshooting of up to 4 graphs. Diagnose signals for rich or lean conditions with live data retrieval and viewing of modules in digital and analog format. Our advice: Don't forget to print it out in real time. *Component & System level actuations test Perform verification tests to validate the functionality of a particular electrical circuit. This function will bypass time consuming labor to check the workmanship of electronic components such as switches, sensors, relays, & actuators. Use the VCS to actuate control modules and see what needs replacement without removing panels and testing without the usage of a multimeter. {cylinder power balance test, EVAP system leak, EGR valve, solenoids, power windows, winshield wiper activation, etc.} Special Functions *Service Resets & Initialization: When components (e.g. injectors, switches, mass air flow sensor, cooling temp sensor, etc.) are replaced within a module, avehicle will run very rough. Initialization immediately readapts all the values,so the components will be recognized by the vehicle system. (e.g. To reset the service indicator for the vehicle such as \"oil service\", \"service reminder light\", \"steering angle sensor\", etc.) *Vehicle Adjustment: Vehicle Communication Scanner VCS is able to adjust performance parameters. (e.g. idle RPM, idle speed adjustment, ignition timing, vehicle w/ immobilizer, set fuel synchronization, throttle-body relearn, DME Alignment, etc.) *Coding & Programming: Read & change coding has now become highly important for any new retrofit control unit in the vehicle. Contact VCS Dealer for more information. Other Functions *Self-learn Function Create a personalized database system to record ideal conditions of the actual values in the vehicle system. *Record 160 Frames of Live Data Record a real-time data stream up to 160 frames during a drive cycle. More complicated diagnosis of an intermittent problem wil require the use of this function to evaluate data stream during a controlled drive cycle PACKING LIST 1pc x VCS main unit 1pc x OBD2 cable 1pc x USB cable 1pc x CD",
      "price" : "82,500.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00044.png"
    },
    {
      "id" : "45",
      "name" : "Digital Tyre Gauge For Vehicles",
      "description" : "In any light, day or night, the Digital Tire Gauge gives you an instant, accurate and easy-to-read measurement of your vehicle's tire pressure, helping you travel safely. Accurate and Easy A simple pushbutton turns the unit on and selects one of 4 measurement ranges. Light at Night The lighted nozzle illuminates work area in low light, so you can easily locate valve stem. With gentle pressure, the nozzle seals onto valve stem quickly and completely to deliver an accurate measurement. Instantly, the exact measurement is clearly displayed on the lighted digital screen, so there is no guesswork or estimation like reading an analog gauge. After you are done, a 30-second automatic shut off means you never have to worry about accidently running the batteries dead. Ergonomic Design Contoured to fit your hand, the ergonomic shape is completed by a soft, non-slip texture, for ultimate comfort and control. Check your tire pressure often. Properly inflated tires keep you safe on the road and help you save on gas. Store this handy tool in your glovebox or console, so it's always ready when you need it. Specifications: (4) Measurement Ranges: PSI: 0-100, Bar: 0-7, KPA: 0-700, Kgf/cm2: 0-7 Minimum Increment: 0.5 PSI Power Source: (1) CR2032 3V Lithium Coin Cell, (3) LR44 1.5V Button Cells (All Included)",
      "price" : "1,200.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00045.png"
    },
    {
      "id" : "46",
      "name" : "Eco OBD2 Fuel Optimization Device For Cars",
      "description" : "Green Color Economy EcoOBD2 Benzine Car Chip Tuning Box Plug And Drive ECO OBD2 Save Fuel For All Petrol Cars From 1996. - Up to 15% fuel savings - Lower Fuel and Lower Emission EcoOBD2 is a Plug&Drive Ready device to function the increasing the performance of engine. EcoOBD2 is easy to install. Just plug it into the OBD2 connector of cars. NitroOBD2 fits all car from the year of 1996. It works based OBD2 protocols as remaping the Car's computer ECU. After driving 200 km road total, Eco OBD2 adjusts itself to the car, according to the drivers' habits and always keeps remaping the ECU to increase the performance of engine.",
      "price" : "3,050.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00046.png"
    },
    {
      "id" : "47",
      "name" : "Delphi Metals - DS150E Full System Tool For Cars & Trucks",
      "description" : "This is the best value for money multi-platform advanced diagnostics tool for all vehicle systems you will find! The Delphi DS range of diagnostic testers have unbeatable software with over 27,000 vehicle systems on over 45 vehicle manufacturers Functions: 1. Read & Erase Fault Codes for all systems: -Petrol & Diesel Engine Management, ABS, Instrument panel, Climate control, Gearbox, Immobiliser, SRS, Multifunction (Central Body, Central Locking, Convenience Systems, Chassis, Infotainment, Lights, Navigation, Seats, TPMS etc -Vehicle Specific). 2. Look at Live Data, graphing and saving of live data for later viewing. 3. ECU Coding / Parameter Adjustments / Component Configuration (initialization of new components, particulate filter regeneration, Diesel Injector coding, TPMS etc). 4. Intelligent System Scan, complete scan of all ECU / ECMs on vehicle platform, configurable by system. 5. Full Vehicle Information tree allowing vehicle specific check of OBD functionality without being connected to a vehicle. 6. Service Light Reset and Service Interval Reset 7. Diesel Injector coding FLIGHT RECORDER. With the flight recorder function, you can record parameters in real time while you are driving a vehicle. During recording, you can, with a press of a button, highlight the specific error so that you can investigate the detected error at a later time. DS150 is equipped with built-in memory thus removing the need to bring a computer. Memory card not included in package. CHASSIS NUMBER VIN. In our CARS software, we have a smart function that allows you to read out the chassis number from the vehicle that you would like to diagnose. This ensures that the right model and year is selected automatically. In addition, engine code for vehicles, which are commonly available on the markets, is also selected automatically. INTELLIGENT SYSTEM SCAN (ISS) scans through all the systems in the vehicle and displays the fault codes that are stored in each system. This saves time and you get a quick overview of the actual status of the entire vehicle. When the ISS is complete, you can then select a specific control system to analyse the results further on.",
      "price" : "37,500.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00047.png"
    },
    {
      "id" : "48",
      "name" : "Maxiscan MS309 OBDII Car Diagnostic Scanner",
      "description" : "The MS309 OBD2 Scanner Car Diagnostic Code Reader displays monitor and I/M readiness status (emissions). It shows code definition on screen. Though small in size, it is powerful enough to retrieve same information as large expensive scanners. Features Works with all 1996 and later OBDII compliant US, European and Asian vehicles, easily determines the cause of the check engine light (MIL), retrieves generic (P0, P2, P3, and U0) and manufacturer specific (P1, P3, and U1) codes, turns off check engine light (MIL), clears codes and resets monitors Displays DTC definitions on unit screen, Views freeze frame data Displays monitor and I / M readiness status (emissions). Bilingual interface and DTC definitions in english, spanish, french, german.etc Retrieves vehicle information (VIN, CIN and CVN). Supports CAN (controller area network) and all other current OBD-II protocols. Large easy-to-read backlit LCD screen. Free DTC lookup software CD. Extremely easy to use and highly reliable. Small in size and conveniently fits in your palm\"",
      "price" : "8,450.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00048.png"
    },
    {
      "id" : "49",
      "name" : "Magnetic Fuel Saver",
      "description" : "Magnetic fuel saver is the most effective fuel-enhancing device available. Magnetic fuel saver is designed to condition the fuel prior to combustion to increase power output, save fuel, and reduce emissions. It will dramatically reduce engine maintenance costs by eliminating carbon and varnish deposits which are the main source of engine wear. How to Use Two pieces of neodymium bar magnets are encased inside two plastic holders respectively with N-S poles facing each other which attract two pieces together. Use the strap to bind the two pieces tightly to the fuel line. Choose the spot which is about 2 inches from the engine to apply this unit. Place over the incoming fuel line (gas or diesel) in your car, truck, boat or motorcycle and start maximizing your engine's performance.",
      "price" : "2,400.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00049.png"
    },
    {
      "id" : "50",
      "name" : "Automobile Ignition Tester Instrument Detector Coil Diagnostic Tool",
      "description" : "Features: Strict control to ensure good quality. High quality and meticulous work, a good choice for you. Quickly diagnose ignition system problems, lack or no spark condition. Easily test ignition circuit continuity at each cylinder. Connects between the plug and the plug wire. Perfect for trouble shooting all internal combustion engines. Specifications: Color: Black Length: 270 mm Material: Stainless steel/ Plastic Package Contents: 1 x Spark Tester",
      "price" : "4,500.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00050.png"
    },
    {
      "id" : "51",
      "name" : "Vgate Icar WIFI High Quality OBD2",
      "description" : "Vgate iCar OBDII WIFI Car Diagnostic Reader is a fast and efficient way to self diagnose problems with your vehicle’s engine and it also has Bluetooth for connecting Android or PC devices and wifi for IPAD aon Iphones Vgate iCar OBDII Car Diagnostic Reader The iCar OBDII scan tool from Vgate is a high-quality automotive scanning tool that supports all OBD-II protocols, including SAE J1850 PWM(41.6K baud), SAE J1850 VPW(10.4K baud), ISO9141-2(5 baud init, 10.4K baud) and USER2 CAN(11 bit ID, 50K baud). You can use the Vgate iCar OBDII scan tool as a way to self diagnose issues with your vehicle so that you know what needs to be done next time you visit a mechanic. You plug it in using its 16 pin interface directly on to the OBDII cable and will never need to unplug it. Also, it is small and has a compact structure, so it won't take up much space. As it uses Bluetooth version 2.0, you have a stable wireless connectivity range of around 5 to 10 meters. Plus it does not require any wires or batteries since the adapter is powered by the diagnosis socket. Top 11 Reasons to Get VGATE Wifi ELM327: 1. Version: v1.5 2. For Android PC For iPhone iPad 3. Fully compatible with ELM327 V1.4b. 4. All ELM327 supported software are available to use. 5. Faster than ELM327 four times or higher. (ELM327 is RISC 8bit 44MHz MCU, iCar is ARM 16bit MCU) 6. Built in power switch. 7. Low standby power consumption sleep mode. 8. Lower power consumption than ELM327 9. LED indicator is in the front side toward user for easier check of linking status. 10. Support J1939 protocol more than ELM327. 11. WiFi 802.11 b/g and encrypted for better security. Notice: Due to the android diagnostic software becomes heavier to run, suggest to use on smart phone with CPU 800Mhz or higher, 1GHz recommended. Product Specifications: OBDII decode chip: ARM 16bit MCU Firmware: ELM327 Version 1.4b compatible Transfer baud rate: 4800 / 9600 / 10400 / 38400 / 500K Input interface: OBDII male 16pin Output interface: Wifi 802.11 b/g LED Indicator: Power(red) / OBD(green) / Link(blue) (PC or smart phone) Operating Voltage: 12V, including over voltage /shortage protection Nominal Idle current: 45mA Net Weight: 31g Gross Weight: 60g Wire Length: 0 cm SSID: BUYOBD Password: See item label IP: 192.168.0.10 HTTP local port: 35000 Encryption: WEP128 Power: supplied by car OBD socket HOW TO USE 1 Keep car key at off position 2. Plug the Vgate scantool into Car OBDII female socket. OBD2 socket is usually below the driving wheel. The Vgate should blink all 3 LEDs and off again. Only red power LED remains on. 3. Insert car key. 4. Switch car key to Accessory ON position, 5. Turn on WiFi of PCtebook/smart phone. Check Windows control panel>wireless network>Setting>Advanced>Wireless mode>IEEE 802.11b/g/n. Check android wifi setting, turn off existing link. Check iPhone Wi-Fi networks, turn off existing link. 6. Scan the Vgate wifi device from your Desktop/Notebook PC/PDA/phone. Find SSID \"VGATE\" or \"BUYOBD\". The Vgate blue LED should be on now. Otherwise, the device doesn't respond to the scanning. 7. For Windows/Android, If SSID is \"VGATE\", it is DHCP mode, not need to set up. If SSID is \"BUYOBD\", enter 13 digits password shown on the label of the white plastic case. IP: select \"Fixed\", and enter \"192.168.0.10\" Subnet mask: enter \"255.255.255.0\" DNS: keep blank For iPhone/iPad: If SSID is \"VGATE\", it is DHCP mode, not need to set up. If SSID is \"BUYOBD\", enter 13 digits password shown on the label of the white plastic case. IP: change from \"DHCP\" to \"Fixed\"! IP: enter \"192.168.0.11\" or later Subnet mask: enter \"255.255.255.0\" HTTP local port: enter \"35000\" 8. App setup: select Vgate device as KiWi wifi or ELM327. Click link, app will build a link to Vgate. App may take time for scaning vehicle protocol less than a minute or so. App starts to show static data once recognize the protocol and has correct table of associated sensor. The Vgate green LED should be blinking now. The faster data rate the protocol is, the the faster the green LED blinks. Turn off the app, not minimize\", if app fails to link and doesn't show data. Start another app and try again. Some vehicles may have to turn car key to \"ON/Start\" position to activate car ECU. Turn car key to \"ON/Start\" position to read real-time data. Communication Protocol with carista android app you can use it to scan engine, ABS, SRS and Transmission.",
      "price" : "10,000.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00051.png"
    },
    {
      "id" : "52",
      "name" : "CK100 Auto Key Programmer V99.99 Immobilizer",
      "description" : "Descprition: CK-100 Auto Key Pro Tool is a New Generation of the SBB Key Programmer, the replace version. Alternative to function and feature of the SBB V33.02. Increase much more features and functions. More powerfull and functional Excellent Quality. Highlight: 1. Newest Version: V99.99 2. This CK100 is with 1024 tokens. [No token limitation for most cars; but for few cars with 1024 tokens, After 1024 times, it can be free updated by us and start to use again. So it can be used a long time.] 3. Support Language: English, Italian ,Dutch, French, Spanish, Portuguese, Turkish 4. Compared with sbb, CK-100 Auto Key Programmer support more New Models and wider year scope, and also add new pin code service. Function: 1. Programming new keys. 2. Reading keys from immobilizers memory 3. Deactivating keys no longer in the car owners possession 4. Operation by means of a menu guided programming 5. Programming new remote controls 6. Software with full database containing all the most important vehicle makes CK 100 Auto Key Programmer. Car Maker: Audi, Australia Ford, Chevrolet,Chevy, Chrysler, Citroen, Dacia, Daewoo, Fiat, Ford, GM, Holden, Honda, Hyundai, Isuzu, Jaguar, Kia, Lancia, Land Rover, Mazda, Mitsubish, Nissan, Opel, Peugeot, Renault, Romeo, Rover, Saab, Seat, Skoda, Subaru, Suzuki, Toyota, VW e.t.c CK100 PIN CODE SERVICE: 1) HYUNDAI PIN CODE 2) KIA PIN CODE 3) NISSAN BCM CODE 4) VAG PIN CODE SYSTEM1 (SYSTEM2, KOSTAL, MEGAMOS/DELPHY) 5) VAG 7-4 PIN CONV (PIN7, DEALER, IMPORTATORE, PIN4, DATA(00/00/2000), EXIT) Compare SBB, add new pin code service below: 6) GM PIN CODE ECM TYPE 1 (ECM TYPE 2, ECM TYPE 3, ECM TYPE 4, ECM TYPE 5, ECM TYPE 6 7) CHRYSLER FOBIKCODE 8) FORD KEYLESS ECODE (KEYLESS ENTRY CODE1, KEYLESS ENTRY CODE2) Packing List: 1pc x Main Unit 1pc x USB Cable 1pc x Power Supply 1pc x Packing Carton",
      "price" : "55,000.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00052.png"
    },
    {
      "id" : "53",
      "name" : "7inch Driving Video Recorder GPS Navigation Map Wifi, FM, Handfree",
      "description" : "Free Offline Maps and navigation voice guidance for all routes in Nigeria Free GPS antenna and connection you can Remotely track and Monitor your car with App on your smartphone. Dual Port high powered USB socket to charge the device with other gadgets simultaneously Dual Lens HD Camera Front and Rearview Recorder (Recording simultaneously) with Magnetic dashboard fitting for easy use. 16GB internal memory storage capacity with more than 20 pre-loaded music and videos Automatically switches to the back camera with parking line assist on reverse Advanced Driving Guidance with GPS Navigation System (with both Online & Offline Map) and navigation voice guidance Bluetooth synchronize with your phone/tablet (you can receive phone calls on your DVR) FM transmitter function, you can tune to a pre-set frequency/ sync the music/ videos/navigation voice guidance with your car radio/ speaker. You can watch the video clip of your car (DVR) no matter where you car is from anywhere in the world, when connected to internet. Dual Cam simultaneously recording ? ADAS smart system ? Smooth GPS Navigation ? 7\" Touch Screen ? Three split view display ? Android 1.3Ghz Quad Core ? RAM 1GB+ROM 16GB ? Build in Google Play ? Easy Installation",
      "price" : "48,500.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00053.png"
    },
    {
      "id" : "54",
      "name" : "Universal Carg7 Bluetooth Car Handfree",
      "description" : "Bluetooth car MP3 player, car charger and TF slot. Adopts professional high-performance Bluetooth module; Built-in MP3 / WMA decoder chip; Can transmit the audio files in USB flash drive or TF card to car audio system; Also can send the music in your phone to car audio system through Bluetooth; Will switch to hands-free state and will switch back to playing state after calls end. Function: Bluetooth : Transmits the music in cellphone, USB flash drive, TF card or MP3 to car audio system; Car charger: Charge cellphones, iPad and other devices through USB port; Hands-free calls; Can read USB flash drive or TF card through USB port or TF slot; HiFi stereo, adopting DIGITAL, PLL technology; LCD screen displays frequency, more convenient to use; All frequency points transmitting, up to 200 frequency for choice; Power-off memory function, can memory the current frequency; With Play & Pause, Previous & Next keys. General Model Earldom Quantity 1Set Material Plastic Form Color White + Silver Grey + Multi-Colored Display Screen Size 0.7inch Screen Display Transmitting Frequency Screen Resolution N/A Specification Function Frequency / voltage display; Independent Bluetooth on/off button; Audio input; Supports to play the music in USB flash drive; Supports MP3 / WMA format; Answer / hang up / reject / redial through Bluetooth; Adopts echo cancellation and noise reduction (CVC) technology for calls; USB supplies 5V/2.5A power for other devices; Power-off auto memory; Car battery voltage display. Power Off Memory Function Yes FM Frequency Range 87.5~108MHz FM Transmit Distance 10m Audio Formats MP3 File Format MP3 / WPA Audio Mode Natural Remote Control No Remote-controlled Distance 0cm Interface Interface/Port USB 2.0 , TF card slot , 3.5mm Storage External Memory Max. Support 32B Other Features Power Supply 12~24V",
      "price" : "6,500.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00054.png"
    },
    {
      "id" : "55",
      "name" : "Code Scanner MVCI For TOYOTA TIS For Volvo/Honda/ Toyota MVCI Car Diag",
      "description" : "MVCI is a high performance factory diagnostics and reprogramming interface for TOYOTA TIS. MVCI is compatible with Toyota, Lexus, and Scion vehicles over the J1962 DLC3 connector. Worked car model: for Honda, Toyota, Lexus and Volvo. Feature: Fully compatible with Toyota TIS Techstream Supports Diagnostics, Reprogramming, Active tests, and key programming Supports most 1996 and newer Toyota, Lexus, and Scion vehicles with OBDII/DLC3 diagnostics Fully compatible with SAE J2534 Programmable power supply Able to apply 5V-24V to OBD pins 6,9,11,12,13,14 or AUX 2.5mm stereo connector Able to apply GND to OBD pins 6,9,11,12,13,14,15 or AUX 2.5mm stereo connector RGB status LEDs Supported Protocols K-Line ISO 9141 KWP 2000 ISO 14230-4 SAE J1850 PWM SAE J1850 VPW CAN 2.0B ISO 11898 CAN ISO 15765-4 Specifications Operating Temperature: -20 to 70 °C ( -4 to 158 °F ) Storage Temperature: -40 to 85 °C ( -40 to 185 °F ) Diagnostic Interface: 16PIN USB Interface : USB 2.0 Power: DC 5 V - 36V Consumption: 0.7W Dimensions: 95mm(3.74?)L x 49mm(1.93?)W x 28mm(1.10?)H",
      "price" : "48,000.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00055.png"
    },
    {
      "id" : "56",
      "name" : "PSA-COM Bluetooth Diagnostic Programmer Tool For Peugeot/Citroe",
      "description" : "PSA-COM is a diagnostic program for Peugeot/Citroen vehicles. It can access to various electronic control units (ECUs) such as Engine, Gearbox, ABS, Airbag/SRS etc. and also can display identification, read and clear fault code memory, display and record measured values and perform actuator tests. PSACOM Bluetooth is diagnostic tool for Peugeot/Citroen, dealer level diagnostic and programming advanced device, it is able to communicate with Bluetooth. PSACOM BT PSA-COM Hardware: Our OBD2 to USB PSA-COM interface contains 8x ISO9141 K-Line, 1x ISO9141 L-Line, CAN-BUS and analog measurement circuits. PSA-COM Bluetooth Compatible Protocols: ISO15765, PSA2000, Bosch KW71 and PSA2. Operation System (OS): PSA-COM Bluetooth diagnostic interface is compatible with Windows 2000/XP/Vista/7/8/8.1/10 or Linux and Mac OS/X (using Wine emulation) Multi-language Available:Arabic, Croatian, Czech, Danish, Dutch, English (United States), Finnish, French (Standard), German, Greek, Hebrew, Hungarian, Italian, Polish, Portuguese (Brazilian), Romanian, Russian, Serbian (Cyrillic), Spanish, Turkish PSACOM BT PSA-COM Features: Fully multiplexed all-in-one Bluetooth interface Automatic ECU recognition Automatic vehicle scan ECU Identification : – finds all the available ECUs in the car by pressing the single button. Bluetooth – wireless connectivity to your Windows laptop or tablet Fault code (DTC) reading Fault code clearing, with the ability to store DTC vehicle history forever Freeze frame reading Measured vaules / live data Live data recording, fully dynamic with graphing of up to 6 data streams at a time, recording and other manipulations Diagnostic protocol printing Actuator tests , test components via direct ECU access Special Functions - perform dealer level high-end programming/coding such as: Key programming Service reset DPF (Diesel Particulate Filter) regeneration EGR (Exhaust Gas Recirculation) self-test Airbag programming Injector programming Power Steering calibration ECU replacement Car configurations Package includes: 1pc x New PSA-COM PSACOM Interface",
      "price" : "45,000.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00056.png"
    },
    {
      "id" : "57",
      "name" : "Mini Elm 327 V1.5 Bluetooth Vehicle Diagnostic Scanner",
      "description" : "On-board diagnostics micro-controller for OBDII interfaces V 1.5 advantages and features • PICI8F25K80 chip • Real ELM327 1.5 version support • Supports version 9 protocols • Includes SAE-J1850 PWM and JAE J1850 VPW protocols• Improved quality • Support app for ELM327, similar to TORQUE • Starting Bluetooth password: 1234 or 0000 Supported version 9 protocols: 1. SAE J1850 PWM (41. 6 Kbaud) 2. SAE J1850 VPW (10. 4 Kbaud) 3. ISO9141-2 (5 baud init. , 10. 4 Kbaud) 4. ISO14230-4 KWP (5 baud init. , 10. 4 Kbaud) 5. ISO14230-4 KWP (fast init. , 10. 4 Kbaud) 6. ISO15765-4 CAN (11 bit ID, 500 Kbaud) 7. ISO15765-4 CAN (29 bit ID, 500 Kbaud) 8. ISO15765-4 CAN (11 bit ID, 250 Kbaud) 9. ISO15765-4 CAN (29 bit ID, 250 Kbaud) A. SAE J1939 CAN (29 bit ID, 250 x Kbaud) B. USER1 CAN (11 x bit ID, 125 x Kbaud) C. USER2 CAN (11 x bit ID, 50 x Kbaud) Functions: 1. Read generic and manufacturer diagnostic trouble codes 2. Clear trouble codes and turn off the MIL (\"Check Engine\" light) 3. Display current sensor data 4. Engine RPM 5. Calculated Load Value 6. Coolant Temperature 7. Fuel System Status 8. Vehicle Speed 9. Short Term Fuel Trim 10. Long Term Fuel Trim 11. Intake Manifold Pressure 12. Timing Advance 13. Intake Air Temperature 14. Air Flow Rate 15. Absolute Throttle Position 16. Oxygen sensor voltages/associated short term fuel trims 17. Fuel System status 18. Fuel Pressure Compatibility: Works on almost OBDII Vehicles (1996 onwards in USA) and EOBD vehicles Important note: For your vehicle to be OBD II compliant it must have a 16-pin data link connector (DLC) under the dash and the vehicle emission control information label must state that the vehicle is OBD II compliant. Note: You need to use with an OBDII App which are availble on app store Packing List: A. 1 x EOBD / OBD2 Bluetooth Diagnostic Interface B. 1 x CD",
      "price" : "3,900.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00057.png"
    },
    {
      "id" : "58",
      "name" : "Delphi Metals - DS150E + Bluetooth Full System Tool For Cars & Trucks",
      "description" : "This is the best value for money multi-platform advanced diagnostics tool for all vehicle systems you will find! The Delphi with Bluetooth DS range of diagnostic testers have unbeatable software with over 27,000 vehicle systems on over 45 vehicle manufacturers Functions: 1. Read & Erase Fault Codes for all systems: -Petrol & Diesel Engine Management, ABS, Instrument panel, Climate control, Gearbox, Immobiliser, SRS, Multifunction (Central Body, Central Locking, Convenience Systems, Chassis, Infotainment, Lights, Navigation, Seats, TPMS etc -Vehicle Specific). 2. Look at Live Data, graphing and saving of live data for later viewing. 3. ECU Coding / Parameter Adjustments / Component Configuration (initialization of new components, particulate filter regeneration, Diesel Injector coding, TPMS etc). 4. Intelligent System Scan, complete scan of all ECU / ECMs on vehicle platform, configurable by system. 5. Full Vehicle Information tree allowing vehicle specific check of OBD functionality without being connected to a vehicle. 6. Service Light Reset and Service Interval Reset 7. Diesel Injector coding FLIGHT RECORDER. With the flight recorder function, you can record parameters in real time while you are driving a vehicle. During recording, you can, with a press of a button, highlight the specific error so that you can investigate the detected error at a later time. DS150 is equipped with built-in memory thus removing the need to bring a computer. Memory card not included in package. CHASSIS NUMBER VIN. In our CARS software, we have a smart function that allows you to read out the chassis number from the vehicle that you would like to diagnose. This ensures that the right model and year is selected automatically. In addition, engine code for vehicles, which are commonly available on the markets, is also selected automatically. INTELLIGENT SYSTEM SCAN (ISS) scans through all the systems in the vehicle and displays the fault codes that are stored in each system. This saves time and you get a quick overview of the actual status of the entire vehicle. When the ISS is complete, you can then select a specific control system to analyse the results further on.",
      "price" : "60,000.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00058.png"
    },
    {
      "id" : "59",
      "name" : "T-code T300 Auto Key Programmer",
      "description" : "Product Description T300 T-code Automan Auto Key Programmer (No token needed) Version: Latest Version V15.8 Functions: SBB Key Programmer and T300 Key Programmer can do Anti-theft matching. Copy car key without the original key, but need the password.(you can calculate the password by some software); AD900 key programmer and ZED Bull Key Programmer can do car key matching. Copy car key without password, but need the original key. T-code T300 Models coverage: for Acura, for Audi, for Alfa, for Chevrolet, for Citroen, for Daewoo, for Fiat, for G/M, for Honda, for Hyundai, for Isuzu, for Infiniti, for Jaguar, for Kia, for Land Rover, for Lancia, for Lexus, for Lincoln, for Mazda Japan, for Mazda USA, for Mercury, for Mitsubishi, for Nissan, for Peugeot, for Renault, for Rover, for Seat, for Skoda, for Suzuki, for Toyota Japan, for Toyota USA, for Volkswagen and for VW/ for Audi (Pin code reading) . Function introduces of T300 chip key decoder: Use for key programming. Supporting More cars than any other transponder machine . 1. Read the vehicle malfunction code 2. Clear the vehicle malfunction code 3. Read the system data stream 4. Read IMM0/ECU ID 5. Fetch the machinery key code 6. Clear vehicle key memory 7. Program new key 8. Read vehicle key login password 9. Distinguish types of ECU 10. ECU-IMMOBILISER programme 11. Read EKA password 12. Programme new EKA password 13. Programme telecontrol implement Install Steps: VW Transponder key matching with 5 digits Login Code Procedure for adding transponder keys to vehicles with separate Immobilizer box: (Golf 3, Passat B4, Transporter, Lupo, Sharan) 1) Switch ignition ON with new key. 2) Select: Immobilizer -> Login: Enter 5 numbers Login Code (add 0 if you have 4 digits Login Code). For example, if your Login is 1234, enter 1234 -> Save 3) Go to Adaptation 4) Enter 01 in \"Channel Number\" 5) Enter 6) Enter number corresponding to the total number of keys to be matched, The \"Stored Value\" is the number of keys currently matched. For example, Enter 2 -> Save 7) Switch ignition off and remove key 8) Insert next key to ignition and switch ignition on again. Wait 15 sec. Repeat this step with each key until all keys have been matched. 9) Select: Immobilizer -> Login. Enter Login Code. Go to Adaptation 10) Enter 00 in \"Channel Number\" 11) Enter 0 and Save. This will learn ECU with Immobiliser. Procedure for adding transponder keys to vehicles with Immobilizer in the instrument cluster: (Golf 2004, Passat B5, B6 ) 1) Switch ignition ON with new key. 2) Select: Instrument -> Login: Enter 5 numbers Login Code (add 0 if you have 4 digits Login Code).For example, if your Login is 1234, enter 01234 -> Save 3) Go to Adaptation 4) Enter 21 in \"Channel Number\" 5) Enter 6) Enter number corresponding to the total number of keys to be matched. The \"Stored Value\" is the number of keys currently matched. For ex, Enter 2 -> Save 7) Switch ignition off and remove key 8) Insert next key to ignition and switch ignition on again. Wait 15 sec. Repeat this step with each key until all keys have been matched. 9) Select: Immobilizer -> Login. Enter Login Code. Go to Adaptation 10) Enter 00 in \"Channel Number\" 11) Enter 0 and Save. This will learn ECU with Immobiliser..",
      "price" : "65,500.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00059.png"
    },
    {
      "id" : "60",
      "name" : "Nitro OBD2 Power/Torque Optimization Device For Cars",
      "description" : "Nitro OBD2 makes new map in the car's computer ECU to improve the performance of your car according to your driving habits. When it is plugged into OBD2 connector, Nitro OBD2 receives the information from the car computer ECU. With the received data from ECU, Nitro OBD2 adjusts the boost pressure, quantity of fuel, injection timing and pressure to increase the performance of your car. As you driving much more KM / Mile, it renews the map. Thus it keeps the vehicle's power and torque increasing. To turn back to the car's original settings, just unplug Nitro OBD2 from OBD2 connector. Main Features: Can be plugged into OBD2 connector of your car to increase the performance of your car Receiving the information from the car computer ECU Finding out the hidden power of your car Without damaging the engine and the car computer ECU Causing no negative effects to the car factory setting Working within the tolerance of engine without exceeding manufacturer requirements Nitro OBD2 does not change any of the settings permanently Fit for gasoline cars Compatible with the following cars: - Sold after January 1, 1996 in the USA - Sold after January 1, 2001 in the European Union - With gasoline engine sold after January 1, 2003 Installation and Calibration: 1. Pull the car ignition key. 2. Find OBD2 connector in your car and plug Nitro OBD2. 3. Insert the key in the ignition and turn the key to the first stage. (Do not start the car) 4. Press the reset button for about 5 seconds. After releasing the button, just wait for a while about 30 - 54 second (Nitro OBD2 communicate and connect with ECU). 5. Start the engine. 6. Nitro OBD2 recognize your car and your driving habits, after about 200 km / 150 miles of driving and therefore Nitro OBD2 adjusted to match perfectly to your car's fuel economy. OBD2 Connector Location in Your Car: 1. Driver's side, underneath dashboard, in the area under the steering column 2. Driver's side, underneath dashboard, between the driver-side door and steering column area 3. Driver's side, underneath dashboard, between the steering column area and the center console 4. Driver's side, dashboard instrument / gauge area, between the steering column and center console 5. Driver's side, dashboard instrument / gauge area, between the driver-side door and steering column 6. Center console, vertical surface left of vehicle centerline 7. Center console, vertical surface right of vehicle centerline or on passenger side of center console 8. Center console, horizontal surface in front passenger area up to 35% More Power up to 25% More Torque Package Content NitroOBD2 Chip Tuning Box Interface User Manuel English",
      "price" : "3,050.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00060.png"
    },
    {
      "id" : "61",
      "name" : "Car Brake Fluid Tester Oil Liquid Moisture Water Detection Test Pen",
      "description" : "Description: The tester can be used as a digital brake fluid tester suitable for determinning braker fluid quality Developed for proffessional use in automotive repair shops and in serving Quality is tested and indicated on five LEDs in terms of \"percent of water in the brake fluid Test DOT 3,DOT4,DOT5 brake fluid For universal automotive Material: Plastic Color: Black Size: approx.23*23*155mm How to use: Ready for Brake Fluid Test: Unscrew the brake fluid reservoir, and pull off the cap of the Brake fluid tester. Dip the test probes into the brake fluid up to the plastic rim of the device To Check Fluid Quality: Press the button for power on,green LED will light up. Insert the tester into reservoir for one second then the test will be correctly indicated by LEDs. Repress the button for power off. The tester will automatically power off after about 15 seconds of inactivity Product Labelling Indication: Green: Battery OK, i.e.: No water contained in the Brake Fluid Green / Yellow: Less than 1% of water content in Brake Fluid Green / Yellow / Yellow: Approx. 2% of water content in Brake Fluid Green / Yellow / Yellow / Red: Approx. 3% of water content in Brake Fluid. The Brake Fluid Should be Changed Green / Yellow / Yellow / Red / Red: At least 4% of water content in Brake Fluid.The brake fluid must be Changed Urgently! Extreme Danger!Attention Attention: Replace battery if the green LED not light up any longer after you press power on button Wash the test probe with tap water after every use In case of skin contact with brake fluid,thoroughly wash the affected skin or clothing with water Do not expose brake fluid to the atmosphere for a long time as the fluid is highly hygroscopic! Package includes: 1 x Brake Fluid Test Pen(battery is not included)",
      "price" : "4,000.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00061.png"
    },
    {
      "id" : "62",
      "name" : "Lexia 3 Peugeot Planet 2000",
      "description" : "Lexia 3 pp2000 works with Citreon and Peugeot and its software help to diagnose all from 1995 until current models. Diagnostics can be performed via OBD-II connector (which can be found close to the steering wheel) or via manufacturer specific connector (only older vehicles, pre-2001). Compared with other universal vehicle scanner equipment that just read fault codes, lexia 3 pps2000 works almost all the functions such as the original dealer diagnostic tool. Lexia 3 pps2000 interface contains K-Line multiplexor, CAN-BUS interfaces and SAE J1850 bus (both PWM and VPW). Read fault codes: Displays all stored and pending fault codes with complete description (e.g. \"Rail pressure - too low pressure\"). Program supports report printing or copy to clipboard. Clear fault codes: This function clears all stored fault codes and other diagnostic information. Read identification Displays complete identification of control unit, e.g. part number, software/hardware version, manufacturer, etc.. Measured Values: Program displays live Data like Engine Speed, Battery voltage, Oxygen Sensor, Coolant Temperature, etc. Values can be displayed in graph, 9 values at once, or full listing (all measured values). Logging to file is also supported, which allows offline analysis. Programming functions/Adaptation: This feature is of great importance in all vehicles because systems like Engine control units, Immobilizers, Airbags, Alarms, Body Control Units, and some others, require you to perform reset or programming procedures after car repair is done, or even configuration after replacing broken Control Unit. Auto-scan (complete car scan/test):Detects all ECUs (electronic control units) installed in car and reads all diagnostic fault codes. Read identification: Display complete identification of control unit, e.g. part number, software/hardware version, manufacturer, etc... Actuator test: Actuator test activates particular actuator (e.g. turn on fuel pump, lock/unlock wheel, lock/unlock doors, cut off fuel, etc..) Package List 1pc Lexia 3 Peugeot Planet 2000 unit with extension OBD2 cable 1pc Short 9pin to USB cable 1pc Long 9pin to USB cable 1pc 16pin to Clip Cable 1pc OBD2 cable 1pc Instruction for Installation and Activation CD for Lexia 3 and Peugeot Planet 2000",
      "price" : "39,000.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00062.png"
    },
    {
      "id" : "63",
      "name" : "3 In 1 Car LED Voltmeter Digital Thermometer Car Battery Monitor",
      "description" : "Features: 100% Brand new and high quality. Suitable for 12V and 24V battery. Output voltage:5.0V. Maximun output current:2.1A. Dual Color Display: Red+Blue (Color can not be switched) Size: 4.6cm x 8cm Function: 1. Digital thermometer suitable for 12V and 24V battery measuring range:-9~80?. 2. Simply plug into cigarette socket,instant confirmation of battery voltage,low power consumption high light display. 3. Car-Mounted Charger.",
      "price" : "3,500.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00063.png"
    },
    {
      "id" : "64",
      "name" : "Autel MD802 Elite All Systems Car Diagnostic Scanner",
      "description" : "Autel MaxiDiag MD802 For All System + DS model: Engine, Transmission, ABS, Airbag +EPB+OIL Service Reset & Electronic modules and support data stream function. MaxiDiag Elite MD802 for ALL system+DS model One tool can do it all-reads and clears trouble codes on either the basic 4 systems ( Engine, Transmission, ABS and airbag ) or all the systems,reads and clears trouble codes on engine, transmission , airbag, and ABS failures,quick Erase feature allows all codes to be cleared with the push of a button,Live data graphing for the ECU,One button Auto-Scan reads codes in ALL modules and displays them on the screen. Autel’ new MaxiDiag Elite Series, the most advanced and multifunctional scan tools powered by its exclusive technology, are designed for car owners, technicians and car dealers to troubleshoot and repair either the basic four systems or all the systems for most of major vehicles on the road today. This new diagnostic platform delivers fast and easy diagnostics at the right price. MD802 Features: 1. Ability to quickly Read and Clear codes in ALL modules for European, Asian, and Domestic vehicles 1996 to the newer version today. 2. One button Auto-Scan reads codes in ALL modules and displays them on the screen 3. Quick Erase feature allows all codes to be cleared with the push of a button 4. Live data graphing for the ECU 5. One tool to do it all. Reads and clears trouble codes on engine, transmission , airbag, and ABS failures 6. Global OBD II coverage (US, Asian, & European) 7. Turns off engine, transmission, ABS, and airbag warning lights for most USA Domestic, Asian, and European vehicles 8. Supports all 10 test modes of the latest J1979 OBD II test specs, including Read Codes,Erase codes, Live Data, Freeze Frame, I/M Readiness, O2 Monitor Test, On-Board Monitor Test, Component Test, and Vehicle Information 9. Enhanced OBD II Mode 6 10. OBD II code tips guide technicians to the root cause of trouble codes faster 11. Data graphing 12. View freeze frame data 13. USB cable included for product updates 14. One year of FREE software updates and upgrades included 15. Prints data via PC-link 16. (1) Year Warranty Vehicle Coverage: Include MD701, MD702, MD703, MD704. Nissan, Infiniti, Toyota, Lexus, Scion, for Honda, Acura, Subaru, Mitsubishi, Suzuki, Isuzu, Hyundai, Kia, Daewoo, Mazda, Holden, Bens, Smart, Sprinter, Maybach, BWM, Mini, VW, Seat, Skoda, for Audi, Opel, Land Rover, Jaguar, Volvo, Porsche, Saab, EU Ford, Vauxhall, Ford , GM, Chrysler, Peugeot, Citroen, Renault, Dacia, Fiat, Abarth, Alfa-Romeo, Maserati, Lancia. Diagnose All Vehicles the MaxiDiag Elite MD802 enables the user to not only get into the enhanced OBD-II system with mode 6 access, live data and graphing, but it also allows car owners,technician, and car dealers to scan the entire car, ALL makes, ALL models, and ALL modules,With the MaxiDiag Elite MD802 the user can read and clear codes in all Powertrain, Chassis, Body, and Information & Communication systems with the push of one button, even a boy can understand it.Making it great for body shops, used car dealers, and the professional repair shops. With its print function, you can easily provide the customer or the insurance agent a complete diagnosis of the vehicle. This new diagnostic platform delivers fast and easy diagnosis at the right price.",
      "price" : "117,500.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00064.png"
    },
    {
      "id" : "65",
      "name" : "Mini VCI For Toyota TIS Techstream V10.30.029 For Toyota, Lexus J2534 Diagnostic Tool",
      "description" : "MINI VCI FOR TOYOTA TIS Diagnostic Cable\r\n\r\nMini-VCI is a high performance diagnostics and reprogramming interface, compatible wit SAEJ2534 (Pass-Thru), provide high speed communication to most of vehicles. Connect to PC with high speed USB 2.0. Mini-VCI can be used with major car factory online diagnostic and ECU reprogramming applications, and support a rich third-party applications.\r\n\r\nSupport Computer System: Window xp,\r\n\r\nSupport Toyota TIS OEM diagnostic software\r\nHigh performance, with ARM CPU inside.\r\nSupport all the diagnostic communication protocols applied on Toyota (after 1996).\r\n\r\nSupported Protocols:\r\n\r\nK-Line ISO 9141\r\nKWP 2000 ISO 14230-4\r\nSAE J1850 PWM\r\nSAE J1850 VPW\r\nCAN 2.0B ISO 11898\r\nCAN ISO 15765-4\r\n\r\nMINI VCI installation instructions\r\n1. Click Setup techstream software -, the next step select the language, follow the prompts to install step by step, after completed, double click techstream icon to open, a box appears, click on the right triangle, select a region, the next step is language options, select one, click Next, wait a moment will be a form, just fill in the form, and then click OK.\r\n \r\n2, Open the software, try to click connected with the vehicle, but will be prompted to register KEY, in fact, is not required, just shut down the software, run the TISKEY program, and then re-open the software, you will not be prompted registered .\r\n \r\n3 After the installation is complete, to install MINI-VCI driver, (MVCI DRIVER FO TOYOTA 1.4.1), Bahrain, open the software, which will become English, you need to make changes to the options, while changes are completed, you can use\r\n\r\nNOTE: This package do not contain Toyota 22pin connector, so it can only do Toyota 16pin cars.\r\n\r\n1. Latest Version: V10.30.029\r\n2. Support for Toyota TIS OEM diagnostic software\r\n3. Cost-effective, the price of product is only one-third of similar foreign products.\r\n4. High performance with ARM CPU inside.\r\n5. High reliability of products using SMD chip, and certified by CE and FCC.\r\n6. Support all the diagnostic communication protocols needed for Toyota (since 1996).",
      "price" : "15,000.00",
      "instock" : "8",
      "category" : "`Automotive Tools & Accessories",
      "photo" : "00065.png"
    },
    {
      "id" : "66",
      "name" : "PH Meter With Automatic Calibration",
      "description" : "Easy to Use: Simply immerse the pH meter electrode in the solution to be tested, readings are quickly display on a large lcd display\r\n\r\nWide Application: Ideal instrument for any aquarium, the fishing industry, swimming pools, spa, school laboratories, food & beverage, drinking water etc.\r\n\r\nAuto Calibrated: Features in-built calibration with 2 buffer powders.Just press a button to finish the calibration. This pH meter is factory calibrated. Users can use it directly.\r\n\r\nFast and Accurate Results: No need to work with those annoying color charts and test strips.Resolution: 0.01 pH, Accuracy: ±0.01 pH\r\n\r\nCompact Portable Design: Pocket fitting pH meter that's also lightweight and compact. Total concealed fit in your bag or pocket for easy, casual carrying.\r\n\r\n \r\n\r\n \r\n\r\nProduct Descriptions                                                                                               \r\n~Key Features~\r\n\r\nDisplay: LCD Digital\r\n\r\nAccuracy: 0.01\r\n\r\nResolution: 0.01\r\n\r\nOperating Temperature: 0~60°C\r\n\r\nMeasuring Range: 0.00~14.00\r\n\r\nProbe Type: Precision glass bulb electrode\r\n\r\nPower Supply:2*1.5V  LR44 Batteries(Not included!!!)\r\n\r\n \r\n\r\nOperation:                                                                                                                 \r\n\r\nStep 1.Remove protective cap.\r\n\r\nStep 2.First rinse the electrode with distilled water and suck it with filter paper.\r\n\r\nStep 3.Turn the meter on by pressing “ON/OFF” key.\r\n\r\nStep 4.Immerse the pH meter electrode in the solution to be tested (should not be over the immersion line).\r\n\r\nStep 5.Stir gently and wait around 30 seconds till the reading stabilizes.\r\n\r\nStep 6.After finishing, clear the electrode with pure water, turn the meter off by pressing “ON/OFF” key.\r\n\r\nStep 7.Always replace the protective cap after use.\r\n\r\n \r\n\r\n \r\n\r\nCalibration:                                                                                                             \r\n\r\n1.Turn on PH meter\r\n\r\n2.Disolve each buffer solution in 250ML of distilled water\r\n\r\n3.Immerse the electrode into the PH 6.86 solution,(under the temperature of 25)\r\n\r\n4.Press the “CAL”(calibration)button for 5 seconds and release\r\n\r\n-Display will start flashing 6.86\r\n\r\n-Wait until the display stops flashing.\r\n\r\nRinse the electrode with distilled water and dry it with filter paper.\r\n\r\n5. Immerse the electrode in PH 4.00 solution,\r\n\r\n-Press“CAL”button for 5 seconds,then press and release immediately second time\r\n\r\n-Reading will start flashing 4.00\r\n\r\n-Wait until display stops flashing\r\n\r\nRinse and dry the electrode with distilled water as before.\r\n\r\n6.Place the meter back to the buffer solution to test calibration.If incorrect,please repeat the calibration\r\n\r\n7.If approximate PH of your test solution is known to be above 7.0,calibrate the meter using 6.86 and 9.18 solution. To do this,please follow the calibration chart,The third step is the calibration method for 9.18 point.\r\n\r\n \r\n\r\n \r\n\r\nPackage Inclusions:                                                                                                 \r\n\r\n1) 1pcs pH Meter\r\n\r\n2) 2 Bags Buffer Powder\r\n\r\n3) Instruction Manual",
      "price" : "8,500.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools ",
      "photo" : "00066.png"
    },
    {
      "id" : "67",
      "name" : "Digital LCD TDS Meter Water Tester",
      "description" : "Total Dissolved Solids (TDS) meter is an inexpensive and convenient digital tool to instantly check your overall water quality, which will be displayed on the screen in ppm (parts per million). It is a great tool for testing drinking water, water filtration and purification, hydroponics (test your nutrients), aquariums, RO/DI systems, pools and spas, and more.\r\nShows the TDS value instantly after being immersed into liquid\r\n- Hold Function: Freeze the measurement to view it out of the water.\r\n- Auto-off function: the meter shuts off automatically after 6 minutes of non-use to conserve batteries.\r\nBattery non included",
      "price" : "6,500.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools",
      "photo" : "00067.png"
    },
    {
      "id" : "68",
      "name" : "Ph Meter Buffer Solution Powder Set For Quick And Easy Ph Calibration",
      "description" : "Your pH meter is not so fast or accurate anymore? Or you just want more lifetime out of the device?\r\nTired of measuring pH buffer solution for accurate results?\r\nIf you have a RO system, pool, aquarium, spa, excotic fish, you’re a fan of gardening or need to measure drinking water quality, pH testing is something you do on a regular basis. However, constant mixing for accurate liquid solutions is messy and can be a hassle. Put the measuring cup away and opt for pre-measured convenience.\r\nEven most home use ph measuring devices should be taken care of like lab equipment. That’s how you preserve almost lab accuracy for a fraction of the cost !\r\nHealth Metric pH Meter Buffer Solution Powder Set gives you a no hassle option for the exact amount of buffer solution you need for accurate readings. Just mix the powder from each packet with distilled water and you’re good to go.\r\nSpecifications:\r\n? 1*4.01 Solution (Potassium Hydrogen Ph thalate)\r\n? 1*6.86 Solution (Mixed phosphate)\r\n1*7.0\r\n? 1*9.18 Solution (Borax)\r\n1*10.01\r\nBuffer solution powders come in pre-measured individually sealed packets: Simply mix with 250 mL of distilled water for each packet Our individually packaged calibration powder is:\r\n? Easy to carry for travel\r\n? Has a longer shelf life than liquid solution (1 year versus 3 years)\r\n? Are pre-measured for most accurate results\r\nOur pH buffer powder has a shelf life of 3 years and comes with a 2-year manufacturer guarantee. Just be sure to keep the packets sealed and store them in a dry space.",
      "price" : "1,950.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools",
      "photo" : "00068.png"
    },
    {
      "id" : "69",
      "name" : "2 In 1 Gardening Tool For Soil PH Meter And Fertlity- Soil Analyser",
      "description" : "Features:\r\nFor outdoor & indoor plants, gardens & grass lawn.\r\nSave water, energy and keep your plants, lawn, flower in top condition.\r\nEasy to use, just insert and read.\r\nNo battery required, simple and convenient to use\r\nSpecifications:\r\nScales:PH,fertility\r\nMeasuring range: PH:0~9\r\nPackage:260x110mm\r\nProbe length:8.5cm\r\nNo need battery\r\nMaterial: plastic",
      "price" : "6,850.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools",
      "photo" : "00069.png"
    },
    {
      "id" : "70",
      "name" : "Digital Display Distance Measuring Wheel - Small Wheel",
      "description" : "HIGH-QUALITY, DURABLE CONSTRUCTION. Measuring 12” in diameter with a 3' circumference, this unit boasts a plastic molded wheel for long-lasting strength and use. It features a telescoping handle that is extendable up to 44 inches and collapses to 27 inches for easy carrying and storage in the included soft carrying case. The kickstand is sturdy and all buttons are water-proof and dust proof, ensuring that this unit is built to last.\r\nU.S. AND METRIC MEASURING UNITS. The AdirPro Digital Measuring Wheel measures in units of tenths of feet or meters up to a 9,99.9 foot/meter range, providing the added convenience of calculating mixed measurements on one project if needed.\r\nMULTIPLE APPLICATIONS. Versatile enough to use on a variety of indoor and outdoor projects, this tool is ideal for real estate appraisers, law enforcement, construction or landscaping workers and homeowners alike.\r\nEASY TO USE. The measuring wheel is lightweight and ergonomic, making it portable and easy to use. The handle features a large, digital LCD screen with backlight for easy viewing and the memory can store and recall up to five values. It comes complete with a user guide and a 1-year limited warranty against defects.\r\nCORDLESS OPERATION. The unit runs on two AAA long-life batteries (included in package), so you can operate it cordlessly for up to 30 hours. It also features an auto shut-off when not being used to preserve the life of the batteries.",
      "price" : "30,000.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools",
      "photo" : "00070.png"
    },
    {
      "id" : "71",
      "name" : "Digital Lcd Compass Altimeter Barometer Device",
      "description" : "All in one Digital Altimeter, barometer and digital compass device is based on the technology of electronic bearing sensor and barometric sensor for weather forecast function. It is designed for outdoor use and the detachable string makes the digital compass a perfect hand-carry device for various outdoor activities.\r\nKey Features\r\nDigital altimeter possess 5 seconds blue bright LED backlight, It has clock, calendar and thermometer functions.\r\nAltimeter: -700 ~ 9000m / -2300 ~ 29500ft.\r\nHistory Altitude Record: 256 records\r\nBattery: by 2 x AAA batteries (not included)\r\nWhat In the Box\r\n1 x 8 In 1 Digital Altimeter\r\n1 x English Manual\r\n1 x Strap",
      "price" : "13,200.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools",
      "photo" : "00071.png"
    },
    {
      "id" : "72",
      "name" : "Remote UTC Controller for AHD TVI CVI Analog Cameras With OSD Function",
      "description" : "Up The Coax (UTC) technology - this new function allows the user to control the camera's OSD settings at the DVR end rather than at the camera end. This is INSTALLATION HEAVEN! The previous technology had an OSD Remote Control attached to the camera wire, which meant the OSD settings could only be controlled at the camera end. This was a real downside to the whole concept as once the camera was installed the user could only make future adjustments to the picture and activate other functions by getting to the camera. As all installers would know this was a real nightmare! Well, the solution is here! Now installers can control ALL UTC enabled cameras with the joy of a SINGLE UTC Controller, YES a single UTC Controller!\r\nThis UTC controller has been upgraded to 3rd Generation. Now, it can support both AHD/TVI/CVI analog HD cameras and CVBS regular analog cameras.\r\nPlease ensure your camera is UTC control supported\r\nPlease ensure your camera supports AHD/CVI/TVI/CVBS signal switch if you need to use the switch function. Operate the UTC controller under AHD mode.\r\nPlease ensure your camera comes with OSD menu. Camera with OSD cable DOES NOT mean the camera supports UTC control. They are different.\r\nAHD (or TVI/CVI) cameras can't display directly to monitor, and must work with AHD (or TVI/CVI) supported DVR to get images.\r\n1x AHD/CVBS UTC Controller",
      "price" : "6,500.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools",
      "photo" : "00072.png"
    },
    {
      "id" : "73",
      "name" : "Ultrasonic Distance Meter 18M",
      "description" : "This is a perfect tool for interior designer, real estate agents or building industry professionals who need to know quickly the measure or area of a room. It can measure distances in a straight line from 0.55m to 18m. This Ultrasonic Distance Meter with laser point technology transmits ultrasonic waves to a point you want to measure.\r\nLaser pointing Aim\r\nFoot/Meter converter to help you convert to the unit you require\r\nAutomatic Off function: Switches off after 60 sec of inactivity\r\nAddition function: Enables you to add multiple measures\r\nPower supply: 1 x 9V alkaline type 6F22 battery (Not available)\r\nAccuracy: +-0.5%\r\nFrequency: 40 kHz\r\nRange: 0.55m to 18m\r\nDimension: 15.5 cm x 7 cm x 4.5 cm (Lenght x Width x Height)\r\nWeight: 0.1kg (Without battery)\r\nAvailable colours will be served randomly\r\nPackage contains:\r\n1 x Ultransonic rangefinder distance measurement meter\r\n1 x English User Manual",
      "price" : "10,320.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools",
      "photo" : "00073.png"
    },
    {
      "id" : "74",
      "name" : "Etape16 Digital Tape Measure",
      "description" : "The tape measure has remained virtually unchanged for over 100 years until now. The eTape16 digital tape measure revolutionizes not only the tape measure but also expands its utility as never before envisioned. The large digital display provides easy reading while the advance features are readily accessible. These features include 3 memories, US or metric units, centerline calculation, re-zero and Inside/Outside measurements. In addition to its advanced features, the eTape16 incorporates a sleek modern design. Made of poly carbonate plastic, the eTape16 is made to last in the most rugged of environments. The large digital display provides an easy-to-use traditional measuring tape with digital readouts and functions. As you pull out the measuring tape blade, the measurement displays on screen for easy reading. To save simply tap a button. It also converts measurements quickly from fractions to decimals, or inches to centimeters and calculate midpoints (great for helping to hang a picture). And finally, no need to bend the tape when measuring into a corner—just select the back of the device as the starting point. In addition to its advanced features, the eTape16 incorporates a sleek modern design. Made of polycarbonate plastic, the eTape16 is made to last in the most rugged of environments. Auto shut off when not in use, uses a coin battery 2032 that will last up to 64 hours of continuous usage",
      "price" : "18,000.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools",
      "photo" : "00074.png"
    },
    {
      "id" : "75",
      "name" : "Digital Distance Measuring Wheel - Big Wheel",
      "description" : "This digital measuring wheel is a practical measuring tool which can measure distance with accurate and reliable result. With zero clearing function, it is convenient to use. It can switch measuring unit: m or ft.\r\nFeatures:\r\nUseful measuring wheel which can measure distance with accurate and reliable result.\r\nEasy to use, just simply walking a straight line and it will record the distance automatically.\r\nDigital display with backlight, easy to read measuring data at night.\r\nIt can switch measuring unit: m or ft.\r\nIt can store 5 groups of measuring record.\r\nWith zero clearing function.\r\nWith a kickstand, it can stop and hold the wheel when you stop operating.\r\nWith a storage bag, convenient to carry.\r\nTelescopic pole can be stretch to 97cm.\r\nHigh quality and large wheel can move smoothly.\r\nSpecifications:\r\nMaterial: Plastic\r\nMax. Measurement: 99999.9m / 99999.9ft\r\nAccuracy: 0.5%\r\nResolution: 0.1m\r\nPower Supply: 2 * 1.5V AAA Batteries(not included)\r\nWheel Diameter: 31.8cm\r\nItem Length: 75-97cm\r\nItem Weight: 928g / 32.68oz\r\nPackage Size: 75 * 33 * 8.5cm / 29.53 * 12.99 * 3.35in\r\nPackage Weight: 1599g / 56.40oz\r\nPackage List:\r\n1 * Measuring Wheel",
      "price" : "32,000.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools",
      "photo" : "00075.png"
    },
    {
      "id" : "76",
      "name" : "Digital LCD Smart Anemometer For Wind Speed & Temperature Gauge",
      "description" : "Easily measure the wind speed of any given location and the ambient temperature. Ideal for determining if the average wind speed in your location is greater than or equal to the cut-in speed of the wind generator/turbine you intend to install. The cut-in speed is the minimum speed required by a wind generator to generate current.\r\nIt is an ideal tool for windsurfing, sailing and kite flying. You can also use it for industrial and home purposes such as measuring speed and temperature of CPU computer fans, air-conditioners, airflow over the roof or walls.\r\nIt is also used for carrying out EIA (Environmental impact Assessment) studies and other environmental parameters.\r\nMini Digital Anemometer\r\nAir Velocity & Temperature Measurement (Comes with Thermometer Feature)\r\nMax/Average/Current air velocity measurement\r\nTemperature unit selection\r\nWind Speed Range/Unit Available:0 - 30 m/s, 0 - 5860 Ft/Min, 0 - 55 Knots, 0 - 90 Km/Hr, 0 - 60 Mph\r\nFive units of air velocity: M/s, Km/h, ft/min, Knots, mph\r\nBeaufort scale\r\nBacklight display\r\nManual/Auto power shut off\r\nWind chill indication\r\nLow battery indication\r\nPowered By (1) CR2032 Battery",
      "price" : "9,500.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools",
      "photo" : "00076.png"
    },
    {
      "id" : "77",
      "name" : "Multipurpose Laser Level Aligner Bubbles Ruler 8ft Tape.",
      "description" : "The first function: laser level can measure whether flat or uneven paintings, etc., LV03 laser level can play three kinds of lines: a word line, cross line combined firm line (also known as moldings).\r\nThe second function: horizontal bead on laser level, to measure whether the horizontal level, LV03 Laser Level measuring more than a 45 degree angle drops\r\nThe third function: laser level comes with ring-foot (2.5 m, with inch scale).\r\nThe fourth function: LV03 laser level on the edge of the scale (15cm, 6 inches)\r\nAnother function of iron absorption can be added in the bottom of the aluminum laser level\r\nNew Laser Level Horizon Vertical Measure Tape 8FT Aligner\r\nHang shelves and cabinets, tiles and picture frames with accuracy\r\nProjects horizontal or vertical laser light beam\r\nLocking 8-foot measuring tape.\r\nStandard and metric rulers\r\nIdeal For Any Job That Requires A Straight Line Or Accurate Measurement.\r\nUse this Multipurpose Laser Level for hanging pictures, installing shelving,\r\nlaying flooring, hanging wallpaper and more.\r\nLaser light has an on/off power switch.\r\nLaser max output: less than 0.5mW\r\nPowered by 3*AG13 button cell battery (Not included\r\nkeep the laser level away from water ,dust and sunlight",
      "price" : "6,400.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools",
      "photo" : "00077.png"
    },
    {
      "id" : "78",
      "name" : "Pcbased USB Digital Storage Oscilloscope - 20mhz Bdwdth Hantek-ht6022b",
      "description" : "This product has excellent build quality and implements extruded aluminum casing and rubber shock bumpers at each end. Features found in high end test equipment. It ships with USB cable , 2 oscilloscope probes and a disk containing containing the instruction manual The disk also contains the software for the oscilloscope\r\nSpecifications:\r\nChannels: 2\r\nBandwidth: 20MHz\r\nInput Impandence: 1MO 25pF\r\nMax. Sample rate:48MS/s\r\nVertical resolution: 8Bit\r\nGain range: 20mV-5V, 8Steps\r\nDC accuracy: ±3%\r\nTimebase range: 1ns-9000s, 39 Steps\r\nVertical adjustable: Yes\r\nInput protection: Diode clamping\r\nX-Y: Yes\r\nTrigger Mode: Auto, Normal and Single\r\nTrigger Slope: +/-\r\nTrigger level adjustable: Yes\r\nTrigger Type: Rising edge, falling edge\r\nTrigger Source: CH1, CH2\r\nSampling selection: Yes\r\nWaveform Display: port/line, waveform average, persistence, intensity\r\nNetwork: Open/Close\r\nVertical mode: CH1, CH2, Dual, ADD\r\nCursor measurement: Yes\r\nMath: FFT, addition, subtraction, multiplication, division.\r\nCursor: Frequency, Voltage\r\nDimensions: 205mm (L) x120mm (W) x35mm (H)\r\nAccessories: Software CD, probes, manual, USB cord\r\nOperating systems supported: Windows 7, Windows NT, Windows 2000,Windows XP, Vista\r\nFeatures\r\nThe unit conforms to the standard USBXITM interface, and can easily insert into a USBXITM housing allowing the user to build up a combination instrument.\r\nUSB2.0 interface, no external power source required, easy to use.\r\nSuitable for notebook computers, or product line maintenance.\r\nHigh performance, 48MS/s real-time sampling, 20MHz Bandwidth.\r\n23 measurement functions, PASS/FAIL Check, be suitable for technical application> Waveform average, persistence, intensity,invert,addition, subtraction, multiplication, division,X-Y plot.\r\nSaves waveform in the following: text file, jpg/bmp graphic file, MS excel/word file. FFT\r\nOne computer can connect many DSO, to easily extend channels\r\nPackage\r\n1 x Professional Hantek 6022BE oscilloscope\r\n2 x Oscilloscope probe\r\n1 x USB Cable\r\n1 x CD (including manual etc.",
      "price" : "55,000.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools",
      "photo" : "00078.png"
    },
    {
      "id" : "79",
      "name" : "Precision Vernier Caliper - Portable Tool 0-150mm Measuring Range",
      "description" : "Made of hardened stainless steel, This Electronic Digital Caliper can be easily and accurately measured linear capacities measuring system. With a small locking thumb screw which locks the jaws in place and Handy conversion chart at the back, it is an ideal tool for a broad range of industrial and automotive applications\r\nSpecifications:\r\nMeasuring range: 0–150 mm/ 0–6 inch.\r\nResolution: 0.01mm/ 0.0005 in.\r\nRepeatability: 0.01mm/ 0.0005 in.\r\nAccuracy: + 0.02 mm/ 0.001 in.\r\nElectronic Digital Caliper\r\nMade of hardened stainless steel\r\nInternal, external and height dimensions can be easily and accurately measured\r\nLinear capacitive measuring system\r\nZero setting in any position\r\nWith a small locking thumb screw which locks the jaws in place\r\nBase measuring function: Inside, outside, depth and step measuring\r\nWith easy to read large LCD display\r\nHandy conversion chart at the back\r\nAn ideal tool for a broad range of industrial and automotive applications",
      "price" : "9,500.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools",
      "photo" : "00079.png"
    },
    {
      "id" : "80",
      "name" : "360 Degree Digital Inclinometer Protractor",
      "description" : "Features:\r\n1) Direction symbol\r\n2) Upright LCD display\r\n3) Backlight and buzzer function\r\n4) Degree and Percentage of slope in conversion\r\n5) Absolute and relative measurements conversion \r\n6) Data hold\r\n\r\nSpecification:\r\nMeasuring Range: 4 x 90° \r\nResolution: 0.1°/ 0.01% \r\nRepeatability: ±0.1° \r\nOperating Temperature: 0 ~ 40°C \r\nOperating Humidity: 40 ~ 80% \r\nPower Supply: 1 x 9V 6F22 Battery(Not included)\r\nSize: 160x53x31mm(LxWxH)\r\nQuantity: 1 Pc\r\n \r\nNote:\r\nPlease allow 1-3mm error due to manual measurement. pls make sure you do not mind before you bid\r\nDue to the difference between different monitors, the picture may not reflect the actual color of the item. Thank you!",
      "price" : "13,500.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools",
      "photo" : "00080.png"
    },
    {
      "id" : "00081",
      "name" : "3 In 1 PH Tester - Soil Water Moisture & Light Test Meter",
      "description" : "This 3- in-1 soil moisture meter is designed to better know the condition of your plant, monitor the soil moisture, help you control the soil ph acidity and see if plant gets sufficient sunlight to make plants grow healthier.\r\n\r\nSpecifications:\r\n\r\nMoisture Range: 1-10 (1-3 Dry, 4-7 Nor, 8-10 Wet).\r\nRelative Light: 0-2000 lux (0-200 Low, 200-500 Low+, 500-1000 Nor, 1000-2000 Hgh).\r\npH Range: 3.5-8 pH (3.5-6.5 Acid, 7-8 Alkaline).\r\nProduct Size: 11.2 x 2.0 x 1.3 inches.\r\nProbe length: 7.9 inches.\r\nDistance between probes: 0.5 inch.\r\nCopper probe diameter: 5 mm.\r\nAluminum probe diameter: 5 mm.\r\nColor: Green\r\nPackage weight: 2 oz/56g; 13*4*1.7 in\r\n\r\nHow to use:\r\n\r\nStep 1: toggle switch to moisture/ pH/ light position.\r\nStep 2: Stick the probe into the soil about 2-4 inches.\r\nStep 3: Adjust the position of the probe until the pointer on the dial swing slightly.\r\nStep 4: After 10 minutes, read the moisture/pH/light level in the dial.\r\nStep 5: Remove probe from soil and wipe clean after each use.\r\n\r\nPlease Note:\r\n\r\n1. Do not insert into very hard soil or touch hard objects when you insert it in the soil.\r\n2. Do not use it to test pure water or other liquid, electrolytic response index will be affected, it can only be used to measure the soil.\r\n3. Please wipe and clean the probe after each use.",
      "price" : "4,400.00",
      "instock" : "10",
      "category" : "Gardening Tool",
      "photo" : "00081.png"
    },
    {
      "id" : "00082",
      "name" : "Autel Maxiscan 509 Diagnostic Scanner",
      "description" : "The MaxiScan®MS509 OBD II/EOBD Scanner supports all nine OBD II test modes on all OBD II compliant vehicles to enable technicians to accurately diagnose complex problems. This ergonomic scan tool, though sophisticated yet easy-to-use, makes your vehicle service experience much more pleasant!\r\nWork on all 1996 and later OBD II compliant US, European and Asian vehicles\r\nEasily determine the cause of the Check Engine Light ( MIL)\r\nRetrieve generic (P0, P2, P3, and U0), manufacturer specific(P1, P3, and U1) codes and pending codes\r\nTurn off Check Engine Light (MIL), clear codes and reset monitors\r\nView freeze frame data\r\nDisplay monitor and I/M readiness status (emissions)\r\nRead live PCM datastream\r\nDisplay live O2 sensor test data\r\nGraph data (1996 and newer)\r\nRead, store & playback live sensor data\r\nMemory/battery backup for off-vehicle data review and analysis\r\nMultilingual menu and DTC definitions- English, Spanish, French and German, etc\r\nPerform modules present test\r\nRetrieve vehicle information (VIN, CIN and CVN)\r\nSupport CAN (Controller Area Network) and all other current OBD II protocols\r\nSoftware upgradeable via optional upgrade kit\r\nPrint data via PC",
      "price" : "22,200.00",
      "instock" : "10",
      "category" : "Automotive Tools & Accessories",
      "photo" : "00082.png"
    },
    {
      "id" : "00083",
      "name" : "Digital Thermometer And Hygrometer",
      "description" : "Thermo hygrometers are useful for measurement of humidity. Humidity is a representation of the concentration of water vapour in the air where the value is shown as a percent. Thermo hygrometers have sensors which measure humidity of the air and temperature of the air. Both values will be shown as a digital representation and converted into the desired unit. The result will then be shown via display. Thermo hygrometers are versatile in that they can take measurements, store them to memory and transfer data to computer for further detailed analysis. Most of our instruments are contactless working which enables non-destructive measurements. Without this option you would not be able to analyze your data over such a long period of time.\r\nThermo hygrometers are very useful in evaluating damage in a warehouse, cold rooms and Datacentres. These need to be at an exact temperature, with a specific level of humidity. A difference in temperature and / or humidity would mean that the device/stored products get damaged or even destroyed. Such ware housing facilities are for example those ones that offer pharmaceutical drugs, flowers and food. A change in temperature can affect the stored drug, Foul food would mean additional payment for a reseller of groceries and dried flower mean that the seller of those ones will be unable to sell them. With the high accuracy of our products such businessmen will easily be able to determine the surroundings of such goods and control parameters like temperature and humidity in a better way.\r\nUsing Thermo-Hygrometer devices you can measure relative humidity, determine the source of damp and moisture problems and indicate whether moisture reduction and control strategies are effective. Hygrometers are used to measure moisture vapour within the air, also known as the humidity level, this is measured on a scale of 0 to 100% relative humidity with 100% being saturated air. The digital Thermo-Hygrometers that can show minimum, maximum and current values of humidity. Dew Point is another value the device show, it is a measure of the point when the water vapor in the air condenses so much that it is condensed into liquid water this is the saturation point for the air at that specific temperature.\r\nTherefore, Thermo-hygrometer can also be applied in private households. In househoulds, the temperature and humidity or moisture content is also important. Pleasant air temperature and air humidity is only one example. The optimal environmental conditions for human-beings are around 20 °C and 50-65 % air humidity. In addition to that, mould growth starts at 70% air humidity. It is very difficult to control the environmental conditions in a living or bathroom as well as in a cellar. With the help of thermo-hygrometer devices, these conditions can easily be displayed and moreover controlled. If the air humidity is too high, you can for example open a window. If it is too low, an air humidifier can be used. Thermo-Hygrometers can be used to measure moisture content in various materials including wood, concrete, plaster and bricks.",
      "price" : "4,350.00",
      "instock" : "10",
      "category" : "Measuring & Layout Tools",
      "photo" : "00083.png"
    },
    {
      "id" : "00084",
      "name" : "Analog Measuring Wheel",
      "description" : "This Analog Measuring Wheel can measure distance up to 99,999 Metres, Feet and Yards. It can calculate the Size of Large Areas without the Hassle of Measuring Tape. It has  \"Smart Wheel\"  designs so that it can automatically include wheel radius for accurate wall-to-wall measurements.Compared with other measuring wheel, this device is featured with 6 digits with High Accuracy up to 99.9%, Maximum Measuring speed up to 13 km/h,Start/Stop measuring conversion, Auto Power Off and Data Hold Function. The Aluminum Handle is detachable and can be extended from 51.5 ~ 75 cm (20.3 ~ 29.5 inch) This can be used for a variety of jobs such as estimating building lot sizes, grass seed and fertilizer calculations, fence estimating, paving lot estimates, carpet size estimates, and more. This measuring wheel is better suited for smoother terrain \r\nThis is an ideal tool for Remodeling, Landscaping and Fencing purposes.\r\n Smart Wheel (automatically includes wheel radius for accurate wall-to-wall measurements) \r\n Light Weight Design Switchable between Metre (m), Foot (ft) and Yard (yd) \r\n Wide Measuring Range up to 99,999 Metres / Feet / Yard \r\nMeasuring Accuracy up to 99.9% \r\n Maximum Measuring speed up to 13 km/h \r\n Start and Stop measuring conversion \r\nDetachable Aluminum Handle Extended from 51.5 ~ 75 cm (20.3 ~ 29.5 inch)\r\n Wheel diameter can be added to the measured value for the accurate wall-to-wall measurement\r\n Auto Power Off and Data Hold Function\r\n Measured distance can be rolled backward\r\n Calculate the Size of Large Areas without the Hassle of Measuring Tape\r\n Power: 4pcs AAA batteries (Not included)",
      "price" : "26,000.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools",
      "photo" : "00084.png"
    },
    {
      "id" : "00085",
      "name" : "High Accuracy PH Meter With ATC",
      "description" : "High Accuracy Digital Pen Type PH Meter test PH-2011 Auto Calibration with Temperature Compensation ATC For SPA Aquarium Pool\r\nThis Digital Pen Style pH Meter is used to measure liquid range from 0~14 pH, accuracy up to 0.1pH\r\nOne-touch automatic digital calibration.\r\nAuto-off function, data-hold function and low-battery indicator.\r\nWith protective plastic case and calibration screwdriver.\r\nIncludes a cap, batteries, storage solution and pH 7.0 buffer\r\nExcellent meter, very accurate and durable\r\nSpecification\r\nMeasuring range: 0.0 to 14.0pH\r\nResolution: 0.1 pH\r\nAccuracy: +/- 0.1 pH\r\nTypical EMC DEV: +/-0.2pH\r\nTemperature compensation: 0 degree C to 50 degree C\r\nBattery: 4*1.5v (AG-13 button battery)\r\nRelative humidity: <95%\r\nLife: Approx. 700 hours of use.",
      "price" : "8,500.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools",
      "photo" : "00085.png"
    },
    {
      "id" : "00086",
      "name" : "Laser Distance Meter - 40 Meters",
      "description" : "Simply Aim! Shoot!! Measure!!!\r\nA special high accuracy, remote and difficult reaching points, and one person distance measuring device. Specifically designed for both indoor and outdoor applications. Shortcut keys for addition, subtraction, Pythagoras, area and volume calculation make measuring fast and very reliable. Under the strong light outside, it measures at least the specified range and under good light condition of indoor, it can achieve more than the specified range. 40Meters.\r\nMeasuring range: 0.05m to 40\r\nConstruction project supervision & on-site inspection.\r\nFast forensics from accident site for Traffic police.\r\nReal estate development and evaluation, fire evaluation.\r\nPublic facilities planning, landscaping planning and application in telecommunication industry and so on.\r\nPowered by: 2 x AAA batteries (NOT INCLUDED)\r\nInterior decoration & design, and construction technology\r\nFeatures:\r\nInstant measurement of distance, area & volume with one button operation: YES\r\nWide measuring range: YES\r\nHigh accuracy: ±2mm (0.079inch)\r\nAutomatic calculation of Area and Volume: YES\r\nIndirect measurement by Pythagorean Theorem: YES\r\nSingle/Continous measurement: YES\r\nMax/Min distance tracking (display value): YES\r\nEasy Addition/ Subtraction of measurement: YES\r\nSet up front / rear benchmark: YES\r\nSelectable meter(m), inch(in) and feet(ft): YES\r\nData store/ recall function: YES\r\nData Hold / Data clear function: YES\r\nEasy targeting with bright laser pointer: YES\r\nLarge LCD with backlight and multi-line display (4 lines): YES\r\nAuto correction and error report technology: YES\r\nBuzzer indication: YES\r\nBattery status Indication: YES\r\nIP54 protection (dust & splash proof): YES\r\nAuto / Manual power off function: YES\r\nMultifunction with intelligent calculation: YES\r\nCompact & handy design: YES\r\nCE, ROHS, FCC certificate: YES\r\nSpecifications:\r\nMeasuring range: 0.05 to 40m (0.16 to 262Ft)\r\nAcurracy: ±2mm (0.079inch)\r\nLaser class: Class II\r\nLaser maximum output: <1Mw\r\nDust & Splash proof: IP 54\r\nLaser Auto off: 20S\r\nPower Auto off: 150S\r\nOperation temperature: 0~40C (32~104F)\r\nStorage temperature: -20~60C (14~140F)\r\nDimension: 112*50*25mm (4.41 x 1.97 x 0.99inch)\r\nWeight: approx. 250 g\r\nPackage Content:\r\n1 * 40m Laser Distance Meter\r\n1 * Portable pouch\r\n1 * Hanging rope\r\n1 * User manual\r\n1 * Retail box\r\n1 * Reflective plate",
      "price" : "14,000.00",
      "instock" : "10",
      "category" : "Meter",
      "photo" : "00086.png"
    },
    {
      "id" : "00087",
      "name" : "Litelong 6F22 9V 500mah Rechargeable Battery",
      "description" : "Size: 9 Volt(6F22)\r\nVoltage: 8.4v\r\nCapacity:500mAh\r\nBrand: Litelong\r\nFeatures:\r\nNo memory effect\r\nReliable service life\r\nLong-Lasting Performance\r\nLow Self Discharge\r\nHigh Discharge Rate\r\nRecharges up to 1500 Cycles\r\nSaves you hundreds of dollars compared to Alkaline batteries\r\nCan be replaced in any product that uses 9 Volt Batteries\r\nDesigned for enhanced performance for high drain applications\r\nBattery tested based on International Electronic Commission (IEC) standard to ensure capacity, quality and life time\r\nRecommended for smoke alarms, professional audio and medical devices",
      "price" : "3,000.00",
      "instock" : "10",
      "category" : "Battery",
      "photo" : "00087.png"
    },
    {
      "id" : "00088",
      "name" : "Portable LCD Digital Multimeter Clamp Meter SNT301",
      "description" : "SNT301 is a clamp meter with high reliability and stable.\r\nIt can be used to measure AC voltage, DC voltage, AC current, resistance, continuity test, diode test etc.\r\nThe hand held design is the best choice for field work, laboratories, factories, and other applications.\r\nMini handheld AC Clamp Meter.\r\n3 1/2 LCD display, maximum reading 1999\r\nHigh brightness back light display\r\nDC voltage: 600V ± (1.0% + 2)\r\nAC voltage: 450V ± (1.2% + 5)\r\nAC current: 2A / 20A ± (3.0% + 10); 200A / 400A ± (2.5% + 10)\r\nResistance: 2KO ± (1.2% + 2)\r\nDiode test\r\nContinuity Buzzer\r\nLow Voltage Display\r\nData Hold\r\nClamp opening size: 30mm\r\nMaximum display value: 1999\r\nPower: 1.5V bttery (AAA) * 2",
      "price" : "5,500.00",
      "instock" : "10",
      "category" : "Meters",
      "photo" : "00088.png"
    },
    {
      "id" : "00089",
      "name" : "Hand-held 4 Digit Tally Counter",
      "description" : "This 4 Digit Tally Counter is a hand held counter ideal for taking inventory or counting attendance. It has a chrome plated steel casing that makes it durable with a count capacity of 9999. This type of counter is a leader in pedometers and step counting. It is ideal for all manual counting needs: inventory, stock and on-hand counts, crowd and attendance counting, athletic events, lap counts, This tally counter will be of help in any situation where a count is desired. Always perfect for counting and gifts!\r\nIt has a chrome plated steel casing to be long lasting and durable.\r\nIt has handheld design to ergonomically fit to your hand.\r\nNice appearance and comfortable feel\r\nCompact design and portable\r\nMade of Metal\r\nMetal hoop is convenient for you to carry\r\nWith zero clearing switch on the right side\r\nMechanically jumps by every press, quick reaction\r\nCounts Range: 0000 to 9999\r\n4-digit display",
      "price" : "1,700.00",
      "instock" : "10",
      "category" : "Hand Tools",
      "photo" : "00089.png"
    },
    {
      "id" : "00090",
      "name" : "GP1S Portable DLP Projector Touch Screen 1080p LED Lamp 2500mha",
      "description" : "The Portable DLP Projector GP1S is specially designed for Home theater, Business conference, Personal Entertainment, Education training, etc. Its physical resolution is up to 800x480 and maximum resolution is up to 1920 x 1080, which can offer you high definition video & Pictures. It has 2400mAh built-in battery and can offer 80-100 ansi Lumens for clear and bright images and LEDs optical brightness of 500 lumens. With this product, you can greatly enjoy videos, music, photos, etc. It will bring you much convenient and unexpected experience.\r\nFeatures:\r\n1. Physical Resolution: native SVGA 800x480; Maximum Resolution up to 1920x1080 (HD 1080P Supported).\r\n2. With HD / MHL port, you can connect various external devices to GP1S, such as Computer / Notebook, Digital devices, DVD, Video player, USB devices, Game Console, etc.\r\n3. Support directly read U disk / TF / Micro SD and external mobile hard disk, for full HD video sources, music, pictures, TXT and PPT play.\r\n4. Built-in 2400mAh rechargeable lithium polymer battery for sustainable power supply; also can work as a Power bank to directly charge your cell phone.\r\n5. Support 5.1 Stereo audio output, give you home theater experience and perfect audio and visual enjoyment.\r\n6. Support photo slide format, in any environment, show you family atmosphere.\r\n7. Truly portable, -sized, large projection screen for movies, videos, presentations, and games.\r\nSpecification:\r\nModel Number GP1S\r\nDisplay Technology DLP\r\nLED Nominal Brightness 500 Lumens\r\nOptical Brightness 80-100 Ansi Lumens\r\nNative Resolution 800 x 480\r\nSupport Resolution 1920 x 1080 (HD 1080P Supported)\r\nAspect Ratio 16:9\r\nContrast Ratio 600:1 Static, Dynamic up to 10,000: 1\r\nNumber of Colors 1.07 billion\r\nLens Type Manual lens, Optical Coating\r\nProjection cover size 12inches-150inches (Best image size: 40-80inches)\r\nProjection Distance 0.23-3.5m\r\nOperating Mode Touch Key\r\nLamp Type RGB LED light source, more than 20000 Hours Lamp Life, no need to change the lamp\r\nBuilt-in Battery 2400mAh Li-ion battery\r\nSpeaker 8O, 1W\r\nNoise In standard mode 32dB\r\nInput / Output Port 1 x HD / MHL 1.4; 2 x USB A (Ready); 1 x Micro SD card slot; 1 x Earphone jack; 1 x Audio Output port; 1 x Mini USB (5V for charging).\r\nPower (max Watt) 38W\r\nPower AC 100-240V 0.5A, DC 5V 2A\r\nSupported Video Formats RMVB/RM (Realvideo2.0 / 3.0 / 4.0), AVI (Xvid / H264), WMV (WMV7 / 8 / 9), FLV (Sorenson H.263)\r\nSupported Audio Formats MP3, WMA, AAC, FLAC, APE. Support synchronic lyric display\r\nSupported Picture Formats BMP, GIF, JPEG, PNG,TIF, etc\r\nSupported Supports TEXT TXT text file supported, automatic page turning.\r\nColor Beige\r\nItem Size Approx.12.8 x 7.8 x 2.1cm / 5.04 x 3.07 x 0.83in\r\nItem Weight Approx. 187g / 6.60oz",
      "price" : "85,000.00",
      "instock" : "10",
      "category" : "Projectors",
      "photo" : "00090.png"
    },
    {
      "id" : "00091",
      "name" : "Laser Distance Meter - 100M",
      "description" : "Simply Aim! Shoot!! Measure!!!\r\nA special high accuracy, remote and difficult reaching points, and one person distance measuring device. Specifically designed for both indoor and outdoor applications. Shortcut keys for addition, subtraction, Pythagoras, area and volume calculation make measuring fast and very reliable. Under the strong light outside, it measures at least the specified range and under good light condition of indoor, it can achieve more than the specified range. 100Meters\r\nInterior decoration & design, and construction technology.\r\nConstruction project supervision & on-site inspection.\r\nFast forensics from accident site for Traffic police.\r\nReal estate development and evaluation, fire evaluation.\r\nPublic facilities planning, landscaping planning and application in telecommunication industry and so on.\r\nFEATURES:\r\n* Instant measurement of distance with one button operation\r\n* Automatic calculation of Area and Volume\r\n* Indirect measurement by Pythagorean Theorem\r\n* Easy Addition/ Subtraction of measurements\r\n* Benchmark button to measure from front or back of device\r\n* Selectable Units: meter (m), inch (in) and feet (ft)\r\n* Store/ recall/clear function: 99 data storage\r\n* Air Bubble Level to enable correct horizontal placement\r\n* Easy targeting with bright laser pointer\r\n* Large LCD with backlight and multi-line display (4 lines)\r\n* Auto correction and error report technology\r\n* Auto / Manual power off function\r\n* Compact & handy design\r\nSPECIFICATIONS:\r\n* Measuring range: 0.2 to 80m (0.65 to 262ft)\r\n* Accuracy: ±2mm (0.079inch)\r\n* Class II Laser product\r\n* Dust & Splash proof: IP 54\r\n* Laser Auto off: 30 seconds, Power Auto off: 3 minutes\r\n* Operation temperature: 0~40°C (32~104°F)\r\n* Weight (without battery): 130g\r\n* Dimension: 118 x 54 x 28mm\r\n* CE, ROHS, FCC certified\r\n* Package: 1 x Laser distance meter, 1 x User’s Manual, 1 x Pouch bag, 1 x Holding rope and 3 x 1.5V AAA Batteries\r\nCAUTION! Do not stare into LASER Beam. Keep away from children and non-professionals.\r\n* An indispensable tool for Architects, Interior Designers, Engineers, Real Estate Valuers, etc.",
      "price" : "33,000.00",
      "instock" : "10",
      "category" : "Meters",
      "photo" : "00091.png"
    },
    {
      "id" : "00092",
      "name" : "Digital AC/DC Clamp Meter Electronic Test Lead Kit SNT201",
      "description" : "SNT201 is a clamp meter with high reliability and stable. \r\n\r\nIt can be used to measure AC voltage, DC voltage, AC current, resistance, continuity test, diode test etc. \r\n\r\nThe handle held design is the best choice for field work, laboratories, factories, and other applications.\r\n\r\nSpecifications: \r\n\r\nFunction\r\n\r\nRange\r\n\r\nAccuracy\r\n\r\nVoltage DC\r\n\r\n600V\r\n\r\n±(1.0%+5)\r\n\r\nVoltage AC\r\n\r\n600V\r\n\r\n   ±(1.5%+5)\r\n\r\nCurrent AC\r\n\r\n2A/20A/200A/600A\r\n\r\n±(2.5%+5)\r\n\r\nResistance\r\n\r\n2kO\r\n\r\n±(1.0%+5)\r\n\r\nDiode test\r\n\r\n \r\n\r\nYES\r\n\r\nOn-off test\r\n\r\n \r\n\r\nYES\r\n\r\nData hold\r\n\r\n \r\n\r\nYES\r\n\r\nBacklight\r\n\r\n \r\n\r\nYES\r\n\r\nLow battery display\r\n\r\n \r\n\r\nYES\r\n\r\n \r\n\r\nFeatures: \r\n\r\n3 1/2 LCD Display\r\n Data hold\r\nStream line design\r\nWeight: 200g, battery included\r\n\r\nSize: 170*65*35mm\r\n\r\nAccessory: 1.5V battery, instruction manual. \r\n\r\nApplication: family, laboratory, factory, field work etc.",
      "price" : "7,800.00",
      "instock" : "10",
      "category" : "Meters",
      "photo" : "00092.png"
    },
    {
      "id" : "00093",
      "name" : "Dummy False IR CCTV Camera With Flashing LED Light",
      "description" : "Flashing Light Dummy Security Camera Fake Infrared LED Surveillance Bullet CCTV\r\nThe fake camera can be used both indoors and outdoors. High professional imitation, make it easily confused with real camera. Increase your security at a fraction cost of real cameras. Easy to install with coming mounting bracket. Ideal for homes, shops, business, garage etcs\r\n* Fake dummy camera with built in flashing light\r\n* Looks extremely realistic with the fake lens in real camera housing\r\n* Cheap and effective way to deter criminals\r\n* Power requires: 2 x AA batteries (not included)\r\n* Color: Black\r\n* Material: Plastic\r\n* Mounting hardware included for easy installation.",
      "price" : "4,000.00",
      "instock" : "10",
      "category" : "Safety and Security",
      "photo" : "00093.png"
    },
    {
      "id" : "00094",
      "name" : "11 In 1 Multifunction Camping Tool",
      "description" : "This new universal multipurpose outdoor camping tool is a Small and portable universal life saving card. ThisMultifunction card could be used in many occasions, its sasy to keep with a cover.Fit for outdoor sport like camping, hiking, driving, picnic and indoor\r\nA necessity tool for outdoor enthusiasts with following 11 functions: 1. rule, 2. hexagon wrench(4 position wrench), 3. bottle opener, 4. screwdriver, 5. knife, 6. can opener, 7. saw, 8. butterfly wrench, 9. hang hole, 10. hexagon wrench(2 position wrench), 11. angle gauge(Direction auxiliary indication)\r\nCan opener. Can open the tin can easily.\r\nSide knife. You can use it to peel fruits, but you should clean it first.\r\nYou can use it to twist commonly used types of screws.\r\nThe ruler can measure small unit millimeter.\r\nThe bottle opener is suitable for beer, beverage bottle lid opening, etc.\r\nClyburn spanner. Long strip hollow-out groove, can twist any flat alternated different items of turnbuckle.\r\nDouble row crisscross serrate, increase strength, improve efficiency, it can saw wood branches, removing scales is very useful.\r\nCan use 16 equal scale accurate determination of different directions.",
      "price" : "1,105.00",
      "instock" : "10",
      "category" : "Hand Tools",
      "photo" : "00094.png"
    },
    {
      "id" : "00095",
      "name" : "Naturehike High Quality Compass",
      "description" : "This kind of multi-functional compass is ideal for camping, hiking and other outdoor activities mainly to point and guide. It also has other functions, such as using as magnifying glass. Little thing gives you superb experiences when you are using it!\r\nFeatures:\r\n- With little light design that can effectively increase the definition of scale\r\n- Equip with noctilucent display, can be used in dark environment\r\n- Front dial transparency and clarity scale printing, easy and convenient to use\r\n- With a small simple magnifying glass and a small mirror\r\n- Water resistant, can be used in rainy day\r\n- Material: Outer case is ABS engineering plastic, inside case is high transparency plastic, durable and wear resistant\r\nFor: Adventure,Camping,Climbing,Cycling,Hiking,Other\r\nMaterial: ABS,Plastic\r\nColor: Black\r\nPackage weight: 0.122 kg\r\nProduct size (L x W x H): 10.50 x 6.50 x 2.00 cm / 4.13 x 2.56 x 0.79 inches\r\nPackage size (L x W x H): 11.50 x 2.50 x 6.50 cm / 4.53 x 0.98 x 2.56 inches\r\nPackage Contents: 1 x Multi-functional Compass",
      "price" : "4,300.00",
      "instock" : "10",
      "category" : "Compass",
      "photo" : "00095.png"
    },
    {
      "id" : "00096",
      "name" : "Kitchen Cooking Temperature Stand Up Dial Oven Thermometer Gauge",
      "description" : "The Oven Thermometer measures your oven temperature to insure that all of your food is cooked to perfection.\r\nWide temperature range 0-300\r\nDurable Premium grade stainless steel\r\nOven and dishwasher safe\r\nHanger and stand\r\nAttaches to shelf or rack\r\nLarge easy to read diameter dial\r\nSpecifications:\r\nTotal size: Approx.61*35*70mm\r\nDial size: Approx.52*15mm(D*H)\r\nColor:Silver\r\nStyle:Two patterns(Celsius/Fahrenheit display and Celsius display),as the pics show,sent by random\r\nTemperature range: 0-300°C,0-600°F(1°F=1°C × 1.8 + 32)\r\nPacking content:\r\n1 x Oven thermometer",
      "price" : "3,750.00",
      "instock" : "10",
      "category" : "Baking Tool & Accessories ",
      "photo" : "00096.png"
    },
    {
      "id" : "00097",
      "name" : "HDMI To VGA Converter - Black",
      "description" : "HDMI Male to VGA RGB Female Video Converter Adapter Chips 1080P For PC DVD HDTV. Describe:This is a new Chip adapter which can convert the HDMI digital signal to VGA analog signal. it has a built in new chip, so can convert the signal from digital to analog.Enable PC, DVD, PS3, Xbox360 and other HDMI male input device to be connected up to computer monitor, projector or other display. It supports the high definition output of or 720P or 1080P.Interface specifications: Power Input :No need extra power, from HDMI Power HDMI Input: the HDMI Input interface VGA Output: VGA signal Output interface Can use for All HDMI input and VGA output device. Don't support Audio output. Built-in chipset.\r\nThe HDMI to VGA Adapter allows for a connection to VGA monitors and projectors supporting a maximum resolution.\r\nConnecting your new NoteBook, Laptop, HD DVD,HD DV without VGA interface to projector, Display, LCD, TV & Monitor in old model with VGA interface only for big screen viewing.\r\nPlug-in-out, extra Power,Power from HDMI connecting device.\r\nConvert the HDMI output port on your ENVY or Voodoo laptop to an analog VGA input with the HDMI to VGA Conversion Adapter.",
      "price" : "2,050.00",
      "instock" : "10",
      "category" : "Digital TV Converters",
      "photo" : "00097.png"
    },
    {
      "id" : "00098",
      "name" : "HDMI To VGA Converter - White",
      "description" : "HDMI Male to VGA RGB Female Video Converter Adapter Chips 1080P For PC DVD HDTV. Describe:This is a new Chip adapter which can convert the HDMI digital signal to VGA analog signal. it has a built in new chip, so can convert the signal from digital to analog.Enable PC, DVD, PS3, Xbox360 and other HDMI male input device to be connected up to computer monitor, projector or other display. It supports the high definition output of or 720P or 1080P.Interface specifications: Power Input :No need extra power, from HDMI Power HDMI Input: the HDMI Input interface VGA Output: VGA signal Output interface Can use for All HDMI input and VGA output device. Don't support Audio output. Built-in chipset.\r\nThe HDMI to VGA Adapter allows for a connection to VGA monitors and projectors supporting a maximum resolution.\r\nConnecting your new NoteBook, Laptop, HD DVD,HD DV without VGA interface to projector, Display, LCD, TV & Monitor in old model with VGA interface only for big screen viewing.\r\nPlug-in-out, extra Power,Power from HDMI connecting device.\r\nConvert the HDMI output port on your ENVY or Voodoo laptop to an analog VGA input with the HDMI to VGA Conversion Adapter.",
      "price" : "2,050.00",
      "instock" : "10",
      "category" : "Digital TV Converters",
      "photo" : "00098.png"
    },
    {
      "id" : "00099",
      "name" : "Multi Functional Mini Laser",
      "description" : "Multi Functional Mini Laser Level Horizon Vertical Line Tool Spirit\r\nDescription:\r\nlaser lines have 2 line(horizontal and vertical line)\r\nON/OFF swith\r\nLever vials\r\nFastening pin\r\nSuspension device\r\nMagnet\r\nBattery compartment\r\n5/8\"screw\r\nTechnical Data:\r\nLaser wavelength:625-670nm.\r\nMax power output:5mw.\r\nAccuracy:+-0.55@30feet(±1.4mm/M).\r\nAccuracy:90±0.1.\r\nPower:3xAG13 batteries.(NOT include)\r\nLawer class:US class A,EU class R\r\nSpecification\r\nLaser Level Material: ABS plastic\r\nColor: as the picture\r\nLaser Level Product Specifications: 118 * 70 MM\r\nTriangle Bracket Material: Plastic\r\nTriangle Bracket Length:15cm.",
      "price" : "7,300.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools ",
      "photo" : "00099.png"
    },
    {
      "id" : "00100",
      "name" : "45X Handheld Mini Pocket Microscope Reading Magnifying Glass With LED",
      "description" : "3 LED Light 45X Handheld Mini Pocket Microscope Reading Magnifying Glass Lens Jewelry Loupe Top Quality Cheap Price\r\nFeatures:\r\n-Brand new and high quality magnifying glass lens\r\n-Compact and stylish design, comfortable ergonomic handle, portable light weight,very practical\r\n-Switch to turn lights on and off\r\n-Crystal clear texture to ensure clear view\r\n-Handle crafted in smooth curve and considerate shape for comfortable gripping\r\n-Great for reading, circuits, jewellery evaluating, etc.\r\n-Independent lighting design, 2 LEDs for the large lens and 1 LED for the small one to ensure better lighting effect.\r\nSpecifications:\r\nCondition: New\r\nMaterial: ABS and optical glass\r\nColor: White and Black\r\nLighting: 3x LED light\r\nQuantity: 1pcs\r\nWeight: 145g\r\nHandle length: approx.11cm\r\nSize: 195mm(L)*85mm(W)*28mm(T)\r\nLens multiple: 3X for the large, 45X for the small\r\nLens dia.: 75mm for the large, 22mm for the small\r\nPower: 3xAAA batteries (not included in the package)",
      "price" : "2,800.00",
      "instock" : "10",
      "category" : "Hand Tools  ",
      "photo" : "00100.png"
    },
    {
      "id" : "00101",
      "name" : "Mobile Phone Anti Radiation Sticker- Radisafe",
      "description" : "Phone devices emits electromagnetic radiation, exposure to which may cause brain cancer, considerably higher susceptibility to infections, diarrhea, skin peels, sterility. If the radiations continous the person will die. There will also be hemorrhagging. The Central nervous system becomes severely damaged. The person is not expected to survive.\r\nExperts say that approximately 50% of humans exposed to 450 rems will die, and 800 rems will kill virtually anyone. Death is inevitable and will occur from between two days to a couple of weeks.\r\nThose who do survive higher phone radiation does have a considerably higher risk of developing some cancers, such as lung cancer, thyroid cancer, breast cancer, leukemia, and cancer of several organs.\r\nUsers, especially children, adult and pregnant women, should use anti radiation on all of there phones.\r\nPrevention is better than cure.\r\nYou can stick it on cell phones, mp3, computer and wherever you like.\r\nProtect your ears. brain & body against the harmful effects of cell phone radiation and heating with RadiSafe.\r\nReduce 80% of your mobile's heat radiation\r\nShields over 99.95% of radiation emitted from your mobile phone.",
      "price" : "2,000.00",
      "instock" : "10",
      "category" : "Phone Accessory",
      "photo" : "00101.png"
    },
    {
      "id" : "00102",
      "name" : "Sonoff Wifi Wireless Smart Remote Switch Timer Home Automation Socket",
      "description" : "SONOFF BASIC smart switch provides you with perfect intelligence control solutions for your home or workplace. By using the free \"eWeLink\" APP wireless control, help simplify your life so easily. Everything is under your control.Main Features:\r\nSmart remote control switch:\r\n? You can check your home appliance status anytime and anywhere, and control them on / off with just a click on your smartphone or tablet via APP eWeLink, no distance and time limitation\r\nSet time schedules for automatic control:\r\n? It has single, repeating, and countdown timers that you can use to control home appliance on / off automatically\r\nShare control of devices to others:\r\n? You can simply share control of your home appliances to others so that they can also turn on / off the devices remotely\r\nAdvanced voice control:\r\n? Just with a simple voice command, Alexa or Google Assistant will work for you, turning on / off the connected devices at once\r\nCompatible with nest:\r\n? When pairing with Google Nest, the \"eWeLink\" APP ( can be downloaded from Google Play or Apple Store ) can receive real-time environment data like temperature, humidity from Google Nest, as well as checking if there is anybody home or not, all these can be used to create smart scenes to control the connected devices\r\nSpecification:\r\n? Wireless standard: 802.11 b / n / g\r\n? Enclosure material: fire-retardant ABS\r\n? Security: WPA / WPA2\r\n? Power supply: 90 – 250V\r\n? Max. current: 10A\r\n? Max. power: 2200W\r\n? Operation temperature: 0 - 40 Deg.C",
      "price" : "7,500.00",
      "instock" : "10",
      "category" : "Computer Accessories",
      "photo" : "00102.png"
    },
    {
      "id" : "00103",
      "name" : "2-channel 9V Ni MH / Ni Cd / Lithium Ion Battery Universal Charger",
      "description" : "2- channel independent channel charger\r\nRange: 1pcs-2pcs 9v NiMH, nickel-chromium, lithium-ion rechargeable battery\r\nInput voltage: AC 110-240V 50 / 60Hz\r\nOutput voltage: 9v\r\nCharging current: DC75mAX2\r\n1,1pcs-2pcs 9v NiMH, nickel-chromium, lithium-ion rechargeable battery can be charged,\r\n2, rapid charging, full automatically stop charging, the red light turn green,\r\n3, the Japanese import control chip, using interactive control of voltage and current principle, with over charge, over-voltage, over-current protection.",
      "price" : "3,200.00",
      "instock" : "10",
      "category" : "Chargers",
      "photo" : "00103.png"
    },
    {
      "id" : "00104",
      "name" : "HDMI Over RJ45 Cat5e CAT6 UTP LAN Ethernet Balun Extender Repeater -",
      "description" : "Our Pigtail HDMI Extender by CAT-5e/6 uses two pieces of CAT-5e/6 cables to extend the HDTV display up to 30 meters for 1080p. It not only breaks the limitation of the HDMI cable transmission lengthï¼but also CAT-5e/6 has more flexibility and convenience in cable construction.\r\nNo Power Required!\r\nPacked as a pair.\r\nBoth the sender and receiver are equipped with a fixed HDMI cable that allows consumers to reduce the cost of an extra HDMI cable. It is capable of supporting DVI (digital visual interface) equipment when used with an HDMI to DVI Adapter, providing greater flexibility and options when integrating several home theater components.\r\nThis product offers solutions for residential consumers: HDTV retail and show sites.\r\nUses: HDTV, MySky HDi, Freeview HD, PS3, XBox 360, Bluray and upscaling DVD players.\r\nEasy to install where the traditional HDMI cable maybe too tight for some inwall installations.\r\nN.B. Both cat5/6 cable runs must be exactly the same length for correct HDMI timing. Installers often have problems correctly making the connections on cat5/6, an inexpensive cat5/6 cable tester is highly recommended to guarantee success. If these connections are not perfect, the result will be video or audio dropouts. For an easier way we suggest to use pre-terminated cable like below.\r\nFeatures\r\n- One pair as a full functional module, no need of setting.\r\n- CAT-5e/6 cable can substitute HDMI cable to achieve long distance transmission.\r\n- Follow the standard of IEEE-568B.\r\n- Transmission distance can be up to 30 meters for 1080p using CAT-6 Cable.\r\n- Compact size.\r\n- Signaling rates up to1.65Gbps in support of 1080P display.\r\n- HDCP compliant",
      "price" : "7,500.00",
      "instock" : "10",
      "category" : "Computer Accessories ",
      "photo" : "00104.png"
    },
    {
      "id" : "00105",
      "name" : "HDMI Cable Tester - NF-622",
      "description" : "NF-622 HDMI wire tester check disorder, short, open and cross status of HDMI cables tester and HD wire tester\r\nFeatures:\r\n1. Fast and accurate verification with type A - A, A - C,C-A and C - C connectors.\r\n2. Check disorder, short, open and cross status of HDMI cables.\r\n3. Mapping continuity and proper configuration.\r\n4. 19 pins and grounded connection and 4 status leds.\r\n5. Capable of checking wiremap only with master unit.\r\n6. Adjustable test modes:Fast/slow scan/manual test for step by step.\r\n7. Design with loopback function.\r\nCaution:\r\n1.Don't connected high voltage lines to avoid buring out the machine.\r\n2.Put into the right place to avoid hurting others,because of the sharp part.\r\n3.Connected the cable to the right port.\r\n4.Read the user manual before use it.\r\nTechnical indexes:\r\nCables versions support HDMI cables with type A & C connectors conforming to 1.0,1.1,1.2,1.\r\n2a,1.3,1.3a,1.3b,1.4,1.4a,Category 1 and category 2 HDMI cables\r\nSupport test 19 pin to pin wiremap and shielding detection\r\nTest interface of master unit HDMI ( type A) x 2, Mini HDMI (type A ) x1\r\nTest mode Fast / slow scan / step by step\r\nTest distance Under 50 meters\r\nStatus Display 19 leds and shield led on both master and remote unit\r\n4 leds (pass, open, short, cross)\r\nBeeper indication Yes\r\nLow battery indication 6.0V\r\nPower source DC 9V (NEAD 1604/ 6F22) x1 (not included)\r\nEnvironment Operating:0? to 40 ?< 80% RH\r\nStorage:-10? to 50? <70%RH\r\nDimensions Master unit:103x66x27mm\r\nRemote unit:103x35x27mm\r\nFunction Comparison:\r\nName HDMI cable tester\r\nModel NF-622\r\nWire map 19 pin+Shield\r\nCable type A-A, A-C, C-A,C-C\r\nTest type Master / Master+Remote\r\nStatus display Yes (pass, open, short,cross)\r\nTest distance ? 50 meters\r\nLow battery indication Yes\r\nTest mode Fast/slow/step by step\r\nBattery\r\n9 V",
      "price" : "8,150.00",
      "instock" : "10",
      "category" : "Computer Accessories",
      "photo" : "00105.png"
    },
    {
      "id" : "00106",
      "name" : "Optical Fibre Power Meter - NF-900",
      "description" : "NF-900 Optical Power Meter is a compact and an easy-to-use testing instrument for optical fiber networks, which can be used for absolute optical power measurements as well as for relative loss measurements in optical fibers. It features ingenious appearance, wide range of power measurement, high accuracy and user self-calibration function with high performance-to-price ratio.\r\nMain functions:\r\n1. Measurement of the power of optical sender (dBm and W).\r\n2. Insertion loss test of optical devices.\r\n3. New REF user-defined.\r\n4. FC/SC/ST general-purpose interface.\r\n5. Wavelength:850/1300/1310/1490/1550/1625nm.\r\nTechnical indexes:\r\nModel NF-900\r\nPower meter Power detecting range(dBm) -70 ~ +10 -50 ~ +26\r\nWavelenth (nm) 800-1700\r\nProbe InGaAs\r\nDetection limit ?1.0mm\r\nStandard wavelenth 850, 1300, 1310, 1490, 1550, 1625nm\r\nDisplay resolution 0.01dBm\r\nWorking temp -20 ~ +70?\r\nPower supply 1.5V*3pcs\r\nCaution:\r\n1.Don't connected high voltage lines to avoid buring out the machine.\r\n2.Put into the right place to avoid hurting others,because of the sharp part.\r\n3.Connected the cable to the right port.\r\n4.Read the user manual before use it.",
      "price" : "28,000.00",
      "instock" : "10",
      "category" : "Computer Accessories",
      "photo" : "00106.png"
    },
    {
      "id" : "00107",
      "name" : "Vention Video HDMI Switch 5 In 1 Out With IR Wireless Remote Splitter",
      "description" : "It allows 5 HDMI devices to be switched easily through on HDMI compatible monitor or projector or other devices. Support: HDMI 2.0, resolution; 4K * 2K and also Support picture-in-picture, with LED indication. Support 5-channel HDMI signal input and 1-channel signal output, support digital sound and analog sound output simultaneously.\r\nProduct parameters:\r\n1.Alloy shell: ABS material\r\n2.Output video: HDMI 1.4b, 4K\r\n3.Support video format: 4K * 2K @ 30Hz 1080P 3D @ 60Hz\r\n4.Compressed audio: DTS digital, Dolby digital;\r\n5.Support input line: 10-15M\r\n6.Support the output line: 10-15M\r\n7.Interface included: HDMI interface, power interface\r\n8.Power supply: 5V / 1A",
      "price" : "19,000.00",
      "instock" : "10",
      "category" : "Computer Accessories",
      "photo" : "00107.png"
    },
    {
      "id" : "00108",
      "name" : "BENETECH GM3120 LCD Electromagnetic Radiation Detector.",
      "description" : "1. Radiation survey meter can test electric field radiation and magnetic field emission to reach the optimal test result.\r\n2. It is used to test and learn electromagnetic radiation situation indoor and outdoor.\r\n3. It is equipped with a built-in electromagnetic radiation sensor, which can display the radiation value on LCD digital display after processing by the control micro-chip.\r\n4. You can make reasonable processing or taking effective prevention measures toward the electromagnetic radiation according to the test result\r\nFeatures\r\n1. One instrument with two uses, it can test the electric field and the magnetic field radiation at the same time\r\n2. Sound-light alarm, when the test result exceeds the safe value, the instrument will alarm automatically\r\n3. Data locking, one-key lock of the radiation value\r\n4. LCD graphic display of the radiation value trend\r\n5. Radiation assessment, remind you whether the radiation value is safe or not\r\n6. Fashionable design, easy on-hand operation, it is easy to move or make field measurement\r\nRange of Application\r\n1. Electromagnetic radiation monitoring: House and apartment, office, outdoor and industrial site\r\n2. Electromagnetic radiation test: Mobile phone, computer, TV set, refrigerator and high voltage cable radiation test\r\n3. Radiation protection product test: Test effects of radiation-proof clothes, radiation-proof film and other prevention articles\r\nSpecification:\r\nGeneral\r\nOperating Temperature 0 ~ 50 Degree Celsius\r\nOperating Humidity relative humidity <80%\r\nPower Supply 6F22 9V battery\r\nPresicion 1V/m (electric); 0.01uT (magnetic)\r\nRange (Electric Field) 1V/m-1999V/m\r\nRange (Magnetic Field) 0.01uT-19.99uT\r\nAlarm Threshold Value (Electric) 40V/m\r\nAlarm Threshold Value (Magnetic) 0.4uT\r\nReading Display 3-1/2-digit LCD\r\nTesting Bandwidth 5Hz-3500MHz\r\nSampling Time about 0.4 seconds\r\nTest Mode Bimodule synchronous test\r\nOver Range Indication LCD displays \"1\"\r\nSize 125.8mm x 63.6mm x 31mm",
      "price" : "17,500.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools ",
      "photo" : "00108.png"
    },
    {
      "id" : "00109",
      "name" : "Vention 3 Input 1 Output HDMI Switcher & Splitter With Audio For XBOX",
      "description" : "It allows 3 HDMI devices to be switched easily through on HDMI compatible monitor or projector or other devices. Support: HDMI 2.0, resolution; 4K * 2K and also Support picture-in-picture, with LED indication. Support 3-channel HDMI signal input and 1-channel signal output, support digital sound and analog sound output simultaneously.\r\nProduct parameters:\r\n1.Alloy shell: ABS material\r\n2.Output video: HDMI 1.4b, 4K\r\n3.Support video format: 4K * 2K @ 30Hz 1080P 3D @ 60Hz\r\n4.Compressed audio: DTS digital, Dolby digital;\r\n5.Support input line: 10-15M\r\n6.Support the output line: 10-15M\r\n7.Interface included: HDMI interface, power interface\r\n8.Power supply: 5V / 1A\r\nPackage Included:\r\n1 x 3 in 1 out switcher splitter\r\n1 x USB power cord\r\n1 x Manual\r\n1 x Remote control",
      "price" : "17,000.00",
      "instock" : "10",
      "category" : "Computer Accessories",
      "photo" : "00109.png"
    },
    {
      "id" : "00110",
      "name" : "4.3 Inch HD AHD And Analog CCTV Camera Tester",
      "description" : "The 4.3inch AHD Camera tester is developed for Analog & AHD camera device, with Video display, DC12v output power, Audio test, 480*272 resolution, and multilingual OSD. The brightness and contrast and color saturation can be adjusable. It has built-in 2600mA Lithium-ion battery with cable testing, analog video test, LED emergency lighting, and 5V/1A emergency power output for power supply. It also can be used for charging mobile phone. It supports AHD Coaxial HD test, including 720P & 960P & 1080P AHD camera.\r\nThe new tester designed with easy operation and portability makes it simple for a cctv technician or installer to install and maintain CCTV systems, improving work efficiency by reducing time in the field.\r\nIt comes with a wrist band which makes it practical and comfy when working on an instalation site.\r\nIt is also able to test audio on cameras or audio on cctv microphone. It's ability to test RJ45 network cable is a unique feature of this tester.\r\nIt automatically detects and displays PAL and NTSC systems. It can display AHD cameras even at 1080p.\r\nThis is a must-have tool for advance CCTV Analog & AHD camera Installers.\r\nParking List\r\nHD AHD CCTV Tester x 1\r\nAC/DC Adapter x 1\r\nPower Output Cable x1\r\nPower headx 1\r\nA/V Cable x 1\r\nVideo Cable x 1\r\nData Cable x 1\r\nWristbands x 1\r\nRJ45 Port X1",
      "price" : "35,000.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools ",
      "photo" : "00110.png"
    },
    {
      "id" : "00111",
      "name" : "HDMI To RJ45 Network Cable Extender For HDTV",
      "description" : "One pair as a full functional module, no need of setting\r\n-Cat-5e/6 cable can substitute HDMI cable to achiece long distance transmission\r\n-Transmission distance can be up to 30 meters for 1080p using CAT-6 Cable\r\n-Compact size\r\n-Signaling rater up to 1.65Gbps in support of 1080p display\r\n-HDMI Double Port Network Cable Extender Over by Cat 5e /6\r\nSpecifications:\r\nMaterial: Hard Plastic\r\nSuitable Cat-5e/6\r\nColor:Black\r\nPlug and play, support hot plug;\r\nSupport 3D 1080P HDMI1.4 resolution, 4k*2k\r\nSupport HDCP1.1/1.2\r\nSupport resolution: 480i/p, 576i/p, 720p, 1080i/p, 1920x1200,4k*2k\r\nPackage Included:\r\n1 Pair x HDMI To Dual Port RJ45 Network Cable Extender",
      "price" : "8,500.00",
      "instock" : "10",
      "category" : "Computer Accessories",
      "photo" : "00111.png"
    },
    {
      "id" : "00112",
      "name" : "Optical Fiber Visual Fault Locator",
      "description" : "Optical Fiber Cable Visual Locator(Pen type) uses the DFB-LD as the emitting component. Driven by constant current source, the indicator can emit stable red laser.The product can be used to inspect fiber failure when they connect with optical interface and be inserted into single mode or multi mode optical fiber.It is indispensable tool in fiber project constructing, fiber net-work maintaining, optical component manufacture and research.\r\nApplications\r\nMaintenance in telecom , CATV\r\nTest Lab of optical fibers\r\nfiber routing and continuity checking in optical networks.\r\nLocating the fault of fiber breakage, winding and so on.\r\nEnd-to-end fiber recognition.\r\nThe optimization of the machine connection point.\r\nContinuous or pulse working modes interchangeable.\r\nOther fiber optic measurements\r\nKey Features – Pen-Type Visual Fault Locator\r\n· 2.5mm universal connector,\r\n· Operates either in CW or Pulsed mode with constant output power\r\n· Long battery life (up to 60 hours)\r\n· drop-resistant and dust-proof design of laser head\r\n· Laser case ground design prevents ESD damage\r\n· Portable and rugged\r\n· Easy to use\r\n· Meets CE standards including EMC, EMI, ROHS\r\nTechnical Specifications – -Visual Fault Locator\r\nModel\r\nNF-903\r\nCentral wavelength\r\n650nm±10nm\r\nEmitter type\r\nFibre Type\r\nFP-LD\r\nSM/MM\r\nOutput power\r\n20mW\r\nOptical connector\r\n2.5mm universal connector, for 1.25mm connectors, FC (Male)-LC.\r\nOperating model\r\nBoth CW and Pulse available\r\nPulse frequency\r\n3Hz to 9Hz\r\nPower supply\r\n2AA alkaline batteries\r\nOperating temperature\r\n-20°C to 60°C\r\nStorage temperature\r\n-40°C to 85°C\r\nCaution:\r\n1.Don't connected high voltage lines to avoid buring out the machine.\r\n2.Put into the right place to avoid hurting others,because of the sharp part.\r\n3.Connected the cable to the right port.\r\n4.Read the user manual before use it.",
      "price" : "29,100.00",
      "instock" : "10",
      "category" : "Computer Accessories",
      "photo" : "00112.png"
    },
    {
      "id" : "00113",
      "name" : "Hdre01 4K X 2K 40M 2160P 3D HDMI Repeater Extender - Black",
      "description" : "HDRE01 4K x 2K 40m 2160P 3D HDMI Repeater Extender 4K X 2K HDMI Repeater Many people have upset with having to stay together watching TV for the signal line is too short or the house is too big. This 40m HDMI Repeater solves this problem. Now, with the HDMI repeater people can watch TV in their room freely, due to the HDMI repeater extender can extends the length of HDMI cable up to 40m by regenerating the HDMI signal before it sends the outputs to the HDMI monitor or projector.\r\nFeatures:\r\n- Support HDMI 1.4b\r\n- Support 3D , 4K x 2K\r\n- No power, plug and play, easy to install\r\n- Extends 4096 x 2160P up to 40 meters transmission distance\r\n- Compliant with HDCP 1.4\r\n- Operation frequency: Up to 340Mhz\r\n- HDMI data rate: 3.4Gbps (Single link)\r\n- Input / output resolution up to 1080P / 50Hz, 2160P / 24Hz\r\n- Regenerate the incoming HDMI signal by decoding and re-encoding it to a new standard HDMI signal, so it can extend the transmission range without degradation\r\nSpecifications:\r\nInput Video Signal: HDMI Signal\r\nHDMI Input/Output Connector: HDMI Cable\r\nOutput Video: HDMI 1.4\r\nVertical Frequency Range: 50 / 60Hz\r\nVideo Amplifier Bandwidth: 2.25Gbps / 225MHz\r\nInterlaced Resolutions(50 60Hz): 480i,1080i,\r\nProgressive Resolutions(50 60Hz): 480p,576p,720p,1080p\r\nOperating Temperature: 0 to +70degrees\r\nOperating Humidity: 10 - 80percent RH (no condensation)\r\nStorage Temperature: -10 to - 80degrees\r\nStorage Humidity: 5 - 90percent RH (no condensation)\r\nExternal Power Supply: HDMI Cable\r\nPower Consumption: 3W\r\nConverter Unit: FCC,CE.ROHS\r\nNote:\r\nDifferent cable quality may affect the maximum resolution and transmission distance. Type: Repeater\r\nInterface: HDMI",
      "price" : "7,500.00",
      "instock" : "10",
      "category" : "Computer Accessories",
      "photo" : "00113.png"
    },
    {
      "id" : "00114",
      "name" : "Smiley Face Badge 4GB Spy Video Recorder",
      "description" : "Smile you're on camera, the Smiley Face Pin Spy Camera is awesome. It records video, takes photos and works as a PC WebCam. It’s small, lightweight, portable and can easily be clipped on to clothing, belts, backpacks and purse straps. It's covert and mini design allows this dvr/camera/webcam to be used practically anywhere. The smile face hidden camera dvr supports a maximum 16GB of memory storage that will hold 10 hours of video footage and 1000’s of photos.\r\nPackage\r\nSmiley Face Pin Spy Camera\r\nMicro 2.0 USB Cable\r\nOperation Manual",
      "price" : "11,500.00",
      "instock" : "10",
      "category" : "SPY ",
      "photo" : "00114.png"
    },
    {
      "id" : "00115",
      "name" : "4 Port HDMI Switch Selector Hub Splitter Output Full HD 1080P HDCP HD",
      "description" : "1 HDMI 1.3b input signal split to four HDMI 1.3b sink devices. HDCP 1.2 protocol compliant Support CEC\r\nSupport deep color 30bit, 36bit\r\nSupport signal retiming\r\nSupport Blue-Ray 24/50/60fs/HD-DVD/xvYCC\r\nDigital audio format, as DTS-HD/Dolby-trueHD/LPCM7.1/DTS/Dolby-AC3/DSD Support iutput up to 15 meters AWG 26 HDMI 1.3 standard cable length Output up to 25 meters AWG26 cable length\r\nNo loss of quality\r\nInstalls in minutes\r\nNeed DC5V/1A power supply\r\nIt offers HD video solution for super market, shopping mall HDTV, STB, DVD and projector factory data control cente conference rooms education and training luxurious house home theaters etc.\r\nSpecifications:\r\nHdmi version: HDMI 1.3b HDCP version: HDCP1.2 HDMI resolution: 24/50/60fs/1080p/1080i/720p/576p/576i/480p/480i Support video color format: 24bit/deep color 30bit,36bit\r\nSupport audio format:DTS-HD/Dolby-trueHD/LPCM7.1/DTS/Dolby-AC3/DSD Max Bandwidth:225MHz Max Baud Rate: 6.75Gbps\r\nInput/Output TMDS signal: 0.5~1.5Volts p-p(TTL)\r\nInput/Output DDC signal: 5Volts p-p (TTL)\r\nInput cable distance =15m AWG26 HDMI 1.3 standard cable\r\nOutput cable distance: =25m AWG26 HDMI 1.3 standard cable\r\nMax working current: 600mA\r\nPower adapter format Input: AC (50HZ, 60HZ) 100V-240V Output: DC5V/1A\r\nOperating Temperature range: (-15 to +55?)\r\nOperating Humidity range: 5 to 90%RH (No Condensation)\r\nDimension (L x W x H) :110*57*2mm\r\nWeight:250 g\r\nPackage Included:\r\n1 x 4-Port HDMI Splitter\r\n1 x Adaptor\r\n1 x User Manual",
      "price" : "8,500.00",
      "instock" : "10",
      "category" : "Computer Accessories ",
      "photo" : "00115.png"
    },
    {
      "id" : "00116",
      "name" : "GP90 Portable Projector LED 3200 Lumens 1280*800 Support 1080P",
      "description" : "Customize Your Experience: With the projector, you can project to the front, rear, or ceiling. This means you can place the projector in a number of places: in the backyard, on a desk, or hung from the ceiling. A large, clear image projects in all locations when it's dark. Share your friends and family with movies, video games, football matches, play cartoons for the kids .Multi-function Inputs:Built-in speakers, AV/VGA/USB/HDMI interface and can connect to the projector with your iPhone, Android,Mac, PC, laptop, DVD, U-Disk/Hard Disk Device.Two USB Ports and Two HDMI Ports make more connection.Please note: You need a WIFI display dongle to connect projector with smartphone and tablet(support MHL function). If you want to connect it with macbook/macbook pro, a HDMI/VGA adapter (not included) for mac will be needed. Large Projection Screen Size:Suggest best image size 72-120 inches from 8-12ft.Dual IR Receiver to ensure Excellent Signal Reception. Energy Saving,Environmental Protection and Long Life:Healthy LED light source,diffuse reflection principle,light will not direct eyes, soft and not dazzling.More suitable for children, the elderly to watch.The led lamp up to 20,000 hours life no need to change.\r\nPackage\r\n1*Vivibright GP90 Projector\r\n1*Remote controller(battery is not included)\r\n1*3 in 1 AV cable\r\n1X VGA Cable\r\n1*User manual\r\n1*Power adapter",
      "price" : "85,000.00",
      "instock" : "10",
      "category" : "Projectors ",
      "photo" : "00116.png"
    },
    {
      "id" : "00117",
      "name" : "GP90 Portable Projector LED 3200 Lumens 1280*800 Support 1080P",
      "description" : "This VGA + audio to HDMI adapter can convert general PC signal and audio signal to HDMI format for HD displays. With this converter, the computer, laptop player, gaming consoles and some other video devices which is with VGA output can connect to large HD screens or HD projectors that is with HDMI input.\r\nSpecifications:\r\n* Video input: VGA-IN\r\n* Video output: HDMI-OUT\r\n* Audio input: 3.5mm-In\r\n* HDMI output interface: Connect to high-definition television, high-definition projectors, etc.\r\nMajo Features\r\nCan convert VGA and AUDIO signal to HDMI format.\r\nWith this converter, the computer, laptop player, gaming consoles and some other video devices which is with VGA output can connect to large HD screens or HD projectors that is with HDMI input.\r\nHDMI output can support up to 1080P/1.3.\r\nWith LED indicator.\r\nWith maximum operating current of 300mA.\r\nHigh quality.\r\nPlug and play, easy operation\r\nPackage\r\n1 x VGA Female to HDMI Male HD Video Converter Adapter\r\n1 x USB Cable\r\n1 x English User Manual",
      "price" : "7,000.00",
      "instock" : "10",
      "category" : "Computer Accessories",
      "photo" : "00117.png"
    },
    {
      "id" : "00118",
      "name" : "GP80 1800 Lumens Portable Video Projector for Home Cinema Theater    ",
      "description" : "Your passions in new format\r\nthe GP80 Series is a new quality that will allow you to take care of your passions. Now you can see your images from holidays or films from your sports camera in completely new-larger format.\r\nBroad range of multimedia\r\nthe projector processes a wide variety of sound, image and movie file formats. All audiovisual files can be played by user in high image quality and with stereo sound (two 5-Watt speakers). The sources of multimedia can be chosen between different ports. The device can be easily connected to with use of USB, HDMI, AV cables. Nothing stands in the way to the perfect displaying quality.\r\nRich color saturation with fine resolution, brilliant image Perfect brightness upgrade and the ultimate performance of the color design based on the minor axis. Forming a third generation technology concept. Meet TV video playback, built-in HD decoder chip supports 1080P video input, the TV picture quality for 90% of the end-user to choose.\r\nVery portable only 0.9kg\r\nSuper portable design concept, combined with fully enclosed optical engine with high-resolution LCD applications, compatible with 1080P video playback based on the physical resolution 800x480pixels.\r\nThe third-generation short-axis optical design unique technology\r\na minor axis of the optical structure applied to the new Simple projection platform,LED light source closer to the LCD Panel, the light source has a higher penetration force through the LCD Panel, distinguished from second-generation technologies to provide light utilization efficiency of 30%.\r\nReduced Fan Noise for Less Distraction\r\ncompared to other projectors on the market, this product is ultra silent as it operates with a fan noise of only 32db, which is the same as a high quality laptop. This translates into less distraction during presentations, or when viewing movies or playing games.\r\nPhysical Resolution: 800*480 pixels, compactible to fill HD(1080p)\r\nBrightness: 1800 ANSI LMs, Luminous efficiency, 220 lux peak brightness\r\nContrast Ratio: 2200:1, dynamic up to 1000:1\r\nthe Light source module's life: up to 20,000 hours\r\nThrow ratio: Based 1.38:1\r\nProjection Size: 28~180 inches, Distance: 3.93 ~ 18 ft\r\nWith ±15°(vertical) Keystone Correction\r\nColor support: 1.07 billion\r\nBuilt-in stereo speakers-4O,5W with SRS Sound\r\nNoise: In st.d-mode 32dB\r\nOSD Menu: 23country Language\r\nI/O:VGA/AV/audio*1;HDMI/USB*2\r\nVoltage:90~240V/50~60Hz\r\nSupported File Formats as follows\r\nVideo encoding format: MPEG1/MPEG2/MPEG4/DivX/Xvid\r\nVideo format: AVI/MOV/VOB/MPG/RM/RMVB/FLV/3GP/MKV/MP4\r\nAudio format: MP3/WMA/WAV/ASF/OGG/AAC\r\nImage format: JPEG/BMP/PNG/GIF\r\nText file: TXT/LRC etc\r\nInstructions Before use\r\nExternal Speaker required if you use a VGA cord to connect the micro projector while watching videos, VGA cable can NOT transmit audio signal\r\nIt's very easy to operate this ohderii mini home projector by using its remote control.\r\nFor quick presentations and Events, not perfectly suits for professional PowerPoint Presentation.\r\nIf you need a louder sound, an External Speaker must be required.\r\nSpecial Cords are required if you connect the projector to tablets and smartphones.(Please kindly notice that if you want connect it with your tablets, you need to purchase a VGA cord or a HDMI cord, and if you want connect it with your smart phone you need to purchase a HDMI adapter.)",
      "price" : "50,000.00",
      "instock" : "10",
      "category" : "Computer Accessories",
      "photo" : "00118.png"
    },
    {
      "id" : "00119",
      "name" : "Vention VGA To HDMI Converter Cable With Audio 1080P For PC Laptop",
      "description" : "There is no hassle with using this device; all you have to do is plug it in. There is no need to download or update drivers and no need to install any other additional software.\r\nFeatures:\r\n1. 100% brand new and high quality.\r\n2. Hassle free! Plug and play as you go.\r\n3. Supports HDTV Resolutions Up to 1080p.\r\n4. Portable Design, No need to install drivers.\r\n5.Upscale VGA signal to HDMI signal with audio.\r\n6.Dual-chip USB design, support audio output and power supply the same time.\r\n7.With a standard HDMI output by digital signal, only need an HDMI cable to synching up.\r\n8.Powered by USB or 5V For DC adapter, low power consumption.\r\n9.Provides advanced signal and processing with great precision color.",
      "price" : "6,500.00",
      "instock" : "10",
      "category" : "Computer Accesories",
      "photo" : "00119.png"
    },
    {
      "id" : "00120",
      "name" : "Garmin Etrex 30 GPS",
      "description" : "Comes with a 2.2 inch which has a display readable even in sunlight\r\nThe screen has a 65K color with a 240 x 320 p screen resolution\r\nDevice has a 3.7 GB expandable internal memory so more maps can be stored in the gadget\r\nHas a worldwide basemap\r\nInstalled with a barometric altimeter and a 3 axis compass\r\nMore Memory\r\nExpanded inner memory and microSD™ card opening gives you a chance to load an assortment of extra discretionary maps, including TOPO maps, BlueChart® g2, City Navigator NT® and BirdsEye Satellite Imagery (membership required).\r\nKeep your Fix\r\nWith its high-affectability, WAAS-empowered GPS beneficiary, HotFix® satellite forecast and GLONASS bolster, eTrex finds your position rapidly and definitely and keeps up its area even in substantial spread and profound gulches.\r\nFabricated in Sensors\r\neTrex 30x includes an inherent 3-hub tilt-repaid electronic compass and a barometric altimeter which tracks changes in pneumatic force to pinpoint your exact height in addition to you can utilize it to plot barometric weight after some time.\r\nRemote Capabilities\r\nOffer waypoints, tracks, courses and geocaches remotely with other perfect gadgets – basically press “send” to exchange your data. Likewise unites remotely to good Garmin gadgets, including VIRB™ and frill sensors, including Tempe™, foot case and heart rate screen. (eTrex 30x just)\r\nRuggedized for the Outdoors\r\neTrex is assembled to withstand the components – with an ergonomic, tough outline that stands solid against dust, earth, dampness and water.\r\nGo Anywhere\r\nWith a variety of perfect mounts, eTrex is intended for use on ATVs, bikes, vessels, as a handheld, or in your auto.\r\nPaperless Geocaching\r\nBackings geocaching GPX records for downloading geocaches and points of interest straight to your eTrex – no additionally entering facilitates physically or p\r\nThe Good\r\nFor the record, Garmin is already known to be one of the best brands as far as GPS products are concerned but this upgraded version is even better compared to the first releases.\r\nPersonally, I love the shape of this product because it is easy to mount and at the same time, you can have a good grip on the handheld GPS. It comes with an ergonomic design making it a perfect fit for all outdoor activities from hiking to cycling to driving.\r\nAnother good thing about this one is that it can be shared wirelessly and it can be connected to other Garmin devices. It has a bike cadence as well as a heart rate monitor. Plus, this supports geocoaching which is a lot of fun.\r\nUser Friendly Programs:\r\nThe best element of the Etrex is the mapping projects that it is perfect with. Actually, I have had an unpleasant time with non-Garmin units and making sense of how to transfer maps and waypoints. On the off chance that you have Windows, Topo Fusion is your go-to mapping system. On the off chance that you have an Apple PC, you will be utilizing Garmin Basecamp. I am an Apple client, and I cherish how easy to use Basecamp is.\r\nI download free maps, I have a tendency to download maps by state. I then utilize Garmin Map Install/Manager to stack the guide onto the gadget. This steps of needing to physically drop the document yourself. From Basecamp you can open every guide under the maps tab once they have been transferred. Basecamp permits you to effectively import GPX records you can likewise trade the GPX document to Google Earth, giving you a 3D visual of the course which is to a great degree supportive when concentrating on your up and coming ride. When you have the GPX record transferred you can drop your waypoints quiet. Try to spare your course to your Etrex and you’re ready.\r\nUpgraded Display\r\nFeatures a 2.2” 65K color sunlight readable display offering increased resolution (240 x 320 pixels).\r\nPreloaded Map Garmin TopoActive\r\nPreloaded Garmin TopoActive Eastern/Western Europe map with data that is helpful for recreational exercises, (for example, trekking and cycling), routable, and indicates height changes.",
      "price" : "135,000.00",
      "instock" : "10",
      "category" : "GPS",
      "photo" : "00120.png"
    },
    {
      "id" : "00121",
      "name" : "13mm IR Night Vision Full HD 1080P 12MP Motion Detection 8GB Spy Watch - Black",
      "description" : "This is a HD-DV watch. You can shoot high-definition video, take high-quality photos, record high-quality audio. With simple operation, elegant design, small size, it is easy to carry. It is an essential utility in business, education, security, media, justice, tourism, health care, living and other field. 8GB Inbuilt Memory.\r\nAvailable Options: Gold, Black & Brown Leather\r\nVision Function\r\nWaterproof design 3ATM\r\nVideo recorder with real time clock display\r\nHD PC webcam function\r\nHD9712 illumination photosensitive chip\r\nMotion Detection\r\n12MP\r\nIR\r\nSpecification\r\nVideo resolution: 1920*1080P\r\nVideo format: AVI\r\nVideo frame rate: 30 fps\r\nPhoto resolution: 12 Mega pixels\r\nPicture: 4032*3024\r\nVision Angle: 90 degree\r\nMemory card: Built-in 8GB Micro SD card, up to 32GB\r\nBattery volume: 380mAh\r\nDuration of Charging: 1.5hours\r\nPower Consumption: 380mAh/3.7V(Maximum)\r\nStorage Temperature: -10~70 degree\r\nOperating Temperature: -10~60 degree\r\nSupport : Automatically open ,Motion detection, reset,format,auto change resolution\r\nSupport System Windows me/2000/XP/2003/vista; Mac OS 10.4; Linux;\r\nPackage Contents\r\n1 X 1080pvideowatch Camera With IR Camera\r\n1 x USB Cable\r\n1 x Adapter\r\n1 x CD Driver",
      "price" : "21,500.00",
      "instock" : "10",
      "category" : "SPY",
      "photo" : "00121.png"
    },
    {
      "id" : "00122",
      "name" : "8GB Waterproof HD Spy Watch Video Recorder - Leather",
      "description" : "Waterproof, Smallest Pin-hole camera made especially for spy use Built-in 8GB memory. Can be used as a normal watch/USB storage device/Web cam for pc. High definition video with voice Adjustable sound recording alone for WAV format.\r\nCompatibility: Windows XP/2000/98 Plug and Play no drivers required (apart from 98).\r\nVideo format 1280 x 960 AVI format, 640x480, 30 FPS Photo Format 3264 x 2448, Audio Format 128kbps, PCM Audio Power Source USB Charging/Internal Battery.\r\nThe work time 300 minutes, Built In Microphone, Max Audio Range 15 Meters, Hidden Colour CMOS sensor, Automatic White Balance, Real time record any video and audio evidence instantaneously. Memory 8GB Video Camera Wrist-Watch USB cable. User manual and Extra Knob.\r\n32GB also available",
      "price" : "7,450.00",
      "instock" : "10",
      "category" : "SPY",
      "photo" : "00122.png"
    },
    {
      "id" : "00123",
      "name" : "First Alert Radon Gas Test Kit",
      "description" : "The First Alert RD1 Radon Gas Test Kit easily and safely allows you to check your home, work, or other spaces for dangerous radon gas. Radon is a colorless, odorless gas that is the leading cause of lung cancer in non-smokers. The kit offers comprehensive instructions. This radon testing kit is an easy and inexpensive way to determine if radon is present and is ideal for disaster preparedness.\r\nThe Easy Way to Check for Radon\r\nThe First Alert Radon Gas Test Kit includes everything you need to check your home, business, or school for radon. Radon is a naturally occurring gas that can be found in basements, drains, crawl spaces, and other areas below ground. The EPA recommends testing for radon below the third floor of buildings. The charcoal-based radon test kit is listed under the EPA Radon Gas Measurement Proficiency Program.\r\nSimple Test Takes Just Minutes\r\nTesting for radon should only take a few minutes, and is safe and easy. Simply leave the radon sampler out in the lowest point in your home or office for two to four days.\r\nIncludes Next Steps and Recommendations\r\nThe radon testing kit includes information on what to do if you do have a radon problem and how to interpret the results of your test. More comprehensive testing might be required if results indicate the presence of radon. The kit also includes background information on the dangers of radon and how it might be entering your building.\r\nWhat's in the Box:\r\nFirst Alert RDI Radon Gas Test Kit\r\nInstruction manual",
      "price" : "14,500.00",
      "instock" : "10",
      "category" : "Home Accessories",
      "photo" : "00123.png"
    },
    {
      "id" : "00124",
      "name" : "Laser Distance Meter- 60 Meters",
      "description" : "Simply Aim! Shoot!! Measure!!! A special high accuracy, remote and difficult reaching points, and one person distance measuring device. Specifically designed for both indoor and outdoor applications. Shortcut keys for addition, subtraction, Pythagoras, area and volume calculation make measuring fast and very reliable. Under the strong light outside, it measures at least the specified range and under good light condition of indoor, it can achieve more than the specified range. 60Meters.\r\nMeasuring range: 0.05m to 60m\r\nConstruction project supervision & on-site inspection.\r\nFast forensics from accident site for Traffic police.\r\nReal estate development and evaluation, fire evaluation.\r\nPublic facilities planning, landscaping planning and application in telecommunication industry and so on.\r\nPowered by: 2 x AAA batteries (NOT INCLUDED)\r\nInterior decoration & design, and construction technology",
      "price" : "20,000.00",
      "instock" : "10",
      "category" : "Meters",
      "photo" : "00124.png"
    },
    {
      "id" : "00125",
      "name" : "Broadlink Mini3 Smart Home Automation Remote Universal Controller",
      "description" : "RM Mini3 is a revolutionary smart intelligent appliance controller. BroadLink black\r\nbeans is the first good Intelligent remote control. Air conditioning, televisions, set-top boxes and other appliances can be easily controlled, mobile second remote control.\r\nDesigned to help you get more control and perform better. It enables you to smart your home any where you are, as well as any time you want. Broadlink Strong R&D team spent almost one years conducting scientific research,\r\nbuilding hardware prototypes and developing the algorithms for black bean . The end result is the most advanced\r\nsmart wireless device ever created, hidden in a mini cylinder that is elegant and ergonomic.\r\nMain Features:\r\nRemote Control\r\nSupport scene mode and sleep mode\r\nSmart Control\r\nControl your devices anywhere at anytime through the app, one key to control\r\nScheduling\r\nPreset your own profiles, automatically work at set time\r\nCare Your Pets\r\nTurn on the air condition when you are not in home\r\nTimer Function\r\nSet up the time as you wish, don't miss any moment\r\nEasy Configuration\r\nConnect to your home and office WiFi, no gateway needed\r\nSuitable for iOS 7.0 or above, Android 4.0 or above\r\nIR remote control distance can be up to 12m\r\nInfrared frequency: 38K\r\nWiFI frequency: 2.4GHz 802.11b/g/n",
      "price" : "13,000.00",
      "instock" : "10",
      "category" : "Home Accessories",
      "photo" : "00125.png"
    },
    {
      "id" : "00126",
      "name" : "First Alert Drinking Water Test Kit",
      "description" : "The First Alert Drinking Water Test Kit contains everything you need to check for eight common contaminants or issues with drinking water that can cause health problems, including bacteria, lead, pesticides, nitrates, chlorine, pH, and hard water. The simple and accurate do-it-yourself kit is the easy way to check if your drinking water is safe. No need to send samples to a laboratory and wait; results are provided in 10 minutes. The water-testing kit tests to EPA standards for drinking water.\r\nCheck Your Water for Contaminants\r\nThe First Alert WT1 Drinking Water Test Kit tests for contaminants that can cause serious health problems including developmental harm, neurological disease, and cancer. The kit also tests for hardness, which causes limescale buildup, and pH that can cause metals to leach and damage plumbing.\r\nFast Results without Waiting\r\nOther water-testing kits can require you to submit a sample to a lab and wait days for the results. The First Alert Drinking Water Test Kit provides everything you need to analyze your water supply for eight common contaminants and quality issues. Each test takes roughly 10 minutes to get results.\r\nIdeal for Those Using Well Water\r\nIf your home is on a well, the water can be contaminated by pesticide runoff, fertilizers, and other contaminants used in farming or agriculture. Pesticides have been linked to increased risk of cancer, and fertilizers can cause developmental issues in young children. Give your family the peace of mind they deserve to know their water supply is safe and clean.\r\nPlease note that this First Alert Drinking Water Test Kit is a screening test and cannot be used to certify water as safe or unsafe for drinking. This test kit provides approximate results ONLY when used in strict accordance with instructions. First Alert expressly disclaims any liability resulting from use of this product, failure to follow instructions, or reliance on test results.\r\nThe First Alert Drinking Water Test Kit tests for elements in your drinking water system that can lead to serious health problems. It tests and provides immediate results for:\r\nBacteria--Strains of E. coli can cause serious illness or death.\r\nLead--Causes developmental harm, neurological damage, and kidney damage.\r\nPesticides--From agricultural uses, linked to increased cancer rates.\r\nNitrates/nitrites--From fertilizers and animal waste, causes developmental problems.\r\nChlorine--By-products can increase cancer risk and cause bad taste and odor.\r\nHardness--Causes lime scale and higher detergent use.\r\npH--Can cause heavy metal (such as lead) leaching and plumbing damage.\r\nWhat's in the Box:\r\nBacteria test vial\r\nLead/pesticide test packet\r\nNitrate/nitrite test packet\r\npH/hardness/chlorine test packet\r\nInstruction manual",
      "price" : "12,000.00",
      "instock" : "10",
      "category" : "Home Accessories",
      "photo" : "00126.png"
    },
    {
      "id" : "00127",
      "name" : "Broadlink A1 Wifi Intelligent Smart Home Air Detector Sensor Purifier",
      "description" : "BroadLink A1 White WiFi Intelligent Smart Home Air Detector Sensor Purifier Remote Control\r\nThe BroadLink A1 air detector, can detect the environment indexes, including VOC, voice, humidity, temperture etc, control your device on your smartphone when you are away from home, protect your family's health.\r\nConjuncting with e-Air detector, you can preset the action or the time your need on the app \"e-Control\".\r\nFor example, by setting the time, the BroadLink smart devicest will automatically work.\r\nFeatures :\r\nConnect to your home and office WiFi\r\nSupport Interaction with other BroadLink and BroadLink DNA smart devices\r\nControl your devices from anywhere at any time through the app \"e-Control\"\r\nDetect VOC, voice, light, humidity and temperature etc\r\nIndicating light Show the air quality, remind you to open the window if necessary\r\nMini and compact design, portable and modern decoration in your home.\r\nPackage Includes :\r\n1 x BroadLink White A1 Smart Air Detector 1 x USB Cable 1 x User Manual (Comes in packing box)",
      "price" : "35,500.00",
      "instock" : "10",
      "category" : "Home Accessoriese",
      "photo" : "00127.png"
    },
    {
      "id" : "00128",
      "name" : "XEAST XE-901 5 Lines 3D Green Laser Levels Self Leveling 360 Degree",
      "description" : "Xeast XE-901 Laser is great for various leveling and layout applications. This unit is used for projecting bright crossing horizontal(4) and vertical(1) lines. It features green beam laser technology which is more visible and allow for a greater visible range in interior applications along with better exterior visibility. This unit offers (3) 360 degree line lasers to aid in full room layout. A full-time pulse mode allows use with a detector. It also has an integrated magnetic bracket, an over-molded housing and IP65 water/debris resistance, along with a locking Pendulum that helps t prevent damage to internal components. It uses 4 AA batteries\r\nModel No. XE-901 XE-901\r\nRed Laser\r\nType 1H(360)/1V\r\nExpanded Angle H360° / V130°\r\nLaser class Class 2\r\nLight source 40MW&10MW\r\nLaser wavelength 510nm\r\nH/V accuracy ±3mm/10m\r\nSelf-leveling range 4°±1°\r\nSelf-leveling time =3s\r\nWorking distance(Line) 35m?=50m\r\nwith detector\r\nOperating time >4.5h(all lasers on)\r\nPower source 4 * AA(LR6)\r\nIP rating IP54\r\nOperating Temperature range -10°C to 50°C\r\nStorage temperature range -20°C to 70°C\r\nMount size 1/4''-20\r\nWeight 1.5gk",
      "price" : "65,000.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools",
      "photo" : "00128.png"
    },
    {
      "id" : "00129",
      "name" : "WI-FI Globe/Bulb Panoramic Smart Camera",
      "description" : "This is another spy way to monitor and secure your home's or office. It is built in such a way that no one knows. It is an electric light bulb with inbuilt panoramic fisheye ip camera. The bulb itself gives normal electric light while the inbuilt hidden camera captures the videos and audio of the environment.\r\nThe video and audio footage is viewed and recorded through the mobile phone from anywhere. To access this system you have to download the app (IPC360) from playstore, etc. to your mobile phone but the operation is very simple.\r\nThis system is ideal for homes, offices, stores, supermarket, etc.\r\nMain Features :\r\n1. Plug & Play design\r\n2. Fisheye lens 360 degree panoramic viewPRO glass lens.\r\n3. Hidden camera design Pure two-way voice intercom.\r\n4. Local storage with a micro SD card up to 128G\r\n5. Smart phone viewing through app download.\r\nSpecification :\r\n1. Fisheye p2p wifi ip cameras\r\n2. CPU: GM8135+SC1035\r\n3. Sensor : 1/3?Progressive Scan CMOS\r\n4. Lens : 1.44mm,360° fisheye lens\r\n5. Angle : Horizontal 360°\r\n6. Video format : 1280*960(1.3MP)\r\n7. Video Compression Standard H.264\r\n8. Audio Compression Standard G.711\r\n9. Video Frame Rate Max 25 fps\r\n10. Video Play back Mode : Mobilephone APP\r\n11. Aduio Input / Built in Microphone ;\r\n12. Output : Built in horn\r\n13.IR Night Vision IR LEDs,IR distance10m, ( Optional IR-CUT automatic switching)\r\n14. Local Storage TF/SD Card , Max support 128GB\r\n15. Multi Protocols: TCP/UDP,IP,SMTP,FTP,DHCP,UPNP,NTP\r\n16. Wifi IEEE 802.11b/g/n\r\n17. Image Rotation Mirror / inverted\r\nVideo monitor support",
      "price" : "40,000.00",
      "instock" : "10",
      "category" : "SPY",
      "photo" : "00129.png"
    },
    {
      "id" : "00130",
      "name" : "PH/Temperature Meter",
      "description" : "Use to measure the pH level and temperature of solution.\r\nWaterproof IP65 and replaceable sensor probe.\r\nThe water quality monitor is professional and useful tool for testing PH/TEMP of solution level. Perfect for wide applications, such as beverage, fish hatcheries, food processing, aquarium, photography, laboratory, quality control, school & collegeAutomatic calibration function.\r\nApply in water sources, aquarium, hydroponics, spas, swimming pools and other water systems.\r\nVery wide variety of applications, used for testing the acidity and alkaline levels of almost any liquid.\r\nCompact and portable pen-type design.\r\nAuto shut off.\r\nEasy to use and provides instant display of results.\r\nSpecifications:\r\nRange: 0.00 ~ 14.00pH\r\nResolution: 0.01pH; 0.1°C (0.2°F)\r\nAccuracy: ±0.1pH ; ±1.0°C\r\nOperating Temperature: 0 ~ 50 degree(32°F ~ 122°F)\r\nTemperature Compensation: 0°C ~ 50°C (32°F ~ 122°F)\r\nBattery: 4×1.5V (AG-13) Button Cell Battery (not included)\r\nColor: Yellow\r\nMaterial: ABS\r\nItem Size: 18.8 * 3.5 * 3.5cm / 7.4 * 1.4 * 1.4in\r\n1*PH Teste\r\n3*1.5V batter\r\n2* pouches of calibration buffer solution (4.0 & 6.86)",
      "price" : "14,500.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools",
      "photo" : "00130.png"
    },
    {
      "id" : "00131",
      "name" : "Laser Distance Meter 50M",
      "description" : "Simply Aim! Shoot!! Measure!!!\r\nA special high accuracy, remote and difficult reaching points, and one person distance measuring device. Specifically designed for both indoor and outdoor applications. Shortcut keys for addition, subtraction, Pythagoras, area and volume calculation make measuring fast and very reliable. Under the strong light outside, it measures at least the specified range and under good light condition of indoor, it can achieve more than the specified range. 50Meters\r\nInterior decoration & design, and construction technology.\r\nConstruction project supervision & on-site inspection\r\nFast forensics from accident site for Traffic police.\r\nReal estate development and evaluation, fire evaluation.\r\nPublic facilities planning, landscaping planning and application in telecommunication industry and so on.\r\nFEATURES:\r\n* Instant measurement of distance with one button operation\r\n* Automatic calculation of Area and Volume\r\n* Indirect measurement by Pythagorean Theorem\r\n* Easy Addition/ Subtraction of measurements\r\n* Benchmark button to measure from front or back of device\r\n* Selectable Units: meter (m), inch (in) and feet (ft)\r\n* Store/ recall/clear function: 99 data storage\r\n* Air Bubble Level to enable correct horizontal placement\r\n* Easy targeting with bright laser pointer\r\n* Large LCD with backlight and multi-line display (4 lines)\r\n* Auto correction and error report technology\r\n* Auto / Manual power off function\r\n* Compact & handy design\r\nSPECIFICATIONS:\r\n* Measuring range: 0.2 to 50m\r\n* Accuracy: ±2mm (0.079inch)\r\n* Class II Laser product\r\n* Dust & Splash proof: IP 54\r\n* Laser Auto off: 30 seconds, Power Auto off: 3 minutes\r\n* Operation temperature: 0~40°C (32~104°F)\r\n* Weight (without battery): 130g\r\n* Dimension: 118 x 54 x 28mm\r\n* CE, ROHS, FCC certified\r\n* Package: 1 x Laser distance meter, 1 x User’s Manual, 1 x Pouch bag, 1 x Holding rope and 3 x 1.5V AAA Batteries\r\nCAUTION! Do not stare into LASER Beam. Keep away from children and non-professionals.\r\n* An indispensable tool for Architects, Interior Designers, Engineers, Real Estate Valuers, etc.",
      "price" : "19,500.00",
      "instock" : "10",
      "category" : "Diagnostic, Testing & Measuring Tools",
      "photo" : "00131.png"
    },
    {
      "id" : "00132",
      "name" : "Upgraded Coloured Screen Laser Distance Meter 0.05 To 100m",
      "description" : "New Upgraded Laser Distance Meter 0.05 to 50m (0.16 to 164ft) Charging and PC Connect High-precision Laser Distance Meter\r\nBrief Description\r\nThis Professional Distance Meter employs laser technology to measure distance, area and volume accurately, quickly and conveniently, this meter can make use of Pythagorean Theorem to measure distances or lengths indirectly when direct measurement is not feasible.\r\nLaser distance meter has a wide variety of applications in construction and industries. It is very useful and convenient to give accurate measurement of distance, area and volume especially in large areas such as rooms, apartments, buildings, real estates, factories, warehouses, gardens, roads, infrastructures, etc.\r\nProduct Features:\r\n• The new upgraded models, increasing the function of connected to the computer, can record data on the computer and print data through the computer.\r\n• Upgrade section, the use of rechargeable batteries, more environmentally friendly, more affordable.\r\n• The instrument can manually add and subtract distance, area, volume, easy to operate.\r\n• The new screen, large LCD with backlight, multi-line display, more clear and lucid guide your operation.\r\n• High-quality, and wide measuring range up to 100m(328t).\r\n• High-precision instrument, the error is ±2mm (±0.08 inch).\r\n• Quick measurement of distance, and automatically calculate area and volume.\r\n• Indirect measurement by Pythagorean Theorem. This instrument has six triangle measurement method.\r\n• Multi-direction electronic level bubble, delay measurement, staking-out and angle measurement.\r\n• Min/Max distance tracking, and user can use staking-out function to find the position which match the setting distance.\r\n• You can set the Laser Distance Meter’s reference point.\r\n• Easy addition/subtraction of measurement.\r\n• Switchable among metre(m), inch (in), feet (ft).\r\n• Easy targeting with bright laser pointer, quick response, so it is widely used in various industries.\r\n• Auto correction and error report technology.\r\n• Low battery indication\r\n• Auto / manual power off function\r\n• Self-Calibration\r\nSpecification(approx):\r\nMeasuring range: 100m (328ft)\r\nAccuracy:±2mm(±0.08 inch)\r\nLaser class: Class II\r\nLaser type: 635nm,\r\nWhat is in the box\r\n1 x Laser Distance Meter\r\n1 x Pouch\r\n1 x USB Connector\r\n1 x Holding Rope\r\n3 x Rechargeable Battery\r\n1 x User Manual\r\n1 x disc",
      "price" : "43,000.00",
      "instock" : "10",
      "category" : "Meters",
      "photo" : "00132.png"
    },
    {
      "id" : "00133",
      "name" : "Laser Distance Meter -150m(492ft)",
      "description" : "Simply Aim! Shoot!! Measure!\r\nA special high accuracy, remote and difficult reaching points, and one person distance measuring device. Specifically designed for both indoor and outdoor applications. Shortcut keys for addition, subtraction, Pythagoras, area and volume calculation make measuring fast and very reliable. Under the strong light outside, it measures at least the specified range and under good light condition of indoor, it can achieve more than the specified range. 150Meters\r\nFeatures:\r\nInstant measurement of distance, area & volume with one button operation: YES\r\nWide measuring range: YES\r\nHigh accuracy: ±2mm (0.079inch)\r\nAutomatic calculation of Area and Volume: YES\r\nIndirect measurement by Pythagorean Theorem: YES\r\nSingle/Continous measurement: YES\r\nMax/Min distance tracking (display value): YES\r\nEasy Addition/ Subtraction of measurement: YES\r\nSet up front / rear benchmark: YES\r\nSelectable meter(m), inch(in) and feet(ft): YES\r\nData store/ recall function: YES\r\nData Hold / Data clear function: YES\r\nAir Bubble Level: YES, Included\r\nEasy targeting with bright laser pointer: YES\r\nLarge LCD with backlight and multi-line display (4 lines): YES\r\nAuto correction and error report technology: YES\r\nBuzzer indication: YES\r\nBattery status Indication: YES\r\nIP54 protection (dust & splash proof): YES\r\nAuto / Manual power off function: YES\r\nMultifunction with intelligent calculation: YES\r\nCompact & handy design: YES\r\nCE, ROHS, FCC certificate: YES\r\nSpecification:\r\nMeasuring range: 150m -492FT\r\nAccuracy: +/-0.5 mm\r\nLaser class: Class II\r\nLaser wavelength: 635nm\r\nLaser maximum output: <1mW\r\nDust & Splash proof: IP 54\r\nLaser Auto off: 30s\r\nPower Auto off: 3min\r\nWorking temperature range: 0-40C (32-104F)\r\nStorage temperature range: -10-60C (14-140F)\r\nBattery: 1.5V 2 x AAA\r\nDimension: 118x54x28mm (4.65x2.12x1.10inch)\r\nPackage Content:\r\n1 * Laser Distance Meter\r\n1 * Portable pouch\r\n1 * Reflective Plate\r\n1 * Hanging rope\r\n1 * User manual\r\n1 * Retail box\r\nApplications\r\nInterior decoration & design, and construction technology.\r\nConstruction project supervision & on-site inspection.\r\nFast forensics from accident site for Traffic police.\r\nReal estate development and evaluation, fire evaluation.\r\nPublic facilities planning, landscaping planning and application in telecommunication industry and so on.\r\nPowered by: 2 x AAA batteries",
      "price" : "43,900.00",
      "instock" : "10",
      "category" : "Meters",
      "photo" : "00133.png"
    },
    {
      "id" : "00134",
      "name" : "Laser Distance Meter- 80M",
      "description" : "Simply Aim! Shoot!! Measure!!! A special high accuracy, remote and difficult reaching points, and one person distance measuring device. Specifically designed for both indoor and outdoor applications. Shortcut keys for addition, subtraction, Pythagoras, area and volume calculation make measuring fast and very reliable. Under the strong light outside, it measures at least the specified range and under good light condition of indoor, it can achieve more than the specified range. 80Meters\r\nInterior decoration & design, and construction technology.\r\nConstruction project supervision & on-site inspection.\r\nFast forensics from accident site for Traffic police.\r\nReal estate development and evaluation, fire evaluation.\r\nPublic facilities planning, landscaping planning and application in telecommunication industry and so on.\r\nPowered by: 3 x AAA batteries",
      "price" : "24,000.00",
      "instock" : "10",
      "category" : "Meters",
      "photo" : "00134.png"
    },
    {
      "id" : "00135",
      "name" : "Digital PH Meter",
      "description" : "This digital pen style pH meter is an ideal instrument for aquarium, fishing industry, swimming pool, school laboratory, food & beverage etc\r\nPen type meter that can simultaneously measure & display pH and temperature results.\r\nThis Digital Pen Style pH Meter is used to measure liquid range from 0~14 pH, accuracy up to 0.1pH\r\nOne-touch automatic digital calibration.\r\nAuto-off function, data-hold function and low-battery indicator.\r\nWith protective plastic case and calibration screwdriver.\r\nIncludes a cap, batteries, storage solution and pH 7.0 buffer\r\nExcellent meter, very accurate and durable\r\nSpecification\r\nMeasuring range: 0.0 to 14.0pH\r\nResolution: 0.1 pH\r\nAccuracy: +/- 0.1 pH\r\nTypical EMC DEV: +/-0.2pH\r\nTemperature compensation: 0 degree C to 50 degree C\r\nBattery: 4*1.5v (AG-13 button battery)\r\nRelative humidity: <95%\r\nLife: Approx. 700 hours of use\r\nDimensions: 150*29*20mm\r\nNet weight: 52g",
      "price" : "6,750.00",
      "instock" : "10",
      "category" : "Meters",
      "photo" : "00135.png"
    },
    {
      "id" : "00136",
      "name" : "Portable Pentype Salt Meter",
      "description" : "This compact, water-proof salinity tester/meter. Wide range of applications including salt water aquarium supplies and other water salt content testing.\r\nIn seconds this electronic probe delivers a high accuracy digital reading of the salt content of your water, and even compensates for temperature automatically.\r\nAnd with a reading range from zero up to 1000 mg/L (ppm) this pen type salt meter keeps going where most others give up!\r\nRobust waterproof and comes complete with a tough carry case and batteries.\r\nThis salinity tester is useful for a wide range of salinity meter applications including:\r\nSalt Aquarium supplies\r\nDam, river and bore water quality\r\nBeverage and food processing\r\nFish hatcheries\r\nPhotography\r\nLaboratory\r\nSchools and colleges\r\nIn fact, any where that salinity in water quality control is important.\r\nFeatures\r\nRange: 0 to 1000 mg/L.\r\nLCD with indicates both mg/L & temp.\r\nPen type digital TDS meter, all in one, salt electrode included, easy to use.\r\nData hold function for freezing the desired value.\r\nWater proof.\r\nAuto powers off after 5 minutes of non-use.\r\nBuild in temperature sensor, ATC (auto temperature compensation).\r\nMicrocomputer circuit, intelligent function, high accuracy.\r\nEasy to change the TDS electrode.\r\nCompact size, light weight.\r\nTemperature measurement, °C,°F.\r\nPower supply by 1.5 V battery (LR44)\r\nSpecifications:\r\nDisplay: LCD\r\nsize : 20 mm x 27 mm.\r\nMeasurement Range\r\nSalt 0 to 1000 mg/L.\r\nTemp. 0 to 50°C( 32 to 122 °F ).\r\nResolution\r\nSalt 1 mg/L.\r\nTemp. 0.1 °C/ 0.1 °F.\r\nAccuracy\r\nSalt ± 1% FS After calibration.\r\nTemp. ± 0.8°C/ ± 1.5 °F.\r\nSalt Calibration: 6640 mg/L(12.88 ms/cm), 1 points calibration.\r\nOperating Humidity: Less than 80% RH.\r\nDimension: 188 x38 mm(Meter with Salt electrode.)",
      "price" : "25,000.00",
      "instock" : "10",
      "category" : "Meters",
      "photo" : "00136.png"
    },
    {
      "id" : "00137",
      "name" : "Alkaline Hydrogen Water Stick - Minerals Ionizer Water Purifier Filter",
      "description" : "Alkaline Water\r\nNegative Potential Water\r\nAdd Beneficial Microelements\r\nEnergizes Water with Small Molecular Clusters Structure\r\nRegulates The Ph Balance for A More Alkaline Environment for Vitality And Harmony.\r\nBreaks Down Water Molecules for Better Absorption of Nutrients And Minerals Through Reverse Osmosis, Oxygenating The Body And Increasing Metabolic Rate.\r\nHow to Use:\r\n1. Before using, put in a bottle filled with water and shake vigorously for 1 minute and empty.\r\n2. Fill bottle, shake about 10 times, wait 15 minutes. The longer the water sits with the stick submerged, the stronger the ionization and the higher the pH.\r\n3. It is best to drink your ionized water fresh.\r\n4. You may dry the Stick between uses if you wish.\r\n5. Use one stick for a bottle of 500ml. Use two sticks for 1L bottle, or more sticks for faster, stronger ionized drinking water.\r\n6. Sticks will last about 90 days making 1 liter of water per day. Replace when smelling chlorine again.\r\nProduct Properties:\r\nItem Type: Braces and Supports\r\nType: Portable/Travel Filter\r\nEffect: Improve Sleep\r\nMaterial: stainless\r\nFiltration Method: Alkaline Ionizer",
      "price" : "2,500.00",
      "instock" : "10",
      "category" : "Kitchen Appliances",
      "photo" : "00137.png"
    },
    {
      "id" : "00138",
      "name" : "Hearing Aid & Voice Amplifier - K-80",
      "description" : "K-80 hearing aid and voice amplifier provides you with accurate results. Suitable for air conductive hearing loss patients. It is easy to use. When worn it is Invisible and comfortable to wear. Its adjustable volume control alows you control the pitch.\r\nHearing Aid & Voice Amplifier | Axon K-80\r\nSuitable for air conductive hearing loss patient\r\nCan be used for air amplifier\r\nHelps you hear the sound clearly and loudly, whether indoors or outdoors\r\nSound gain up to 30dB\r\nMax Sound Output: =120 dB\r\nMax Sound Gain: =30 dB\r\nHarmonic Wave Distortion: f<1000Hz=10%,f>1000Hz=4%\r\nFrequency Range: 250~3500 hz\r\nInput Noise: =50 dB\r\nBattery: AG3 or A312(Zinc Air Battery)\r\nWorking Voltage: DC 1.5V\r\nWorking Current: =4mA\r\nMeasurement: 19 x 14 x 16mm\r\n• When you see the film, watch the play, have meeting, or have classes, this product can help you to hear the sound clearly and loudly\r\n• Made of durable soft plastic material that comfortable\r\n• NOTE:\r\n1. It is forbidden to used by those patients with tympanitis or ear pyogenesis\r\n2. Don't use it at high volume for long time. Otherwise it will injure your ear If you feel uncomfortable, please stop using\r\n3. Please maintain the products all the time, avoid ear plug and sound collecting hole being blocked by foreign objects. It will affect the effect of sound amplifier\r\n4. Avoid shocking, falling the product. Don't keep or use it in environment of humid or high temperature\r\n5. Don't throw the scrapped battery as common rubbish, it should be handled by special equipment\r\n6. Please take out the battery if don't use it for a long time. Otherwise the components will be rotted by time. Rotten liquid from battery\r\n7. Don't use the product in potential explosive or dangerous environment\r\n8. Keep the unit away from the children. It will injure him or others, or damage the unit\r\n• Color: Fleshcolor, and more details are shown as pictures\r\nPLS NOTE that due to lighting effects, monitor's brightness / contrast settings etc, there could be some slight differences in the color tone of the pictures and the actual item!",
      "price" : "8,500.00",
      "instock" : "10",
      "category" : "Audi Equipment",
      "photo" : "00138.png"
    },
    {
      "id" : "00139",
      "name" : "GP80UP Android Smart Projector Supports Wifi & Bluetooth",
      "description" : "GP80UP+ High-definition LCD Projector is specially designed for Home Theater, Entertainment, Business Conference, Education Training, etc. Its physical (native) resolution is up to 800 * 480 Pixels and maximum resolution is up to 1920 * 1080. Support a variety of Video, Pictures and Music formats. And, its 220 ANSI Lumens ensures high-definition and bright images. It will bring you much convenient and unexpected experience whether in your daily life or in your work.\r\n1. Product Type: Portable Smart Projector.\r\n2. Configuration type: Android version 6.01 OS.\r\n3. Hardware main chip: MStar V69 + Amlogic S905X.\r\n4. Physical resolution: SVGA / 800 x 480 Pixels Physical resolution.\r\n5. Lamp Life and Type: LED light source,above 30,000HRS.\r\n6. LED Luminous efficiency: ~90%; 1800 ansi Lumens.\r\n7. Peak Brightness: 220 lux.\r\n8. Contrast Ratio 1800:1 / static, 10,000:1 / Dynamic.\r\n9. Max. Supported Resolution: 4K x 2K @60Hz.\r\n10. Aspect Ratio: Native 16:9, compatible 4:3.\r\n11. Display Type: a Single LCD Panel Hybrid LED Light Source Imaging Optical Engine.\r\n12. LCD Size: 4.0 inch Liquid Crystal Display.\r\n13. Projection mode: Front & Rear,support Ceiling or by MINI tripod.\r\n14. Throw Ratio: 1.38:1.\r\n15. Image Size (Diagonal): 28 inch ~ 180 inch.\r\n16. Projection Distance: 1.2 ~ 5.5m.\r\n17. Best screen size / Distance: 60 inch ~ 80 inch / 2.2 ~ 2.6m.\r\n18. Projection mod flip: up and down, left and right.\r\n19. Projection Lens: Manual lens / focus.\r\n20. Keystone Correction: Vertical: +/-15 degree.\r\n21. I.R (remote control receiver) x 1 (Front, facing user).\r\n22. Speakers: 4ohm, 5W x 1 (SRS Sound Technology).\r\n23. Video Compatibility: SDTV (480i, 576i) / EDTV (480p, 576p) / HDTV (720p, 1080i, 1080p), NTSC (M, 3.58/4.43 MHz), PAL (B,D,G,H,I,M,N) SECAM (B,D,G,K,K1,L).\r\nAndroid configuration.\r\n(S905X chip compatibility):\r\n1. Android Version: 6.01 OS.\r\n2. Chipset Manufacturer/model: Amlogic S905X.\r\n3. CPU Processor: Quad core ARM Cortex-A53 CPU and Penta-core ARM Mali-450 GPU.\r\n4. Maximum frequency speed: 2.0GHz.\r\n5. RAM: 1G byte DDR / ROM (Internal Storage): 8G byte.\r\n6. Maximum resolution: 4K x 2K.\r\n7. Wifi Spec: 802.11 b/g; Bluetooth Spec: 4.0.\r\n8. Ethernet: with RJ45 (network) Port.\r\n9. Android Launcher Customized.\r\n10. Easy by Google play store, any APK online install.",
      "price" : "67,000.00",
      "instock" : "10",
      "category" : "Projectors",
      "photo" : "00139.png"
    },
    {
      "id" : "00140",
      "name" : "Miniature CCTV Camera Microphone Bug For Capturing Audio And Sound",
      "description" : "Do you wish to secretly listen to all conversations in your home of office? Do you have a new CCTV installation or an existing one that you wish you could add audio functionality to? Do you want to hear all gossips and malicious conversations aimed at denigrating your personality? Or you want audio visual evidence of a transaction or encounter? This mic installs neatly beside your CCTV camera without being noticed. It can pick up clear sounds for up to 25 metres and beyond.\r\nNothing beats empirical evidence in these days of increasing insecurity and crime. You could even share your CCTV camera's power supply with it. Just plug power into power port and plug data into the other and connect the other data end to the DVR and voila! You can hear everything.\r\nOne add-on mini audio box for all Camera which need audio function High Sensitive microphone and 12V power regulator built-in box\r\nPlug & Play\r\nExtremely Sensitive\r\nGreat for Security Monitoring\r\nHigher S/N Ratio\r\nRange : 150 Square metres\r\nAudio Output: RCA Female\r\nSensitivity : 200mA/ubar\r\nWork current :5 mA-60mA\r\nWork Voltage:9-12V\r\nFrequency:200-6000HZ\r\nMax output Voltage:5V-upp\r\nPackage includes:\r\n1x AUDIO CCTV MICROPHONE for Camera",
      "price" : "2,100.00",
      "instock" : "10",
      "category" : "Audio Equipment",
      "photo" : "00140.png"
    },
    {
      "id" : "00141",
      "name" : "One Trip Grip Shopping Grocery Carrier Lock Labor Saving Tool For Bags",
      "description" : "Brand new and high quality\r\nIdeal for carrying multiple bags\r\nOversized, soft squeeze grip design, supports ease of carrying heavy weight\r\nHigh strength, with a capacity to carry up to 22kg\r\nMade of ABS plastic, durable with light weight\r\nMulti colours",
      "price" : "1,180.00",
      "instock" : "10",
      "category" : "Home Accessories",
      "photo" : "00141.png"
    },
    {
      "id" : "00142",
      "name" : "Door/Window Magnetic Entry Alarm With 105db Siren",
      "description" : "This mini magnetic contact switch alarm comprises a magnetic bar and a main part ,it will sound an alarm, when they are separated. the compact design make it easily and quickly to fix and install on any frames such as window, door,drawer,cabinet etc. This is a new alarm device system that adopts a magnetic Type Wireless Door Window Safety Contact Magnetic Security Alarm. Portable enough to take with on business trips and vacations keep yourself and your property safe and security. The intelligence gives a decent appearance which is economical and practical. Magnetic sensor switch detects entry. Easily mounted to windows or doors with included double sides’ adhesive tape, no tools required. Other great uses are for your cupboard, shed, garage, toolboxes, etc.\r\nFeatures:\r\nNew and good quality\r\nEnvironmental economy, high temperature resistant, corrosion resistant\r\nConvenience in installation\r\nSuper environmental suitability and stability\r\nDust proof and insect prevention\r\nEasily mounted by adhesive. Type to window or door\r\nMagnetic sensor switch detects entry protecting your home or office whether you are in or out\r\nOperated by 3 pcs 1. 5V LR44 / AG 13 button cell\r\nElectronic Magnetic Sensor detects opening and closing.\r\nAlarm is activated when the two parts are separated.\r\nWidely used in home,office,stores,factory,restaurant etc.",
      "price" : "2,100.00",
      "instock" : "10",
      "category" : "Home Accessories",
      "photo" : "00142.png"
    },
    {
      "id" : "00143",
      "name" : "C90 Video Projector",
      "description" : "QUANTITY:\r\n1\r\nADD TO CART\r\nPRODUCT DESCRIPTION\r\nYou Have To Do Your Best Outside But Just Lazy And Comfortable When You Go Home.\r\nLife is not just portable and simple.Big guys like one of your decorations, more suitable in the living room.\r\nBig guys are value-preserving, like your Table, Sofa, 60 inch TV, C90 PROJECTOR......\r\nProjection System:\r\nModel Name:VIVIBRIGHT C90\r\nNative Resolution:HD Ready/1280x800Pixels Physical Resolution\r\nLED Luminous Efficiency:About 95%;3500 LMS LED Light Output Brightness\r\nContrast Ratio:3000:1/static,10,000:1/Dynamic\r\nMax.Supported Resolution:Full HD(1920X1080P)@60Hz\r\nLamp Life and Type:LED light source,above 30,000HRS\r\nNoiseLevel:About 32dB(The distance between people and projector about 2.5m)\r\nThrow Ratio:1.45:1\r\nImage Size(Diagonal):35''~180''\r\nProjection Distance:1.2~5.5m\r\nBest screensize/Distance:72''~120''/2.5~3.5m\r\nProjection Lens:Manual lens/focus\r\nAspect Ratio: native 16:9, compatible 4:3\r\nUSB multimedia format:\r\nMovie format support :MPG,AVI,TS,MOV,MKV,DAT,MP4,VOB /1080P Level\r\nAudio format :MP3,WMA,AAC,M4a(aac)...\r\nPicture format: JPG,JPEG,BMP,PNG\r\nE-book read:TXT, LRC etc\r\nWarm Tips:\r\n1.This VIVIBRIGHT's C90 projector is highly recommended for great home entertainment at an affordable price. Not recommend for non-video entertainment occasions.\r\n2.This projector don't support Dulby sound, Dolby sound need be converted to other audio formats through third-party software to use.\r\nPackage Includes:\r\n1*VIVIBRIGHT Projector\r\n1*Remote controller(battery is not included)\r\n1*VGA cable\r\n1*3 in 1 AV cable\r\n1*Quick and easy operation manual\r\n1*Power Cable",
      "price" : "95,000.00",
      "instock" : "10",
      "category" : "Projectors",
      "photo" : "00143.png"
    },
    {
      "id" : "00144",
      "name" : "HDMI Male To Dual Female HDMI Cable Adapter Splitter 1080P For TV",
      "description" : "This HDMI Cable Adapter is ideal for connecting one HDMI compatible device (Xbox, Blueray, DVD players, PS3) to two visual output devises. It takes a signal from one device such as a bluray player and will directly transfer to one of two output devices that are plugged into it.\r\nFeatures:\r\nHDMI male to 2 female cable adapter / splitter\r\nYou can only connect one input device (eg. DVD player) to two HDMI output device (eg. TV)\r\nThe two female interfaces can display at the same time\r\nSuitable for high definition image resolution up to 1080P\r\nGold-plated connector for better signal transfer\r\nAllow to connect HDMI devices that have built-in HDMI ports, like HDTV, DVD Player, satellite boxes, LCD monitor and projectors\r\nType: Adapter\r\nMaterial: Plastic\r\nInterface: HDMI\r\nAvailable Color: Black\r\nPackage weight: 0.088 kg\r\nProduct size (L x W x H): 27.00 x 4.60 x 1.10 cm / 10.63 x 1.81 x 0.43 inches\r\nPackage size (L x W x H): 14.00 x 6.00 x 3.00 cm / 5.51 x 2.36 x 1.18 inches\r\nPackage Contents: 1 x HDMI Male to Dual Female HDMI Cable Adapter Splitter",
      "price" : "3,000.00",
      "instock" : "10",
      "category" : "Computer Accessories",
      "photo" : "00144.png"
    }
  ]
}
